#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Author: bazimaster
# CreateDate: 2019-2-21

import collections
from bidict import bidict

from ganzhi import *

xingxius = {
    0: ('角', ""),
    1: ('亢', ""),
    2: ('氐', ""),
    3: ('房', ""),    
    4: ('心', ""),
    5: ('尾', ""),
    6: ('箕', ""),
    7: ('斗', ""),   
    8: ('牛', ""),
    9: ('女', ""),
    10: ('虛', ""),
    11: ('危', ""), 
    12: ('室', ""),
    13: ('壁', ""),
    14: ('奎', ""),
    15: ('婁', ""),    
    16: ('胃', ""),
    17: ('昴', ""),
    18: ('畢', ""),
    19: ('觜', ""),    
    20: ('參', ""),
    21: ('井', ""),
    22: ('鬼', ""),
    23: ('柳', ""),   
    24: ('星', ""),
    25: ('張', ""),
    26: ('翼', ""),
    27: ('軫', ""),      
}

jianchus = {
    0: ('建', "氣專而強，宜官府公事等。 宜：赴任、祈福、求嗣、求財、交涉、出行。 忌：上樑、嫁娶、安葬。"),
    1: ('除', "除舊布新的日子。 宜：祭祀、祈福、嫁娶、出行、入宅、動土、開光、交易。 忌：嫁娶、探病。"),
    2: ('滿', "豐收之意。 宜：嫁娶、祈福、出行、安床、求財、裁衣、祭祀。 忌：造葬、赴任、求醫。"),
    3: ('平', "普通的日子。 宜：修造、粉刷牆壁、修補。 忌：出行。"),    
    4: ('定', "月令三合的日子。 宜：祭祀、祈福、嫁娶、造屋、求嗣、納財。 忌：訴訟、出行、交涉。"),
    5: ('執', "守成之意。 宜：納采、嫁娶、動土、入殮。 忌：入宅、開市。"),
    6: ('破', "日月相沖，曰大耗，諸事不宜。 宜：破屋壞垣 忌：不宜諸吉事。"),
    7: ('危', "吉事不取的日子。 宜：入殮、破土、火化、進塔、安葬。 忌：入宅嫁娶諸吉事。"),   
    8: ('成', "月支的三合日，吉神的日子。 宜：結婚、開市、修造、動土、安床、破土、安葬、搬遷、交易、求財、出行、立契、豎柱、裁種、牧養。 忌：訴訟。"),
    9: ('收', "收成、收穫的日子。 宜：祈福、求嗣、赴任、嫁娶、安床、修造、動土、求學、開市、交易、買賣、立契。 忌：破土、安葬。"),
    10: ('開', "重新開展的好日子。 宜：祭祀、祈福、開光、入宅、嫁娶、上任、修造、動土、開市、安床、交易、出行、豎柱。 忌：訴訟、安葬。"),
    11: ('閉', "閉藏的日子 宜：安門、伐木、修造、動土。 忌：出行、嫁娶。"), 
}


nayins = {
    ('甲', '子'): '海中金', ('乙', '丑'): '海中金', ('壬', '寅'): '金泊金', ('癸', '卯'): '金泊金',
    ('庚', '辰'): '白蠟金', ('辛', '巳'): '白蠟金', ('甲', '午'): '砂中金', ('乙', '未'): '砂中金',
    ('壬', '申'): '劍鋒金', ('癸', '酉'): '劍鋒金', ('庚', '戌'): '釵釧金', ('辛', '亥'): '釵釧金',
    ('戊', '子'): '霹靂火', ('己', '丑'): '霹靂火', ('丙', '寅'): '爐中火', ('丁', '卯'): '爐中火',
    ('甲', '辰'): '覆燈火', ('乙', '巳'): '覆燈火', ('戊', '午'): '天上火', ('己', '未'): '天上火',
    ('丙', '申'): '山下火', ('丁', '酉'): '山下火', ('甲', '戌'): '山頭火', ('乙', '亥'): '山頭火',
    ('壬', '子'): '桑柘木', ('癸', '丑'): '桑柘木', ('庚', '寅'): '松柏木', ('辛', '卯'): '松柏木',
    ('戊', '辰'): '大林木', ('己', '巳'): '大林木', ('壬', '午'): '楊柳木', ('癸', '未'): '楊柳木',
    ('庚', '申'): '石榴木', ('辛', '酉'): '石榴木', ('戊', '戌'): '平地木', ('己', '亥'): '平地木',
    ('庚', '子'): '壁上土', ('辛', '丑'): '壁上土', ('戊', '寅'): '城頭土', ('己', '卯'): '城頭土',
    ('丙', '辰'): '砂中土', ('丁', '巳'): '砂中土', ('庚', '午'): '路旁土', ('辛', '未'): '路旁土',
    ('戊', '申'): '大驛土', ('己', '酉'): '大驛土', ('丙', '戌'): '屋上土', ('丁', '亥'): '屋上土',
    ('丙', '子'): '澗下水', ('丁', '丑'): '澗下水', ('甲', '寅'): '大溪水', ('乙', '卯'): '大溪水',
    ('壬', '辰'): '長流水', ('癸', '巳'): '長流水', ('丙', '午'): '天河水', ('丁', '未'): '天河水',
    ('甲', '申'): '井泉水', ('乙', '酉'): '井泉水', ('壬', '戌'): '大海水', ('癸', '亥'): '大海水',    
}

empties = {
    ('甲', '子'): ('戌','亥'), ('乙', '丑'):('戌','亥'), 
    ('丙', '寅'): ('戌','亥'), ('丁', '卯'): ('戌','亥'), 
    ('戊', '辰'): ('戌','亥'), ('己', '巳'): ('戌','亥'),
    ('庚', '午'): ('戌','亥'), ('辛', '未'): ('戌','亥'),
    ('壬', '申'): ('戌','亥'), ('癸', '酉'): ('戌','亥'),

    ('甲', '戌'): ('申','酉'), ('乙', '亥'): ('申','酉'),
    ('丙', '子'): ('申','酉'), ('丁', '丑'): ('申','酉'),
    ('戊', '寅'): ('申','酉'), ('己', '卯'): ('申','酉'),
    ('庚', '辰'):('申','酉'), ('辛', '巳'): ('申','酉'),
    ('壬', '午'): ('申','酉'), ('癸', '未'): ('申','酉'),

    ('甲', '申'): ('午','未'), ('乙', '酉'): ('午','未'),
    ('丙', '戌'): ('午','未'), ('丁', '亥'): ('午','未'),
    ('戊', '子'): ('午','未'), ('己', '丑'): ('午','未'), 
    ('庚', '寅'): ('午','未'), ('辛', '卯'): ('午','未'),
    ('壬', '辰'): ('午','未'), ('癸', '巳'): ('午','未'),

    ('甲', '午'): ('辰','己'), ('乙', '未'): ('辰','己'),
    ('丙', '申'): ('辰','己'), ('丁', '酉'): ('辰','己'),
    ('戊', '戌'): ('辰','己'), ('己', '亥'): ('辰','己'),
    ('庚', '子'): ('辰','己'), ('辛', '丑'): ('辰','己'),
    ('壬', '寅'): ('辰','己'), ('癸', '卯'): ('辰','己'),

    ('甲', '辰'): ('寅','卯'), ('乙', '巳'): ('寅','卯'),
    ('丙', '午'): ('寅','卯'), ('丁', '未'): ('寅','卯'),
    ('戊', '申'): ('寅','卯'), ('己', '酉'): ('寅','卯'),
    ('庚', '戌'): ('寅','卯'), ('辛', '亥'): ('寅','卯'),
    ('壬', '子'): ('寅','卯'), ('癸', '丑'): ('寅','卯'), 


    ('甲', '寅'): ('子','丑'), ('乙', '卯'): ('子','丑'),     
    ('丙', '辰'): ('子','丑'), ('丁', '巳'): ('子','丑'), 
    ('戊', '午'): ('子','丑'), ('己', '未'): ('子','丑'),
    ('庚', '申'): ('子','丑'), ('辛', '酉'): ('子','丑'), 
    ('壬', '戌'): ('子','丑'), ('癸', '亥'): ('子','丑'),    
}


emptie4s = {
    ('甲', '子'): '水', ('乙', '丑'):'水', 
    ('丙', '寅'): '水', ('丁', '卯'): '水', 
    ('戊', '辰'):  '水', ('己', '巳'):  '水',
    ('庚', '午'):  '水', ('辛', '未'):  '水',
    ('壬', '申'):  '水', ('癸', '酉'):  '水',

    ('甲', '申'):  '金', ('乙', '酉'):  '金',
    ('丙', '戌'):  '金', ('丁', '亥'):  '金',
    ('戊', '子'):  '金', ('己', '丑'):  '金', 
    ('庚', '寅'):  '金', ('辛', '卯'):  '金',
    ('壬', '辰'):  '金', ('癸', '巳'):  '金',

    ('甲', '午'):  '水', ('乙', '未'):  '水',
    ('丙', '申'):  '水', ('丁', '酉'):  '水',
    ('戊', '戌'):  '水', ('己', '亥'):  '水',
    ('庚', '子'):  '水', ('辛', '丑'):  '水',
    ('壬', '寅'):  '水', ('癸', '卯'):  '水',


    ('甲', '寅'):  '金', ('乙', '卯'):  '金',     
    ('丙', '辰'):  '金', ('丁', '巳'):  '金', 
    ('戊', '午'):  '金', ('己', '未'):  '金',
    ('庚', '申'):  '金', ('辛', '酉'):  '金', 
    ('壬', '戌'):  '金', ('癸', '亥'):  '金',    
}

minggongs = {
    "子": "天貴星、志氣不凡、富裕清吉。",
    "丑": "天厄星、先難後吉、離祖勞心、晚年吉。",
    "寅": "天權星、聰明大器、中年有權柄。",
    "卯": "天赦星、慷慨疏財、得權時須謙遜。",
    "辰": "天如星、事多翻覆、機謀多能。",
    "巳": "天文星、文章振發、女命有好夫。",
    "午": "天福星、榮華吉命。",
    "未": "天驛星、一生勞碌、離祖始安。",
    "申": "天孤星、不宜早婚、女命妨夫。",
    "酉": "天秘星、性情剛直、時有是非。",
    "戌": "天藝星、心性平和、藝道有名。",
    "亥": "天壽星、心慈明悟、克己助人。",

}

rizhus = {
	"甲子": "雖坐沐浴，若四往有祿，看印，冬生不作妻敗", 
	"乙丑": "身坐財官，有乙庚合最吉", 
	"丙寅": "金絕水死，財官俱背，但丙火長生食神獨旺，主有壽，己亥、辛卯、癸巳時貴", 
	"丁卯": "財官俱背，須合氣、祿、火扶", 
	"戊辰": "壬庚入墓，乙木自坐財官", 
	"己巳": "水絕木病，丙寅時貴", 
	"庚午": "庚金坐死但午上自坐官、印，雖敗不困", 
	"辛未": "身旺，丙申時貴", 
	"壬申": "水辰生位，聰明秀麗", 
	"癸酉": "財官無氣，要用旺者吉", 
	"甲戌": "身坐旺官，臨火庫，心懷慈善，丙寅時貴", 
	"乙亥": "日坐木局，丙壬、壬午、甲申時貴", 
	"丙子": "身坐財啊．癸巳時", 
	"丁丑": "金庫榮豐，見辛亥時貴", 
	"戊寅": "甲木當局，官殺者吉", 
	"己卯": "身坐殺地，須身殺力停者吉",
	"庚辰": "魁罡，忌於刑沖", 
	"辛巳": "金局坐死不妨，戊子時貴", 
	"壬午": "財官雙美，伶俐有謀，壬寅時貴", 
	"癸未": "身坐殺位須身力二停", 
	"甲申": "坐絕，四柱俱絕者吉", 
	"乙酉": "坐殺四乙酉或有化殺則吉，辛巳時，為化氣金局貴", 
	"丙戌": "夏生則財官無氣", 
	"丁亥": "日貴，壬寅時，乙巳時皆貴", 
	"戊子": "自坐財，乙卯時，丁巳時貴", 
	"己丑": "有財無官，丙寅時貴", 
	"庚寅": "坐絕反主吉昌", 
	"辛卯": "財衰無妨，見戊子時貴", 
	"壬辰": "魁罡、不喜沖刑，遇建祿反卑", 
	"癸巳": "財官雙美最吉祥，丁已時貴", 
	"甲午": "夏生大吉", 
	"乙未": "逢財傷官格", 
	"丙申": "身坐財，庚寅時貴，癸巳時亦吉", 
	"丁酉": "臨財學精，壬寅時貴", 
	"戊戌": "魁罡，忌沖刑", 
	"己亥": "自坐財官得高名，丙寅時貴", 
	"庚子": "有丁火則吉", 
	"辛丑": "食神榮昌，主壽", 
	"壬寅": "水火既濟，見壬寅時大吉", 
	"癸卯": "日貴，衰神旺吉", 
	"甲辰": "身坐財庫水氣，性善良，丙寅時吉", 
	"乙巳": "男女妨家室，有壬者輕", 
	"丙午": "日刃喜刑沖，男、女妨家室，見乙、癸者輕", 
	"丁未": "坐印小吉", 
	"戊申": "甲絕有財無官", 
	"己酉": "財祿一背，皆須生扶", 
	"庚戌": "魁罡，忌火旺地支之運及沖刑", 
	"辛亥": "財生，官絕", 
	"壬子": "日刃喜刑沖", 
	"癸丑": "喜沖不作災論", 
	"甲寅": "財官二背，見辛未時貴", 
	"乙卯": "財官無氣，見庚辰時貴", 
	"丙辰": "冬生不吉，庚寅時貴", 
	"丁巳": "男、女妨家室．有戊者重，甲、寅者輕", 
	"戊午": "日刃喜刑沖，四、五月在刑地亦吉", 
	"己未": "丙寅時貴（無水大吉）", 
	"庚申": "日德、日祿、壽", 
	"辛酉": "日祿、戊子、丙申時貴", 
	"壬戌": "元武當權．等作財官雙美", 
	"癸亥": "得癸亥時夫貴", 
}

#ges = {
     #('庚', '子'):'飛天祿馬', ('壬', '子'):'飛天祿馬',
     #('辛', '亥'):'飛天祿馬', ('癸', '亥'):'飛天祿馬',     
#}

#ge_descs = {
    #'飛天祿馬':'''
    #若逢傷官月建,如兇處,未必為兇,內有倒祿飛沖,忌官星,亦嫌羈絆。
    #柱無財官,方用。又須月時或年與日同支,方能並沖。
    #'''
#}

up_down_hes = (('戊','子'),('辛','巳'), ('壬','午'), ('丁','亥'))

lu_types = {
    "甲":{('丙','寅'):'福星祿 名位祿 吉', ('戊','寅'):'伏馬祿 吉', 
           ('庚','寅'):'破祿，半吉半兇', ('壬','寅'):'正祿，帶截路空亡，必為僧道 不吉',
           ('甲','寅'):'長生祿，大吉', ('乙','卯'):'生成祿，大吉',},
    "乙":{('乙','卯'):'喜神旺祿 吉', ('丁','卯'):'截路空亡 兇', 
           ('己','卯'):'進神祿 吉', ('辛','卯'):'破祿，又為交神，半吉半兇',
           ('癸','卯'):'死祿 雖貴終貧 兇',},
    "丙":{('己','巳'):'九天庫祿 吉', ('辛','巳'):'截路空亡 兇', 
           ('乙','巳'):'旺馬祿 吉', ('丁','巳'):'庫祿 吉',
           ('癸','巳'):'伏貴神祿，半吉半兇',}, 
    "丁":{('庚','午'):'截路空亡 兇', ('壬','午'):'德合祿 吉', 
           ('甲','午'):'進神祿 吉', ('丙','午'):'喜神祿，交羊刃，半吉',
           ('戊','午'):'伏羊刃 祿，多兇',},   
    "戊":{('己','巳'):'九天庫祿，吉', ('辛', '巳'):'截路空亡 兇', 
           ('癸','巳'):'貴神祿，戊癸化合，有官位重 吉', ('乙','巳'):'驛馬同鄉祿 吉',
           ('戊','巳'):'旺庫祿 吉',},    
    "己":{('庚','午'):'截路空亡 兇', ('壬','午'):'死鬼祿 兇', 
           ('甲','午'):'進神合祿 顯達之象 吉', ('丙','午'):'喜神祿 半吉',
           ('戊','午'):'伏神羊刃祿，兇',},  
    "庚":{('壬','申'):'大敗祿 兇', ('甲', '申'):'截路空亡祿 兇', 
           ('丙','申'):'大敗祿，多成敗 半吉', ('戊','申'):'伏馬祿，多滯，若值福星，貴吉',
           ('庚','申'):'長生祿，大吉',},      
    "辛":{('癸','酉'):'伏神祿，水火相犯，兇', ('乙','酉'):'破祿 成敗 兇', 
           ('丁','酉'):'空亡貴神祿 丁木受氣，辛水沐浴，主姦淫事；值喜神，吉。', 
           ('己','酉'):'進神祿 吉', ('辛','酉'):'正祿 吉',},    
    "壬":{('丁','亥'):'貴神合祿 吉', ('乙', '亥'):'天德祿 吉', 
           ('己','亥'):'旺祿 大吉', ('辛','亥'):'同馬鄉祿 大吉',
           ('癸','亥'):'大敗祿，貧薄 兇',},     
    "癸":{('甲','子'):'進神祿，主登科進達 吉', ('丙','子'):'交羊刃祿，帶福星，貴有權。 吉', 
           ('戊','子'):'伏羊刃合貴祿 半吉', 
           ('庚','印祿'):'進神祿 吉', ('壬','子'):'正羊刃祿，兇',},        
}


wenxing = {"甲":'午', "乙":"巳", "丙":"申", "丁":"酉", "戊":"申", "己":"酉", 
           "庚": "戌", "辛":"亥", "壬": "寅", "癸":"卯"}
tianyin =  {"甲":'寅',  "乙":"亥", "丙":"戌", "丁":"酉", "戊":"申", "己":"未", 
            "庚": "午", "辛":"巳", "壬": "辰", "癸":"卯"}
xuetangs = {'金':("辛","巳"), '木':("己","亥"), '水':("甲","申"), 
            '火':("丙", "寅"), '土':("戊","申")}

# 天乙貴人，有兩種分法
tianyis =  {"甲":'未',  "乙":"申", "丙":"酉", "丁":"亥", "戊":'丑', "己":"子", 
            "庚": "丑", "辛":"寅", "壬": "卯", "癸":"巳"}

# 玉堂貴人，有兩種分法
yutangs =  {"甲":'丑',  "乙":"子", "丙":"亥", "丁":"酉", "戊":'未', "己":"申", 
            "庚": "未", "辛":"午", "壬": "巳", "癸":"卯"}

wangs = {"子":"亥", "丑":"申", "寅":"巳", "卯":"寅", "辰":"亥", "巳":"申", 
            "午":"巳", "未":"寅", "申":"亥", "酉":"申", "戌":"巳", "亥":"寅"}
jieshas = {"子":"巳", "丑":"寅", "寅":"亥", "卯":"申", "辰":"巳", "巳":"寅", 
         "午":"亥", "未":"申", "申":"巳", "酉":"寅", "戌":"亥", "亥":"申"}
            
ma_zhus =  {
    ("甲","申"):'截路空日馬', ("丙","申"):'截路空日馬', ("戊","申"):'福星伏馬', 
    ("庚","申"):'逢天關馬', ("壬","申"):'大敗馬', 
    ("甲","寅"):'正祿文星馬', ("丙","寅"):'福星馬', ("戊","寅"):'伏馬', 
    ("庚","寅"):'破祿馬', ("壬","寅"):'截路馬',   
    ("乙","亥"):'天德馬', ("丁","亥"):'天乙馬', ("己","亥"):'旺祿馬', 
    ("辛","亥"):'正祿馬', ("癸","亥"):'大敗馬',     
    ("乙","巳"):'正祿馬', ("丁","巳"):'旺氣馬', ("己","巳"):'九天祿庫馬', 
    ("辛","巳"):'截路馬', ("癸","巳"):'天乙伏馬',      
}   



jianlu_desc = '''

================  建祿格 ================  比例 1/12
喜: 財、官和印綬  忌: 忌傷官和劫財；  殺不可太旺。
頗宜時帶偏官、偏財或食神，更看年時上露者取用，若略見財官，反爭奪不吉。
難招祖業，必主平生見財不聚，卻病少壽長，行運再見比，克妻妨父損子，或官非破財，或因妻孥財帛爭奪。
有財官，引旺得地，官星有助，運臨官星有氣之地，亦貴；財星有助，運臨財旺之地，亦富；財官俱旺，乃富貴之命。
若時逢財庫，運至財鄉，必主晚年大富。年上財官有助，必享祖蔭。
若四柱元無財官，縱運行財官之地，亦止虛花而已。命無財官，歲運又行比，一生貧蹇。
'''

jianlus = {
    ('甲', '寅'):'柱中乙卯未字多，主無祖財，[劫財]克妻，一世孤貧，作事虛詐，為人大模樣',
    ('乙', '卯'):'''
    柱有庚辛巳酉丑申及戊己巳午辰戌等字，財官多則貴，壬癸申子辰亥水印成局亦佳，更運逢之尤妙''',   
    ('丙', '巳'):'歲時干支水金成局，運歷財官旺地，亦主富貴。',    
    ('丁', '午'):'''
    金敗水絕，財[庚-沐浴]官[壬-胎]俱背，順運克妻，逆運克三妻，若柱有巳酉丑庚辛壬癸亥申子辰，
    運臨財官旺地亦發，用煞或印，以多為貴，若止建祿，亦同前斷。''',
    ('戊', '巳'):
    '''年日時無水，主克妻[癸-胎]，無祖業，子[病]多不肖，柱中多有官則吉，如見偏官，主尊貴，
    歲月若是火多及或印綬，雖無財官，主吉，若柱內隱顯壬癸亥申子辰水局，晚子一二，
    有甲寅乙卯亥未木局，運至財官旺地亦發。''',   
    ('己', '午'):'''
    以壬水為財，五月水囚[壬-胎]，主無祖業，克妻，子[乙-長生]亦不多，
    歲時透出寅甲為正官，五月甲死，官必卑小，喜見亥卯未乙，身旺見官煞為妙，偏財亦美。''',
    ('庚', '申'):'''
    上旬生，近木餘氣，略無祖財，雖節氣臨水絕之鄉，尚有三四分庫財為福，運至丙戌，財盡矣，
    若年日時多帶財，好命看，見丙丁巳午寅戌火局則有官，以煞化官也，官小亦不清顯，怕壬癸亥子，克官不成。''',

    ('戊', '巳'):
    '''年日時無水，主克妻[癸-胎]，無祖業，子[病]多不肖，柱中多有官則吉，如見偏官，主尊貴，
    歲月若是火多及或印綬，雖無財官，主吉，若柱內隱顯壬癸亥申子辰水局，晚子一二，
    有甲寅乙卯亥未木局，運至財官旺地亦發。''',   
    ('己', '午'):'''
    以壬水為財，五月水囚[壬-胎]，主無祖業，克妻，子[乙-長生]亦不多，
    歲時透出寅甲為正官，五月甲死，官必卑小，喜見亥卯未乙，身旺見官煞為妙，偏財亦美。''',
    ('庚', '申'):'''
    上旬生，近木餘氣，略無祖財，雖節氣臨水絕之鄉，尚有三四分庫財為福，運至丙戌，財盡矣，
    若年日時多帶財，好命看，見丙丁巳午寅戌火局則有官，以煞化官也，官小亦不清顯，怕壬癸亥子，克官不成。''',

    ('辛', '酉'):'''
    無祖財，柱中多見分奪，孤貧[甲-胎]無妻，或克妻無財，若帶木火生旺，又當富貴，原無財官，
    又行生地，其劫禍尤重，或見辛酉則為專祿，更有財官印食之神歲運再逢尤好，逆運南方則吉，
    順運北方，百事無成，若辛卯、辛未日身自坐財，可許衣祿，辛巳日有貴，官祿亦輕。''',
                                                                                                                               
    ('壬', '亥'):'''
    無祖業，柱中多見火土，主自成立有官，如見水多氾濫，無成、克妻、貧薄。''',
                                                                                                                               
    ('癸', '子'):'''
    無祖業，柱中多見火土，主自成立有官，如見水多氾濫，無成、克妻、貧薄。''',
}

shang_guans = {
    '火': '傷盡。','金': '要見官', '木': '官要旺','土':'傷盡。', '水': '傷官木也要土'}

tianyuans = {
    '火': '主兵權，為將鎮三邊。',
    '金': '有重權，防禦刺史臣', 
    '木': '傷衰化煞，為權勢若雷',
    '土':'正祿八座三臺福。', 
    '水': '入官局，可沾侍郎祿'}

lu_ku_cai = {"甲":'丑', "乙":"丑", "丙":"午", "丁":"午", "戊":"辰", "己":"辰", 
            "庚": "未", "辛":"未", "壬": "戌", "癸":"戌"}
self_zuo = {
    '官':'''''',        
    '殺':'''天元坐殺：喜旺，忌明現食傷。無官煞復克，喜印化煞，財旺身旺。為人心多性急，陰險懷毒，僭偽謀害，不近人情.
    如無助化，再行煞旺運，或再見煞克，為人必面目瘢痕，侏儒跛鱉，駢指瘤贅，奸貪猛暴，恃強不憚，累犯憲章。克重多夭，合格為武貴。''',                 
    '財':'''''',
    '才':'''''',    
    '印':'''''',
    '梟':'''''',      
    '食':'''''',
    '傷':'''''',     
    '比':'''''',
    '劫':'''''',       
}


year_shens = {
    '孤辰':{"子":"寅", "丑":"寅", "寅":"巳", "卯":"巳", "辰":"巳", "巳":"申", 
              "午":"申", "未":"申", "申":"亥", "酉":"亥", "戌":"亥", "亥":"寅"},
    '寡宿':{"子":"戌", "丑":"戌", "寅":"丑", "卯":"丑", "辰":"丑", "巳":"辰", 
              "午":"辰", "未":"辰", "申":"未", "酉":"未", "戌":"未", "亥":"戌"},   
    '大耗':{"子":"巳未", "丑":"午申", "寅":"未酉", "卯":"申戌", "辰":"酉亥", "巳":"戌子", 
              "午":"亥丑", "未":"子寅", "申":"丑卯", "酉":"寅辰", "戌":"卯巳", "亥":"辰午"},      
}

month_shens = {
    '天德':{"子":"巳", "丑":"庚", "寅":"丁", "卯":"申", "辰":"壬", "巳":"辛", 
            "午":"亥", "未":"甲", "申":"癸", "酉":"寅", "戌":"丙", "亥":"乙"},
    '月德':{"子":"壬", "丑":"庚", "寅":"丙", "卯":"甲", "辰":"壬", "巳":"庚", 
              "午":"丙", "未":"甲", "申":"壬", "酉":"庚", "戌":"丙", "亥":"甲"},
}
    

day_shens = { 
    '將星':{"子":"子", "丑":"酉", "寅":"午", "卯":"卯", "辰":"子", "巳":"酉", 
              "午":"午", "未":"卯", "申":"子", "酉":"酉", "戌":"午", "亥":"卯"},      
    '華蓋':{"子":"辰", "丑":"丑", "寅":"戌", "卯":"未", "辰":"辰", "巳":"丑", 
              "午":"戌", "未":"未", "申":"辰", "酉":"丑", "戌":"戌", "亥":"未"}, 
    '驛馬': {"子":"寅", "丑":"亥", "寅":"申", "卯":"巳", "辰":"寅", "巳":"亥", 
            "午":"申", "未":"巳", "申":"寅", "酉":"亥", "戌":"申", "亥":"巳"},
    '劫煞': {"子":"巳", "丑":"寅", "寅":"亥", "卯":"申", "辰":"巳", "巳":"寅", 
         "午":"亥", "未":"申", "申":"巳", "酉":"寅", "戌":"亥", "亥":"申"},
    '亡神': {"子":"亥", "丑":"申", "寅":"巳", "卯":"寅", "辰":"亥", "巳":"申", 
            "午":"巳", "未":"寅", "申":"亥", "酉":"申", "戌":"巳", "亥":"寅"},    
    '桃花': {"子":"酉", "丑":"午", "寅":"卯", "卯":"子", "辰":"酉", "巳":"午", 
            "午":"卯", "未":"子", "申":"酉", "酉":"午", "戌":"卯", "亥":"子"},        
}

g_shens = {
    '天乙':{"甲":'未丑',  "乙":"申子", "丙":"酉亥", "丁":"酉亥", "戊":'未丑', "己":"申子", 
            "庚": "未丑", "辛":"寅午", "壬": "卯巳", "癸":"卯巳"},
    '文昌':{"甲":'巳', "乙":"午", "丙":"申", "丁":"酉", "戊":"申", "己":"酉", 
            "庚": "亥", "辛":"子", "壬": "寅", "癸":"丑"},   
    '陽刃':{"甲":'卯', "乙":"", "丙":"午", "丁":"", "戊":"午", "己":"", 
            "庚": "酉", "辛":"", "壬": "子", "癸":""},     
    '紅豔':{"甲":'午', "乙":"午", "丙":"寅", "丁":"未", "戊":"辰", "己":"辰", 
            "庚": "戌", "辛":"酉", "壬": "子", "癸":"申"},       
}

shens_infos = {
    '孤辰': "孤僻、孤獨：月支容易不合群、容易30歲以後才結婚。女命官殺月干坐顧辰、獨居概率大，時支則有陰道之心。",
    '寡宿': "類似孤辰，同柱有天月德沒關係。男怕孤，女怕寡。",  
    '大耗': "意外破損，單獨沒關係。與桃花或驛馬之類同柱則危險。",
    '天德': "先天有福，日干終生有福。忌諱沖克，不怕合。女命與夫星同干更佳。",
    '月德': "先天有福，日干終生有福。忌諱沖克，不怕合。女命與夫星同干更佳。",
    '將星': "有理想、氣度、即從容不迫。",     
    '華蓋': "有藝術、水準與命格相關。",
    '驛馬': "多遷移、水準與命格相關。女驛馬合貴人，終淪落風塵。",
    '劫煞': "與貴人同柱沒關係、與亡神對沖。會三刑不佳，其他情況還好。為日主所克無大礙。",
    '亡神': "與貴人同柱沒關係、與劫煞對沖。會三刑不佳，其他情況還好。為日主所克無大礙。",  
    '桃花': "兇居多、女正官坐桃花吉。", 
    '天乙': "後天解難、女命不適合多",
    '文昌': "詩書佳，未必有福，女命多參考李清照。",   
    '陽刃': "性格剛強，女命未必佳。",     
    '紅豔': "愛得執著，不顧及地位差異。",  
}

tiaohous = {
    '甲寅': '1丙2_癸', '甲卯': '1庚2戊丙3己丁', '甲辰': '1庚2壬丁', '甲巳': '1癸2庚丁', '甲午': '1癸2庚丁','甲未': '1癸2庚丁', 
    '甲申': '1庚2壬丁', '甲酉': '1庚2丙丁', '甲戌': '1庚2壬甲3癸丁', '甲亥': '1庚2戊丁3_丙', '甲子': '1丁2丙庚', '甲丑': '1丁2丙庚',
    '乙寅': '1丙2_癸', '乙卯': '1丙2_癸', '乙辰': '1癸2戊丙', '乙巳': '1癸', '乙午': '1癸2_丙','乙未': '1癸2_丙', 
    '乙申': '1庚2己癸', '乙酉': '1癸2丁丙', '乙戌': '1癸2_辛', '乙亥': '1丙2_戊', '乙子': '1丙', '乙丑': '1丙',
    '丙寅': '1壬2_庚', '丙卯': '1壬2_己', '丙辰': '1壬2_甲', '丙巳': '1壬2癸庚', '丙午': '1壬2_庚','丙未': '1壬2_庚', 
    '丙申': '1壬2_戊', '丙酉': '1壬2_癸', '丙戌': '1甲2_壬', '丙亥': '1甲2庚戊3壬', '丙子': '1壬2己戊', '丙丑': '1壬2_甲',
    '丁寅': '1甲2_庚', '丁卯': '1庚2_甲', '丁辰': '1甲2_庚', '丁巳': '1甲2_庚', '丁午': '1壬2癸庚','丁未': '1甲2庚壬', 
    '丁申': '1甲2丙庚3戊', '丁酉': '1甲2丙庚3戊', '丁戌': '1甲2戊庚', '丁亥': '1甲2_庚', '丁子': '1丙', '丁丑': '1甲2_庚',
    '戊寅': '1丙2癸甲', '戊卯': '1丙2癸甲', '戊辰': '1甲2癸丙', '戊巳': '1甲2癸丙', '戊午': '1壬2丙甲','戊未': '1癸2甲丙', 
    '戊申': '1丙2甲癸', '戊酉': '1丙2_癸', '戊戌': '1甲2癸丙', '戊亥': '1甲2_丙', '戊子': '1丙2_甲', '戊丑': '1丙2_甲',    
    '己寅': '1丙2甲庚', '己卯': '1甲2癸丙', '己辰': '1丙2甲癸', '己巳': '1癸2_丙', '己午': '1癸2_丙','己未': '1癸2_丙', 
    '己申': '1丙2_癸', '己酉': '1丙2_癸', '己戌': '1甲2癸丙', '己亥': '1丙2戊甲', '己子': '1丙2戊甲', '己丑': '1丙2戊甲',  
    '庚寅': '1戊2丙甲3丁壬', '庚卯': '1丁2丙甲3_庚', '庚辰': '1甲2壬丁3癸', '庚巳': '1壬2丙戊3丁', '庚午': '1壬2_癸','庚未': '1丁2_甲', 
    '庚申': '1丁2_甲', '庚酉': '1丁2丙甲', '庚戌': '1甲2_壬', '庚亥': '1丁2_丙', '庚子': '1丁2丙甲', '庚丑': '1丙2甲丁',      
    '辛寅': '1己2庚壬', '辛卯': '1壬2_甲', '辛辰': '1壬2_甲', '辛巳': '1壬2癸甲', '辛午': '1壬2癸巳','辛未': '1壬2甲庚', 
    '辛申': '1壬2戊甲', '辛酉': '1壬2_申', '辛戌': '1壬2_甲', '辛亥': '1壬2_丙', '辛子': '1丙2壬戊3甲', '辛丑': '1丙2戊壬3己', 
    '壬寅': '1庚2戊丙', '壬卯': '1戊2庚辛', '壬辰': '1甲2_庚', '壬巳': '1壬2庚辛3癸', '壬午': '1癸2辛庚','壬未': '1辛2_甲', 
    '壬申': '1戊2_丁', '壬酉': '1甲2_庚', '壬戌': '1甲2_丙', '壬亥': '1戊2庚丙', '壬子': '1戊2_丙', '壬丑': '1丙2甲丁',  
    '癸寅': '1辛2_丙', '癸卯': '1庚2_辛', '癸辰': '1丙2甲辛', '癸巳': '1辛', '癸午': '1庚2癸壬','癸未': '1庚2壬辛3癸', 
    '癸申': '1丁', '癸酉': '1辛2_丙', '癸戌': '1辛2壬甲3癸', '癸亥': '1庚2戊辛3丁', '癸子': '1丙3_辛', '癸丑': '1丙2夜生貴丁',      
    
}

jins = {
    
    '甲': '辰戌丑未入墓庫運；巳未申酉亥月有夭折運；申酉戌亥月調候待改進！', 
    '乙': '辰未亥有夭壽運；寅辰午申酉調候待改進！', 
    '丙': '子酉亥有夭折運；午未亥調候待改進！',
    '丁': '子辰午亥有夭折運；寅巳午酉戌調候待改進！',
    '戊': '卯亥有夭折運；未辰戌調候待改進！',
    '己': '子寅卯酉亥有夭損運；寅卯辰巳亥子丑調候待改進！', 
    '庚': '子卯辰巳午戌有損壽運；寅卯辰巳午申調候待改進！',   
    '辛': '丑寅有夭折運；寅卯巳午酉戌亥調候待改進！',
    '壬': '巳未申有損壽運；寅卯巳午亥調候待改進！', 
    '癸': '丑寅午戌亥有損壽運；子丑辰巳午未亥調候待改進！', 
}

jinbuhuan = {
    # 2級次P64 余氏P59
    '甲子': '調候：喜丁 忌壬癸  大運：喜逆行水木 忌午未  備註：喜官殺', 
    '甲丑': '調候：喜丁 忌壬辛癸  大運：喜寅卯申酉 忌午未',
    '甲寅': '調候：喜丙癸 忌戊己  大運：喜逆行金水 忌午未  備註：財、殺', 
    '甲卯': '調候：喜庚  忌壬癸  大運：不拘順逆 忌申酉',
    '甲辰': '調候：喜庚  忌丁癸  大運：喜申酉 忌寅卯巳午 備註：正官根深',    
    '甲巳': '調候：喜癸 忌戊己  大運：喜寅卯  忌午未(夭) 備註：根深財官',
    '甲午': '調候：喜癸 忌戊己  大運：喜亥子寅卯  忌申酉 ', 
    '甲未': '調候：喜癸 忌戊乙己  大運：喜亥子寅  忌申酉(夭) 備註：根深財官',
    '甲申': '調候：喜丙 忌壬癸  大運：喜亥子寅  忌午巳(夭) 備註：忌無根殺旺',
    '甲酉': '調候：喜甲壬 忌丁  大運：喜亥子  忌午(夭) 備註：正官',
    '甲戌': '調候：喜辛壬 忌丁  大運：喜順亥未  忌辰 備註：財官',    
    '甲亥': '調候：喜丁 忌壬癸  大運：喜順寅卯  忌午未(夭) 備註：七殺',  
    
    
    '乙子': '調候：喜丙 忌壬  大運：喜戌申酉 忌亥丑  備註：忌官殺成局', 
    '乙丑': '調候：喜丙 忌辛壬  大運：喜巳午未寅卯 ',
    '乙寅': '調候：喜丙 忌壬  大運：喜巳午申酉 忌丑亥子  備註：財官', 
    '乙卯': '調候：喜丙癸  忌壬己  大運：喜巳午申酉 忌卯子亥',
    '乙辰': '調候：喜丙  忌癸  大運：喜申酉 忌戌(夭) ',    
    '乙巳': '調候：喜癸 忌戊己  大運：喜亥子卯寅  忌申酉(壽損) 備註：忌無根',
    '乙午': '調候：喜癸 忌戊己  大運：喜辰卯寅  忌申酉(災疾)  備註：忌身輕', 
    '乙未': '調候：喜癸丙 忌乙壬己  大運：喜巳午寅卯  忌申酉子(夭) 備註：官殺',
    '乙申': '調候：喜丙癸 忌壬  大運：喜未午巳  忌戊亥子 備註：忌身柔',
    '乙酉': '調候：喜癸丁 忌己壬  大運：喜未午巳  忌日主無根 備註：忌無根',
    '乙戌': '調候：喜癸辛 忌丁  大運：  忌酉亥(災疾) ',    
    '乙亥': '調候：喜丙戊 忌壬甲  大運：喜逆申酉  忌辰(夭) 備註：喜官殺', 
    
    '丙子': '調候：喜壬 忌己  大運：喜寅卯巳午 忌亥申酉(夭)  備註：印重', 
    '丙丑': '調候：喜壬甲 忌辛己  大運：喜申酉戌 忌寅卯巳午(災)  備註：喜印忌根淺 ',
    '丙寅': '調候：喜壬庚 忌己  大運：喜申酉戌 忌卯 ', 
    '丙卯': '調候：喜壬己  忌甲  大運：喜巳午未 忌寅辰 備註：忌無官',
    '丙辰': '調候：喜壬  忌癸  大運：喜戌丑 忌巳午亥子 備註：喜戊己',    
    '丙巳': '調候：喜壬庚 忌丁  大運：喜申酉寅卯  忌戌(災) 備註：喜官殺',
    '丙午': '調候：喜壬 忌己丁  大運：喜申酉亥丑  忌寅卯  備註：喜殺', 
    '丙未': '調候：喜癸庚 忌乙  大運：喜申酉亥子  忌寅卯 備註：忌殺喜官',
    '丙申': '調候：喜丙 忌壬癸  大運：喜寅卯巳午  忌亥子 備註：喜從化',
    '丙酉': '調候：喜壬癸 忌戊己  大運：喜亥子  忌寅卯(夭) 備註：忌比劫',
    '丙戌': '調候：喜甲壬 忌丁己  大運：喜寅卯  忌亥子辰 備註：喜殺忌官',    
    '丙亥': '調候：喜甲壬 忌己  大運：喜寅卯巳午  忌申酉(夭)',  
    
    '丁子': '調候：喜甲庚 忌己丙  大運：喜寅卯辰 忌申酉戌(夭)  備註：七殺', 
    '丁丑': '調候：喜甲庚 忌辛己丙  大運：喜寅卯辰 忌巳午未  備註：大忌土多 ',
    '丁寅': '調候：喜壬庚 忌己丁  大運：喜巳午未亥子 忌申酉(災禍) 備註：喜水忌土多 ', 
    '丁卯': '調候：喜庚甲  忌丙  大運：喜巳午亥子 忌寅卯申酉 備註：無官獨殺',
    '丁辰': '調候：喜甲庚 忌癸丙  大運：喜巳午未 巳戌亥(夭) ',    
    '丁巳': '調候：喜庚甲  忌丙  大運：喜庚甲  忌丙',
    '丁午': '調候：喜壬癸庚 忌丁  大運：喜亥子  忌戌未  備註：忌無水(夭)', 
    '丁未': '調候：喜甲壬庚 忌乙丁  大運：喜申酉  忌巳午 備註：喜金財',
    '丁申': '調候：喜甲庚丙 忌壬  大運：喜巳午未  忌亥子 備註：身強根深',
    '丁酉': '調候：喜辛甲丙 忌丁  大運：喜申未午巳  忌戌丑 備註：喜官殺',
    '丁戌': '調候：喜甲庚 忌丁  大運：喜寅卯巳午  忌亥子(夭) ',    
    '丁亥': '調候：喜甲庚 忌丙  大運：喜寅卯巳午  忌申酉(夭) 備註：喜官忌殺混',   
    
    '戊子': '調候：喜丙甲 忌辛  大運：喜辰戌 忌寅卯申酉  備註：喜辰戌坐支', 
    '戊丑': '調候：喜丙甲 忌辛庚  大運：喜寅卯亥子 忌巳午申酉  備註：喜財殺 ',
    '戊寅': '調候：喜丙甲癸 忌壬  大運：喜巳午未 忌亥子甲 ', 
    '戊卯': '調候：喜丙甲癸 忌辛  大運：喜巳午未 忌酉(夭) 備註：喜火',
    '戊辰': '調候：喜甲丙壬 忌癸  大運：喜申酉巳午 忌戌 備註：喜水木財官',    
    '戊巳': '調候：喜甲丙癸 忌戊  大運：喜寅卯亥子  忌申酉巳午 備註：喜財殺',
    '戊午': '調候：喜壬甲丙 忌癸  大運：喜寅卯  忌子  ', 
    '戊未': '調候：喜壬丙甲 忌乙  大運：喜寅卯辰  忌亥子',
    '戊申': '調候：喜丙甲癸 忌庚  大運：喜巳午未  忌亥子丑(災) 備註：喜財殺',
    '戊酉': '調候：喜丙癸 忌壬  大運：喜巳午  忌亥子卯 備註：喜身強',
    '戊戌': '調候：喜甲癸 忌丁  大運：忌辰 備註：喜財殺',    
    '戊亥': '調候：喜甲丙 忌辛  大運：喜巳午未  忌酉卯辰',      

    '己子': '調候：喜丙甲 忌戊  大運：喜巳未戌 忌寅卯(夭)  備註：忌身弱官殺混', 
    '己丑': '調候：喜丙甲 忌辛己  大運：子亥申酉 忌未  備註：忌比肩',
    '己寅': '調候：喜丙癸 忌壬  大運：喜巳午未 忌丑子(夭)  備註：忌身柔', 
    '己卯': '調候：喜甲癸 忌己  大運：喜巳午未 忌寅(夭) 備註：忌官殺會',
    '己辰': '調候：喜丙壬 忌癸  大運：喜巳午未 忌卯寅丑戌 ',    
    '己巳': '調候：喜癸丙辛 忌戊  大運：喜亥子寅卯  忌申酉 ',
    '己午': '調候：喜癸丙 忌己庚  大運：喜未申寅卯  忌亥子  ', 
    '己未': '調候：喜癸丙 忌乙  大運： 忌丑  備註：喜七殺',
    '己申': '調候：喜丙癸 忌甲  大運：喜巳午未  忌寅卯(夭) 備註：身強',
    '己酉': '調候：喜丙癸 忌辛  大運：喜寅巳午  忌申戌 備註：忌無根(夭)',
    '己戌': '調候：喜甲丙癸 忌丁庚  大運：忌戌 ',    
    '己亥': '調候：喜丙甲 忌己  大運：喜子丑  忌寅卯(夭)  備註：忌無根',   
    
    '庚子': '調候：喜丁丙甲 忌癸  大運：喜寅卯辰 忌午(夭)  備註：喜財殺', 
    '庚丑': '調候：喜丙甲丁 忌辛  大運：喜寅卯巳午 忌未  備註：喜木火 ',
    '庚寅': '調候：喜丙甲 忌癸  大運：喜卯巳酉 忌子丑午(災) 備註：喜透土', 
    '庚卯': '調候：喜丁甲 忌癸  大運：喜申酉 忌午(夭) 備註：喜身旺',
    '庚辰': '調候：喜甲丁戌 忌癸  大運：喜卯寅亥 忌子(夭) ',    
    '庚巳': '調候：喜壬戊丙 忌丁  大運：喜申酉亥子  忌午(夭) 備註：忌無根，缺水夭',
    '庚午': '調候：喜壬 忌丁  大運：喜寅卯辰巳  忌子(夭)  ', 
    '庚未': '調候：喜丁甲 忌乙戊己  大運：喜寅卯辰巳  忌戌辰丑(兇)',
    '庚申': '調候：喜甲丁 忌辛  大運：喜寅卯巳午  忌酉 備註：忌過旺',
    '庚酉': '調候：喜丁酉 忌癸  大運：喜巳午  忌申 備註：喜七殺',
    '庚戌': '調候：喜甲壬 忌丁  大運：喜巳午未  忌子辰(夭) ',    
    '庚亥': '調候：喜丁丙 忌癸  大運：喜辰巳午  忌卯寅(兇)  備註：喜土',       
    
    '辛子': '調候：喜丙壬 忌癸  大運：喜寅卯巳午 忌亥子  備註：喜丙丁', 
    '辛丑': '調候：喜丙 忌辛  大運：喜巳午未 忌辰戌(夭)  備註：喜丁、土多夭 ',
    '辛寅': '調候：喜己壬 忌丁  大運：喜寅卯辰 忌巳午(夭) 備註：無木則夭', 
    '辛卯': '調候：喜壬 忌庚  大運：喜巳午未 忌申酉(兇) 備註：喜支坐土',
    '辛辰': '調候：喜壬 忌癸  大運：忌戌 ',    
    '辛巳': '調候：喜壬 忌丁  大運：喜寅卯  忌午子亥 備註：忌水多',
    '辛午': '調候：喜壬 忌丁巳  大運：喜亥子寅卯  忌申酉  備註：喜根深', 
    '辛未': '調候：喜壬庚 忌乙  大運：喜寅卯辰  忌申 備註：喜金印',
    '辛申': '調候：喜壬甲 忌己  大運：喜寅卯巳午  忌酉 備註：忌支坐酉',
    '辛酉': '調候：喜壬 忌己  大運：喜巳午未  忌申戌子 備註：喜財殺',
    '辛戌': '調候：喜壬甲 忌丁  大運：忌巳辰 ',    
    '辛亥': '調候：喜壬丙 忌癸  大運：喜巳午未  忌子丑  備註：喜丙官',       
    
    '壬子': '調候：喜丙壬 忌己  大運：喜巳午未 忌亥丑(兇)  備註：喜財殺', 
    '壬丑': '調候：喜丙壬 忌辛己  大運：喜亥子巳午 忌寅卯  備註：喜財 ',
    '壬寅': '調候：喜辛丙 忌丁  大運：喜巳午未 忌申亥子 ', 
    '壬卯': '調候：喜庚辛 忌丙  大運：喜辰巳午未 忌丑亥子 ',
    '壬辰': '調候：喜丙辛 忌癸  大運：喜寅卯 忌申酉  備註：甲乙',    
    '壬巳': '調候：喜辛壬 忌丁  大運：喜申酉  忌午(夭) 備註：忌日主無根',
    '壬午': '調候：喜庚辛壬 忌丁  大運：喜亥申酉  忌戌未  備註：喜從財 ', 
    '壬未': '調候：喜庚辛壬 忌乙丁  大運：忌卯(兇夭)',
    '壬申': '調候：喜丁 忌壬癸  大運：巳午未  忌卯(兇夭) 備註：喜財',
    '壬酉': '調候：喜丙辛 忌乙  大運：忌卯 備註：喜殺忌官',
    '壬戌': '調候：喜辛甲 忌丁  大運：喜巳午  忌寅卯辰',    
    '壬亥': '調候：喜丙 忌辛癸  大運：喜寅卯巳午  忌子丑  備註：喜財出干',    
    
    '癸子': '調候：喜丙壬 忌辛  大運：喜寅卯巳午 忌申酉  備註：喜財官', 
    '癸丑': '調候：喜丙 忌辛  大運：喜寅卯巳午 忌申酉(夭)  備註：喜財印 ',
    '癸寅': '調候：喜辛丙 忌庚  大運：喜巳午未 忌申(夭)  備註：忌官殺混', 
    '癸卯': '調候：喜庚辛 忌癸  大運：喜巳午未 忌申酉(夭)   備註：忌官殺混',
    '癸辰': '調候：喜丙辛 忌癸  大運：喜申酉 忌巳午(災兇)  備註：忌無根',    
    '癸巳': '調候：喜辛壬 忌丁  大運：喜寅卯辰  忌申酉(災兇) 備註：喜有根忌七殺',
    '癸午': '調候：喜庚壬辛 忌丁  大運：喜從火財  忌申(無根夭)  備註：忌日主無根 ', 
    '癸未': '調候：喜庚壬辛 忌乙  大運：喜寅卯辰 忌刃忌官',
    '癸申': '調候：喜丁 忌癸  大運：亥子丑  忌寅 備註：忌無財局',
    '癸酉': '調候：喜丙辛 忌癸  大運：喜申未巳午  忌亥子',
    '癸戌': '調候：喜辛甲 忌丁壬  大運：喜寅卯巳午  忌亥(夭兇)',    
    '癸亥': '調候：喜丙 忌乙壬  大運：喜巳午未  忌卯(夭兇) ',  
    
}


ges = {
    
    "木": {
        "寅": "食傷生財：最佳  財格：      印格：無用     殺印相生：夭壽或多疾 官殺：平常   傷官配印：",
        "卯": "食傷生財：最佳  財格：      印格：無用     殺印相生：夭壽或多疾 官殺：佳     傷官配印：",
        "辰": "食傷生財：最佳  財格：較佳  印格：         殺印相生：           官殺：       傷官配印：",
        "巳": "食傷生財：      財格：      印格；婚姻不佳 殺印相生：           官殺：是非多 傷官配印：",   
        "午": "食傷生財：體弱多病  財格：        印格：     殺印相生：    官殺：     傷官配印：",
        "未": "食傷生財：體弱多病  財格：佳      印格：     殺印相生：    官殺：     傷官配印：",
        "申": "食傷生財：無用      財格：佳      印格：最佳 殺印相生：佳  官殺：     傷官配印：",
        "酉": "食傷生財：貧困      財格：佳      印格；最佳 殺印相生：    官殺：最佳  傷官配印：",     
        "戌": "食傷生財：貧困疾    財格：        印格：         殺印相生：    官殺：最佳 傷官配印：",
        "亥": "食傷生財：最佳      財格：        印格：         殺印相生：佳  官殺：     傷官配印：",
        "子": "食傷生財：最佳      財格：        印格：體弱多病 殺印相生：    官殺：     傷官配印：",
        "丑": "食傷生財：最佳      財格：        印格；體弱多病 殺印相生：    官殺：六親稀少 傷官配印：",  
    },
    
    "火": {
        "寅": "食傷生財：       財格：      		印格：      殺印相生：富而有體  官殺：體弱夭疾   傷官配印：",
        "卯": "食傷生財：       財格：      		印格：      殺印相生：最佳 		官殺：體弱夭疾   傷官配印：",
        "辰": "食傷生財：       財格：      		印格：      殺印相生：最佳      官殺：體弱       傷官配印：",
        "巳": "食傷生財：       財格：最佳  		印格；		殺印相生：          官殺：體弱		 傷官配印：",   
        "午": "食傷生財：       財格：      		印格：     	殺印相生：    		官殺：     		 傷官配印：最佳",
        "未": "食傷生財：       財格：      		印格：     	殺印相生：    		官殺：			 傷官配印：最佳",
        "申": "食傷生財：       財格：佳    		印格：佳 	殺印相生：			官殺：最佳       傷官配印：",
        "酉": "食傷生財：       財格：無印困財引禍  印格；最佳 	殺印相生：    		官殺：是非	     傷官配印：",     
        "戌": "食傷生財：       財格：無印困財引禍  印格：最佳  殺印相生：    		官殺：是非		 傷官配印：",
        "亥": "食傷生財：無用   財格：        		印格：		殺印相生：			官殺：無印兇有印貴     傷官配印：",
        "子": "食傷生財：無用   財格：        		印格：		殺印相生：    		官殺：無印兇有印貴     傷官配印：",
        "丑": "食傷生財：頭面疾 財格：        		印格； 		殺印相生：    		官殺： 			傷官配印：",  
    },
    
    "土": {
        "寅": "食傷生財：       財格：無用    		印格：最佳 	殺印相生： 官殺：無用   傷官配印：",
        "卯": "食傷生財：       財格：無用      	印格：最佳 	殺印相生： 官殺：    傷官配印：",
        "辰": "食傷生財：       財格：      		印格：最佳 	殺印相生： 官殺：體弱或夭折       傷官配印：",
        "巳": "食傷生財：       財格：最佳  		印格；佳 	殺印相生： 官殺：體弱多病		 傷官配印：",   
        "午": "食傷生財：       財格：大富  		印格：無用  殺印相生： 官殺：聰明     		 傷官配印： ",
        "未": "食傷生財：       財格：大富  		印格：無用  殺印相生： 官殺：聰明		 傷官配印： ",
        "申": "食傷生財：       財格：獨喜   		印格：  	殺印相生： 官殺：           傷官配印：",
        "酉": "食傷生財：富壽   財格：平常          印格；平常 	殺印相生： 官殺： 	     傷官配印：",     
        "戌": "食傷生財：       財格：              印格：獨印  殺印相生： 官殺： 		 傷官配印：",
        "亥": "食傷生財：孤寒   財格：        		印格：獨印	殺印相生： 官殺：      傷官配印：",
        "子": "食傷生財：       財格：多疾夭病 		印格：獨印  殺印相生： 官殺：無用   傷官配印：",
        "丑": "食傷生財：貧孤疾 財格：無用    		印格；獨印  殺印相生： 官殺：無用   傷官配印：",  
    },

    "金": {                                                        
        "寅": "食傷生財：無用   財格：     印格：    	殺印相生：   官殺：婚姻不佳   傷官配印：無用",
        "卯": "食傷生財：       財格：     印格：獨印 	殺印相生：   官殺：不貧則多病    傷官配印：",
        "辰": "食傷生財：       財格：     印格：獨印 	殺印相生：   官殺：不貧則多病       傷官配印：",
        "巳": "食傷生財：孤貧勞 財格：     印格；最佳 	殺印相生：佳   官殺：體弱多病		 傷官配印：",   
        "午": "食傷生財：孤貧勞 財格：     印格：最佳   殺印相生：佳   官殺：體弱多病     		 傷官配印： ",
        "未": "食傷生財：無用   財格：     印格：佳     殺印相生：佳   官殺：身體有疾		 傷官配印： ",
        "申": "食傷生財：最佳   財格：     印格：  	    殺印相生：   官殺：           傷官配印：",
        "酉": "食傷生財：最佳   財格：     印格；    	殺印相生：   官殺： 	     傷官配印：",     
        "戌": "食傷生財：       財格：無用 印格：       殺印相生：   官殺： 		 傷官配印：",
        "亥": "食傷生財：       財格：     印格：獨喜夜生 殺印相生  ： 官殺：忌書生      傷官配印：",
        "子": "食傷生財：       財格：     印格：獨印  殺印相生：佳  官殺：佳   傷官配印：",
        "丑": "食傷生財：       財格：佳   印格；獨印  殺印相生：佳  官殺：佳   傷官配印：",  
    },  
    
    "水": {                                                        
        "寅": "食傷生財：    財格：最佳     印格：    	殺印相生：   官殺：無用   傷官配印：",
        "卯": "食傷生財：       財格：是非多     印格：無用 	殺印相生：   官殺：最佳    傷官配印：",
        "辰": "食傷生財：       財格：是非多     印格：無用 	殺印相生：   官殺：最佳       傷官配印：",
        "巳": "食傷生財：  財格：     印格；無印夭 	殺印相生：    官殺： 		 傷官配印：",   
        "午": "食傷生財：  財格：體弱多病     印格：親屬孤單   殺印相生：    官殺：最佳     		 傷官配印： ",
        "未": "食傷生財：    財格：體弱多病     印格：親屬孤單     殺印相生：    官殺：最佳		 傷官配印： ",
        "申": "食傷生財：    財格：無用     印格：佳  	    殺印相生：   官殺：佳           傷官配印：",
        "酉": "食傷生財：    財格：     印格；無用    	殺印相生：   官殺： 	     傷官配印：最佳",     
        "戌": "食傷生財：       財格： 印格： 無用      殺印相生：   官殺： 		 傷官配印：最佳",
        "亥": "食傷生財： 無用      財格：最佳     印格：  殺印相生  ： 官殺：忌書生      傷官配印：",
        "子": "食傷生財：無用       財格：最佳     印格：   殺印相生：   官殺：佳   傷官配印：",
        "丑": "食傷生財：食神制殺貴       財格：佳   印格；   殺印相生：   官殺：佳   傷官配印：",  
    },  
}

siling =  {                                                
        "寅": "立春後戊土7日，丙火7日，甲木16日 立春、雨水。",
        "卯": "驚蟄後甲木10日，乙木20日。 驚蟄、春分。",
        "辰": "清明後乙木9日，癸水3日，戊土18日。清明、穀雨。",   
        "巳": "立夏後戊土5日，庚金9日，丙火16日。立夏、小滿。",   
        "午": "芒種後丙火10日，己9日，丁火11日 芒種、夏至。 ",
        "未": "小暑後丁火9日，乙木3日，己土18日。小暑、大署。 ",
        "申": "立秋後戊己土10日，壬水3日，庚金17日。立秋、處暑。",
        "酉": "白露後庚金10日，辛金20日。 白露、秋分。",     
        "戌": "寒露后辛金10日，丁火3日，戊土18日。寒露、霜降。",
        "亥": "立冬後戊土7日，甲木5日，壬水18日。立冬、小雪。",
        "子": "大雪後壬水10日，癸水20日。 大雪、冬至。",
        "丑": "小寒後癸水9日，辛金3日，己土18日。小寒、大寒。",  
    }

xiuqius = {
    "寅": {
        "金": "囚",
        "木": "旺",
        "水": "休",
        "火": "相",
        "土": "死"
    },
    "卯": {
        "金": "囚",
        "木": "旺",
        "水": "休",
        "火": "相",
        "土": "死"
    },
    "辰": {
        "金": "相",
        "木": "囚",
        "水": "死",
        "火": "休",
        "土": "旺"
    },
    "巳": {
        "金": "死",
        "木": "休",
        "水": "囚",
        "火": "旺",
        "土": "相"
    },
    "午": {
        "金": "死",
        "木": "休",
        "水": "囚",
        "火": "旺",
        "土": "相"
    },
    "未": {
        "金": "相",
        "木": "囚",
        "水": "死",
        "火": "休",
        "土": "旺"
    },
    "申": {
        "金": "旺",
        "木": "死",
        "水": "相",
        "火": "囚",
        "土": "休"
    },
    "酉": {
        "金": "旺",
        "木": "死",
        "水": "相",
        "火": "囚",
        "土": "休"
    },
    "戌": {
        "金": "相",
        "木": "囚",
        "水": "死",
        "火": "休",
        "土": "旺"
    },
    "亥": {
        "金": "休",
        "木": "相",
        "水": "旺",
        "火": "死",
        "土": "囚"
    },
    "子": {
        "金": "休",
        "木": "相",
        "水": "旺",
        "火": "死",
        "土": "囚"
    },
    "丑": {
        "金": "相",
        "木": "囚",
        "水": "死",
        "火": "休",
        "土": "旺"
    }
}

days60 = {
    "甲子": "天德貴人日。坐子、沐浴，逢官臨桃花。\n白玉仙子捧印來，一舉成名天門開。\n貴人不向西方去，烽火空負曠世才。\n辛為正官，庚為偏官，戊己為財，見甲乙為破財，丙丁傷名利艱難，生在子月，無丑合，離祖自立，亥卯辰月主貴，巳月平常之命，午月甲死子神沖，他鄉立業。申月，子嗣難有。辰月，移根換葉。亥月，文章顯達。",
    "甲寅": "天祿貴人日。坐比肩，食神，臨官祿。\n祿到人間最為奇，千秋功業酬白帝。\n田園風光好福氣，春江月夜柳絲垂。\n雙木並排，見寅月，孤克，二三妻，見申酉月大貴，卯月，身太旺破財，巳月，犯刑，亥月，早步帝闕，子月拱丑，貴。午月，會東方火局，才華超群，辰月，廣置阡陌。",
    "甲辰": "龍守財庫日。坐偏財庫，臨衰。\n身坐財庫一世榮，慷慨風流人多情。\n財團公司善交際，官星透顯管萬民。\n子月，水多木飄，主移根換葉。申月、貴，酉月，富貴雙顯。午戌月，主富，卯月，羊刃主敗財。丑月富厚有財，亥月透官，最貴。寅月，龍虎拱月，叫龍吟虎嘯。",
    "甲午": "龍馬奔馳日。坐死、傷官、財地、進貴日。\n龍馬交弛好福氣，嬌妻美女喜北地。\n八月桂花香千里，春風麗日相依依。\n子月，沖午，鴛鴦難合。亥卯未月，貴顯。午月，自刑，見亥子，主富。丑月，身弱，見火貧。寅月，得申酉吉，火月勞碌貧夭；卯月，財不聚；申酉月，武職得權。",
    "甲申": "龍虎奪魁日。坐絕，臨殺化印。\n躍馬橫戈馳天涯，秦山楚國帥府家。\n兒女手足喜相逢，斬將奪關壯士誇。\n生於子月，印化煞，貴。亥卯未月，都貴，申月申時，死，夭命。丑月，帶疾，辰月，孤獨或僧道。巳月，清貧，敦厚聰明，且有刑。午月，藝業成名，酉月，先貴有疾，一成一敗，亥月，文章顯達。",
    "甲戌": "青龍獻藝日。坐養，臨偏財，傷官。\n一世榮華走他鄉，千般藝技樣樣強。\n官星印星來捧上，風流多情歌舞場。\n子月，書海成名。丑未月，沖刑災，多病。寅月貴，工作好，對妻不利，丑月，大富，巳月名利兩全。午月，富而貴。辰月，僧道清高。亥月，藝人，功名不遂。戌月，背祿逐馬，雞鴨同鳴。甲臨戌，財庫，富貴雙全日。",
    "乙丑": "玉女佩珠日（丁為玉女，丑為珠）。臨衰，坐梟與偏財，將星。\n身坐金庫財福秀，衣祿榮華樣樣有。\n金水相涵好文章，東方西方對面談。\n生於子月，丑合，貴，丑月，帶疾；寅月，寅中丙火克庚金官星，不祿。申酉月，無火，壽長。寅卯月敗財。辰戌月，富貴。亥子月，詩文揚。巳午月，福壽。戌月，清秀厚道，財富豐盈。",
    "乙卯": "風雲相會日。坐祿，臨比肩，爵位，天乙貴人。\n身坐爵位人稱羨，功名顯達列朝班。\n蒼海珠玉會雨露，青山白雲流水遠。\n子月，偏印，文筆命，喜食傷生財，土月富，亥月，辛官，武職勳業。寅卯月，財絕，僧道有緣。巳午月，破財，申酉月顯赫。戌月福而壽。未月財富豐盈。",
    "乙巳": "木火生輝日。交貴，驛馬，正財，成名。\n剛愎自用又聰明，財官同見公候命。\n文才武略怕青龍，興旺成敗一刻中。\n子月，文才出眾，一生勞碌。申月，官得生，近臣。丑月，武職建奇。亥卯月，通根見官殺貴。未月，有福，營商發財。巳午月，妻病或離別。申酉月，帶疾，肝膽病。亥月，文章出奇。戌月，入墓，富而壽短。",
    "乙未": "財福日。臨財，坐養。也叫福貴目。\n天元坐福人聰穎，得官逢比賽富翁。\n絲綢路上愁石榴，春色秋花雨濛濛。\n子月，平常命。未月，孤刑，申酉月，腎病，陽痿，女姓有婦科病，亥月，大貴。辰戌丑月，福商巨賈。午月，聲名天下，夏月生，平常，冬生，壽長。巳月，功名難遂，藝業生涯。",
    "乙酉": "龍鳳呈祥日。（生於酉月為貴為蒙難日）坐絕，將星。\n春花江水落鳳霞，南北揚名匡天下。\n南方一去坐金殿，玉石翡翠淚花花。\n子月，生身，逢財星，吉。寅卯月，顯貴。午月，藝名生涯。申月，貧命，勞碌。酉月，自刑，傷祿破命目疾，主災，行印運時吉。亥月，喜財星，田園豐盛，巳月敗散祖業，乙酉，多傷殘。",
    "乙亥": "名利雙成日。坐死，臨正印，劫財，文星貴人。\n玉兔月桂喜官星，親姻朋輩重友情。\n青竹流水鬱蔥蔥，太陽投江重複行。\n子月，主有富，喜官殺顯貴。亥月，自刑。午月，貴命，千荷夏日鮮。寅卯月，財星透，富壽。申月，得官。巳月，天涯風塵。戌月，藝道成名，干戈陣前之命。酉月，傷官，貴，死於非命。",
    "丙子": "灕江照彩日。臨胎，正官，喻文曲星，天官貴人。\n彩照山川鳳呈祥，年少成名坐華堂。\n日落江河人堪傷，東彩西虹任君想。\n子月，逢印，貴。土月，企業財團。寅卯月，學業有成。午月，貧，自立家業，兄弟難依。申酉月，經濟有方。亥月，有疾，夭。子月，不祿，心臟疾患。丑月，透財貴。巳月，刑災，大腸患疾。辰月，官星暗藏，超群出眾。",
    "丙寅": "紅日東昇日，坐長生，梟印，食神。\n山川秀麗柳絲青，人生最喜煙霞景。\n莫向離情虎山行，西南一去幽幽命。\n酉月，正財，透財貴顯。寅月，貴而不長久。卯，見財星福，官星顯貴。申月，財官雙顯。未月，主福。戌月，衣祿平常。亥子月，六品之貴，巳午月，腸胃或肺疾。",
    "丙辰": "火照龍潭日。臨官，食神旺，正印。\n日坐福神受皇恩，高官厚祿子孫興。\n平生享盡人間福，女命穿金又戴銀。\n戌月，沖，財門開，富命。辰月，僧道或孤。寅卯月，貴。丑未月，富厚。亥子月，貴格。申酉月，行火運，官至二三品。午月，兩三妻，福祿兩全。",
    "丙午": "天河落彩日。坐劫地，傷官，羊刃。\n人逢帝座爵士身，功名仕途顯達人。\n蒼龍水火多有厄，細雨濛濛入燕門。\n巳午月，平常命。亥子月，武官，功名挫蹬。午月，貧，倒沖子貴。寅月，三合局，文上顯赫。卯月，喜行財星，貴而富。戌月合夥，商人。辰月，實業主。申酉月，財富商賈。",
    "丙申": "火照金城日。病地，偏財，臨殺。\n身臨財官顯聲名，且防比刃殺傷臨。\n馬逢帝旺臨官處，堆金積玉立大功。\n子丑月，血疾，申月，文章有名。酉月，妻妾有情。子辰月，帶疾，亥月，喜財。午月，一生吉慶無病，長壽。寅卯月，官榮身。未月，雖富腸胃有病。丙申日，遇歲運刑沖，必生災禍。",
    "丙戌": "天廚貴人日，坐墓，福神財地。\n玉堂厚祿寒門出，金銀珠寶西方路。\n日落深潭闖鬼門，金榜題名顯雙親。\n生於子月，福壽延，有名有利，地支巳午戌月，富貴雙全。申酉月，大富，財團。辰月沖，少年名顯。亥月，武職，六品。丑月，一般經濟人。辰月，身旺得職，身弱貧*。",
    "丁丑": "玉女守庫日，坐墓，臨財。\n一輪滿月彩畫鮮，金銀滿庫祿高遷。\n麗人不行東南地，潔膚玉身受熬煎。\n丑月，財透干，富。寅卯月，印，學士命。巳午月，妻遲，二婚，破財，一生辛勞。申酉月，金銀滿貫，戌月刑災，財去財散兩空空。亥月，喜行南方火運，名利有望。子月見火，戎馬空忽。",
    "丁卯": "月照蟾宮日。臨偏印，坐病。（虛名虛利）\n日坐偏印身自強，西風不吹日惆悵。\n驛馬交馳到財鄉，山斗文章蓋一方。\n寅卯月，印綬，喜行官運，寒門將相。辰戌丑未月、孤星，妻不順，財不聚。巳午月，夫妻緣份薄，艱苦。午月多婚，貧，夭，申酉月，名利雙貴。子月，武職。亥月，文職顯耀。",
    "丁巳": "朱雀躍輝日。坐帝旺，劫財，傷官，正財。\n謝女才高滿詞館，等閒平步出少年。\n旌旗蔽日入鳳闋，火焰馬疲怨高山。\n午月，長生，文章顯奇。巳月，祿貴。寅卯月，透官星，一品大貴。辰月，商海有名。未月，貴格，申酉月富命。戌月，無福，見癸水，傷目近視。亥月，常常外出。",
    "丁未": "人立畫橋日，坐冠帶，食神，比肩，偏印。\n食神生旺勝財官，天河畫橋拜金殿。\n巽風相伴雲雨水，太陽奪輝苦貧寒。\n子月，沙場立功。丑月，外出經商，妻多離別。寅卯月，金堂玉馬。巳午月，破祖業，自立家門。申月，財官雙美，酉月，大富。辰月，雜氣官旺。亥月，將相。丁未，性強，人貴，兇險多。",
    "丁酉": "玉女乘鳳日。坐長生，臨偏財。\n朱雀乘鳳顯英豪，金車玉鳳福壽高。\n貴人龍馬東方起，太陽昇時漫徒勞。\n亥月，貴人捧印，酉戌月，犯刑，骨肉無情，因財分張。子月，殺旺，喜行土運，午月，干強，財旺，未月，衣祿平常，申月，財多身弱，富室貧人，戌月，技術生涯。",
    "丁亥": "月照天門日。坐胎，臨正印，正官。\n詞館文章早榮身，驛馬七殺風塵人。\n最喜荷花並蒂開，金水文章佐朝君。\n亥月，貴且富。子月，行木運，金戈鐵馬。戌月，沖，技藝精湛。寅卯月，貴而顯耀。巳午月，自刑，小商。申酉月，利路綿綿。子月，帶疾。辰月，專業技術成名。",
    "戊子": "山環水抱日，臨胎，坐正財。\n水繞山環明月光，煙花影中福高享。\n勿貪關城槐山夢，江海浮雲一空束。\n子月，喜行火運，福。丑月，聰明，主富貴。寅卯月，弱，病或夭亡，喜火土。巳午月，巳祿，印，午刃，喜行食傷富貴。申月，食旺，貴。酉月，傷名望。土月得才，富貴。亥月，虛秀，財帛不聚。",
    "戊寅": "虎嘯山谷日，臨長生，坐殺，偏印。\n將星入命立武功，猛虎縱風顯英雄。\n印綬財官懸天門，南征北戰旅馬行。\n卯月，寅月，鬼旺，多疾或夭。巳、午月，印，詩文會海，兵權萬里。申酉月，不祿，傷功名，土月，富。亥月，子月，商賈大富。",
    "戊辰": "蒼龍出海日。臨冠帶，正才，比肩，正官。\n月灑高山江山秀，平生最喜東南遊。\n一生辛勤貴不顯，為人熱心福氣厚。\n子月，財旺，目盲，無火，虛而不實。丑月，財少，人聰明。寅卯月，官星，身榮。辰月，財不聚，孤克。巳午月，學業二次成名。申酉月，藝名四方。戌月，沖，少年出眾。亥月，多疾，子月，無根，漂盪，技藝超群。",
    "戊午": "馬奔午門日。臨羊刃，正印。\n日月分秀福氣隆，殺官相見主武功。\n平川一去前程遠，戎馬西洲比陶公。\n子月，名利雙收，丑月，財旺。寅卯月透干，朝野重臣。午未月印，錦繡文字，透官顯貴。申酉月，企業財團董事。戌月財少，平常，孤克。子月，外鄉立實。祖業無*，六親冷落，亥月，大富，刃旺，性強，人雖貴，兇險多。",
    "戊申": "霞落花簇日。臨病，食神，偏財。\n日坐福星聲名顯，萬卷詩書朝天關。\n騎驢走馬爐中火，風雲雷雨步金殿。\n寅月，沖祿，財旺。子月，財旺，印旺，貴，丑月福，愛酒色，固執。卯月，合食，名利雙顯。辰戌未月，土氣專旺，不聚財，腎病。巳午月，事業沉浮不定多變動。申酉月，專業致富。亥子月，大富。",
    "戊戌": "溪繞畫亭日，坐墓，臨正印，比劫。\n熱情憨厚心似海，白帝玉女捧印來。\n溪繞畫亭芳香名，田園平川雲天外。\n子月，顯貴聚財。丑未戌月，刑災，有破。寅卯月合印，詩文成章。申酉月，堆金積玉。亥月，沖，心神不定，異地創業。",
    "己丑": "金牛拜金殿。臨墓，坐比肩，食神，偏財。\n一柱佛香拜金殿，艮山流水芳名顯。\n金匙開得丑戈庫，富貴榮華醉管絃。\n亥月，傷官盡，貴，有權威。寅月，貴顯。卯月，兵權顯赫。申月，庚為背祿。甲絕未月，沖，發跡，腎病。午月，沖，妻有厄。巳月合金，商賈鉅富。辰月，孤身。子月，倉庫充盈。",
    "己卯": "武跨將壇日，臨衰，坐七殺將星。\n將士佩弓跨戰馬，暮雨風月渡年華。\n文星福祿若有情，北國回首似到家。\n酉月：卯酉沖，一生多遷移，妻離。申月，早發跡。亥月，貴。未月，合，五穀豐登。午月：詩滿乾坤。巳月，文秀。辰月，能建功立業。子月，無禮，兇暴。",
    "己巳": "馬躍平川日，臨帝旺，坐偏印，比劫。\n南朝天子綬玉印，千里長江醉遊人。\n雪山草地馬難行，春風得意座上賓。\n巳為印，旺，巳月，金神，忌財，喜食傷。午月，顯貴。土月，候伯命。申酉月，喜印運，傷盡為武職。亥月，一品貴，有兵權。子月，食傷運大富，辰月，先貧後發。己巳日，人貴。",
    "己未": "丹桂漂香日，臨冠帶，坐比肩，梟印。\n月中桂子秋飄香，江河日月交相映，\n莫道高山芳氣散，二月春風論短長。\n亥月，文章誇躍，清高，酉月，大貴。辰月，小職，近衛。申月，財福充盈，未月，財金散失，午月，合，清貧儒雅。巳月，喜官顯貴。辰月，寒門將士。",
    "己酉": "鳳飛綠洲日。臨長生，坐支食神。\n一輪滿月出蒼海，金鳳展翅飛天外，\n秦山崑崙雪皚皚，龍鳳呈祥玉珠來。\n亥月，身弱，貧，寅卯月，有火，武職，酉月，高貴之命，酉多遊方術士。申月，無官顯貴。未月，大富。巳月，富貴陶朱。子月，食破，貧寒。",
    "己亥": "平川流水日。臨胎，坐支正財，正官。\n祿馬同鄉拜玉堂，天塹通途文星揚。\n沉影不隨流水去，殺星沖動馬無疆。\n亥月，財顯，官旺，貴。酉月，食神，財旺，申月，干透印，大貴。未月合武職。已月，沖，外跡發憤。子月，多病，血疾。寅卯月，支中鬼旺，一生難成大事。印透大貴。",
    "庚子": "金玉出海日，臨死，坐支，傷官。\n能歌善舞筆和墨，猶如白虎戲江水。\n沖在祿馬登科甲，斑竹細雨傷情淚。\n子月，衰，傷官，無土運，鬼旺，風燭夭*。丑月，虛名，輕財。寅月，偏財，不祿。卯月，合財，金玉滿目。辰月，利路經商。巳月，武職顯躍。午月，文官近衛。四季月，印旺富而有名，亥月，漂蓬，僧侶。",
    "庚寅": "白虎鎮山日，臨絕，坐支偏財，七殺，偏印。\n平川猛虎歸山林，秋風落葉時不寧。\n最喜大雪封山時，三夏濃蔭臥孔明。\n子月，食旺，身衰，比劫扶吉。寅月，清秀，命高。卯月，富不長久。辰月，富而貴。巳月，鬼暗藏，有印，職榮。申酉月，錢財聚散浮沉，戌亥月，董事財團。",
    "庚辰": "福德貴人日，臨養，坐支偏印，食神。\n命帶魁罡性剛強，不信鬼神在身旁。\n玉佩嬌陽入命來，執戈跨馬佐高皇。\n丑月，富而有名。子丑，文才出眾。寅卯月，財福壽促，午月，發跡有疾患。巳月，一生艱辛，未申月，財運發跡。酉月合，透官星，榮顯。亥子月，食神旺發跡難壽。庚辰，貴而風流，名重利輕。",
    "庚午": "火鑄金印日，臨沐浴，支坐正官印。\n鐵筆一隻水為墨，淡彩濃雲筆下繪。\n學苑將士兩般命，山野朱雀銜玉翠。\n丑月有名聲，辰月，自刑，富而有刑。寅月，火旺，帶殘疾，肺有疾患。卯月，財旺，大富之人。子月沖，天涯藝海。申酉月，日貴，垂手青雲。",
    "庚申": "雙虎奔馳日。臨官祿，坐支比肩，食神，偏印，又叫虎戀玉女日。\n白虎交馳向南行，雀躍江河早成名。\n祿到長生官得地，九重露雨沐朱衣。\n庚月，透火，大貴之命。亥子月，詩詞清暢流韻。申酉月，無官星。貧而*。寅卯月，財滿三峽。已午月，官至侍郎，七殺，金戈鐵馬。",
    "庚戌": "祿馬貴人日，臨衰，坐支正官，偏印。\n將軍百戰不論功，高山流水又出征。\n西去陽關知音少，前祿後福兩三重。\n辰月，沖，平常之命。卯月，合，因妻發福。寅月，候王之命。丑月，財旺官升。巳月，火官，武職操權，有驚險。午月文職。難善終。申酉月，財來財散，散聚兩依依。亥子月，文筆超群。",
    "辛丑": "白玉生輝日，臨養，支坐偏印，食神，比肩。\n白玉生輝金門客，高山得貴子為墨。\n身入平川多愁嘆，干弋影裡勳業垂。\n子月，食神，榮華。丑月，伏吟，鴛鴦難合。寅卯月，財聚官旺。巳月，早遂名香，辰月顯達，有名利。午月，兇。申酉月，逢官星，貴，少年坎坷。土月，平常。亥月傷官，一文鳴天下。",
    "辛卯": "鳳闕早步日，臨絕，支坐財，傷官，驛馬，沖祿。\n高山起程水流長，邊塞迢迢雪滿霜。\n佛山玉女豈有情，雪山日照花海棠。\n辰月，傷官傷盡，自立自成，技藝，卜相，醫生。寅卯月，合，財豐。巳月，沖，文星出眾。午月，自刑，先榮後刑。未月，富。申月，貧，人生不定。酉月，多爭論。子月，食旺，福旺。亥月，傷官。技業成名。辛卯，偏財，為福貴雙全日。",
    "辛巳": "金馬登殿日，臨死，坐支正官，正印，劫財，驛馬。\n金馬臨官號嘶風，玉堂拜相翰苑名。\n最喜高山水環繞，嬌陽日出漫消魂。\n子月，食旺，名顯。丑月，合，妻少緣，財淡。寅月，因財有刑。卯月，橫財。巳月，金長生，化水名顯。午月，暗鬼有疾。申酉月，貴中有失。亥月，沖，雙貴。",
    "辛未": "冰河解凍日，臨衰，支坐梟印，偏官，多情忘義。\n身入西國佛香地，漫歌輕舞管絃醉。\n玉女傳送風流人，高山日出彩畫新。\n申月，在貴人門下得富。酉月，又貴又富。辰月，庫印，沖，清雅儒士。巳月，文月，武操重權，子月，富門貴顯。丑月，經濟商，雲遊。亥月，雙貴。",
    "辛酉": "鳳臥金山日，臨祿，支坐比肩，天乙貴人。\n祿馬貴人世少有，鳳臥金山將帥候。\n日出朝陽橫天行，月圓金門尋石榴。\n申月，劫財，一生財不聚。酉月，比肩，財逢劫。子月，福壽名高，巳月，損妻。寅卯月，財氣通門戶。巳月，合，名揚四海。午月干弋劍影，未戌月，清貧，亥月，富而有刑。",
    "辛亥": "虎行天門日。臨沐浴，支坐傷官，正財，驛馬。\n一去天門遙遙遠，長亭驛路關山寒。\n倒騎毛驢東行去，高山麗日花團團。\n申月，發福。帶疾。酉月。破祿，多磨。寅月，富商。卯月財團。巳月，沖，天涯遊客。午月，武功建奇。土月，有官職。亥月，誤入商海。",
    "壬子": "馬奔天河日，臨帝旺。支坐劫財。\n壬水浩浩漫天下，行入東方福到家。\n江南平川魚米鄉，雲雨湖海鏡中花。\n子月，平常人。丑月，官星，人清秀。寅月，大富貴。卯月，刑，妻離。辰月，官庫，無沖不發。巳月，午月，利路經商。申酉月，文章璀燦。戌月，權重。亥月，貧。",
    "壬寅": "福祿日，臨病，支坐食神，偏財偏官。\n虎躍天河威名揚，猶如箕豹出山崗。\n祿到長生官得地，九重雨露沐朱衣。\n卯月，破財，有成有敗。土月，吉。午月，正官，榮華顯貴。申月，沖身弧，奔波人。酉月，風流才子。戌月，財旺。亥月，財有根富命。子月，因財有破。壬見寅為食神，號富貴雙全日。",
    "壬辰": "山流水長日，臨墓，，支坐偏官，劫財，庫地，虛名虛利。\n江水流芳美如畫，杜鵑啼血巫山峽。\n月下騎馬走平川，一日嚐盡牡丹花。\n子月，成中有敗，多兇。丑月辰戌未月，俱貴。寅月，食旺，人騎龍背，名流，財旺。卯月，清雅人。巳、午月，廣置莊園。申月，奔勞，走鄉串野。酉月，合，文上有名，才子。亥月，主掌權。",
    "壬午": "花紅柳綠日，臨胎，支坐財，正官，驛馬。\n祿馬相邀入帝鄉，花紅柳綠掩高堂。\n出闋最喜函玉關，千里迢迢雁北上。\n子月，月日沖，外鄉立家，難團園。丑月，祿旺，貴。寅月，貴而多疾。卯月，富貴雙顯，巳月，財旺，喜印地，午月自刑，夭疾，比劫扶，吉。未月，大富。申、酉月，狀元及第。土旺四季，主權。亥月，身旺，財旺。",
    "壬申": "白虎渡江日。臨長生。支坐偏印，偏官，劫財，驛馬。\n命似白虎渡長江，最怕風雨江水漲。\n麗日跨入平川地，金枝玉葉陪身旁。\n子月，劫財，合水，一生奔波，貧。酉月，偏旺，帶疾，弧身。亥月，刑，破財，見官星，大富。丑月，官星，行財運，清秀，祿貴。寅、卯月，食旺，富貴雙全。巳、午月，身坐學堂，名利馳驅。申、酉月財帛進退。土月，貴。",
    "壬戌": "龍出蒼海日，臨冠帶，支坐正財，偏官，正印，火庫。\n身坐火庫水得福，西行東邀人間苦。\n壯士難酬青雲志，醉看少女漫歌舞。\n子月，有疾。丑月，人貴顯。申月，梟印，劫財，親姻難全。酉月，印綬，文印齊來。寅月，合，滋生榮茂；卯月，傷名，異路乘鳳。巳月，英豪透發，午月，貴顯雙親。辰月，青龍飛躍。亥月，蘭蕙不祿。",
    "癸丑": "桑柳成蔭日，臨冠帶，支坐偏官，印，比肩。\n池塘桑柳滿園色，二月春風柳絮飛。\n莫怨高山運來遲，干戈影裡是翡翠。\n午月，沖，財旺，福。未月，主貴。子月，合，功名顯達。丑月異常出仕。寅卯月，傷食旺，藝海生涯。巳午月利路經商。四季土月，平平，殘疾。申酉月，科場功名，亥子月，決戰千里。",
    "癸卯": "天姿文秀日，臨長生，支坐食神。\n學堂詞館貴人命，天姿文秀人多情。\n最喜三星相拱照，詩琴歌樂官絃聲。\n子月，刑，無禮德，對妻不利，但平步青雲。丑月，貴，奇顯。寅月，艱難人生。卯月，人生富庶。辰月，財帛富月，父母難*。巳月富而有殘，午月，一生財豐。申月，書香早遂，酉月刀筆成名，沖，鴛鴦離合。土月主貴，亥月，名利雙全。",
    "癸巳": "彩霞佩玉日。臨胎，支坐正財正官，驛馬，文星。\n貴人玉堂來拜相，墨池泉湧好文章。\n武士跨馬走天下，王公皇候似平常。\n巳月，財官雙美，詩書琴畫。午月，中年大富。申酉月，終生勞累，透官。丑月，秀氣。辰月，山明水秀，紅粉生涯。",
    "癸未": "貴人佩玉日。臨墓，支坐偏官，偏財。\n日臨官庫將相命，男子英勇女貴榮。\n西方一去福祿地，花園翠亭馬不行。\n子月，青雲得路，貴。丑月，暗鬼沖傷。婚有變。寅月，秀貴，一生順利。卯月，武職平常。辰月，富而秀貴，巳月，富而且有肺疾。未月，男女無子女，陽痿。申酉月，文字生發。亥月，財發。",
    "癸酉": "天福日，臨病，支坐偏印。\n瀟灑功名起一方，一沖一合異尋常。\n江湖花灑安享福。南去高山勢莫檔。\n亥月，生涯遂心，風流。戌月，平常，善智謀。酉月，得祖業，破財。申月，印旺，文上出仕。寅月，藝技生涯。卯月，沖，印破，大富。巳月，富商。午月，生意人。申酉月，金水相涵，文秀。子月，印破，不祿，平常命。",
    "癸亥": "天門懸彩日，臨帝旺。支坐傷官。劫財，驛馬。\n九華山上天門開，日行東方花似海。\n若去西方崑崙地，邊塞將士戀故國。\n未月，合木，貴。在外終。子月，妻離異，財分張；亥月，劫財，一生無正業，散業。四季土月，有作為，決戰沙場。寅卯月，財團經營，或藝名天涯。巳午月，大富。癸亥，命薄，多貧。"
}

chens = {
    "子": "子時初\n值此運如何，作事進退多，初年財未至，末限足財寶。\n子時初先克母，為人性急，首妻難招，長子有克，六親冷淡，兄弟不和，作事進退，初年不濟，末限好，宜手藝吉。\n\n子時中\n衣祿自然興，一生近貴人，為官作宰相，富貴大家聲。\n子時中父母在，為人一生快樂清閒，衣祿不虧，兄弟有分，子息可招，六親大旺，不能登祖業，出外主有大財。\n\n子時末\n生逢子時末，初年運未通，六親無倚靠，兄弟兩西東。\n子時末先克父，為人性寬，六親兄弟無力，子息兩硬，初年辛苦，作事有頭無尾，主離祖過房，重拜爹孃。",
    "丑": "丑時初\n生逢初丑時，衣祿積有餘，為人官職分，田產福安居。\n丑時初父母雙全，二十前無刑剋，二十後進田莊，文武皆通，為人近貴，有頭目分，六親得力，兄弟有權，好子息。\n\n丑時中\n生來發達遲，為人最辛苦，財祿隨時進，逢喜又逢吉。\n丑時中先克父，衣祿平平，為人心行公道，早年辛苦，末運好，三十八九後發財，兄弟難為，六親冷淡，離祖可白手興家。\n\n丑時末\n先克母，為人辛苦，一生大事成，六親兄弟無力，子息得力，衣祿中平，初年辛苦，四十後發財，末限勝前。\n為人丑時末，一生好風光，財來無克破，學術手藝成。",
    "寅": "寅時初\n生來遇大耗，二女皆刑吊，床頭十文錢，床尾鬼來叫。\n寅時初先克父，為人近貴，凶事成吉，早年勞苦，三十年奔波，三十七歲後好，六親冷淡，兄弟清疏，子息大用，有子送老。\n\n寅時中\n宅舍好風光，生來大吉祥，一生常快樂，把筆作文章。\n寅時中父母具全，為人作事有權柄，衣祿不虧，六親有分，兄弟施為，子息二三，為人有志誠不苟。\n\n寅時末\n寅時末事多，身安心又勞，一生多疾厄，小船水上漂。\n寅時末先克母，六親無力，頭子難招，兄弟不和，初年辛苦，三十六歲過發財，末限勝前，衣祿平平，作事進退。",
    "卯": "卯時初\n卯時初刻生，為人最苦辛，衣食隨時度，悲喜送相生。\n卯時初先克母，為人作事有始無終，兄弟少力，六親難為，宜離祖過房，初年奔波，刑剋子息，不真不假送老。\n\n卯時中\n住居大高堂，兄弟有主張，一生享富貴，文武近君王。\n卯時中父母雙全，三十年父母在，男人居官，女人有福，一生近貴，女人益夫，六親兄弟有力，子息不虧，衣祿有餘。\n\n卯時末\n時末走途程，辛苦又勞神，晚年時運至，財祿積門庭。\n卯時末先克父，作事本分，初年不遂勞碌奔波，離祖過房，兄弟無靠，自整門風，六親冷淡，骨肉情疏，末限勝前。",
    "辰": "辰時初\n衣祿自然來，兄弟六親林，父母難刑剋，晚景更無憂。\n辰時初父母在，為人性急，六親有力，長子難招，兄弟不和，心慈善，宜手藝營生，初限平平，四十二歲後漸好。\n\n辰時中\n衣祿得人抬，先憂後吉來，六親雖冷淡，末限足錢財。\n辰時中先克父，為人心行公道，性急直燥，出入有貴人扶持，離祖成家，六親兄弟情疏，初年不濟，末限勝前。\n\n辰時末\n衣祿自然有，朱紫作朝郎，一朝命發達，富貴有名聲。\n辰時末先克母，為人聰明，衣祿豐盈，大有聲名，六親大旺，兄分有顧盼，為官頭目之稱，女命益夫，旺子福祿雙全。",
    "巳": "巳時初\n宅舍好風光，宜早學文章，女命有權柄，男命作朝郎。\n巳時初先克母，為人衣祿有，六親小力，兄弟難靠，長子難招，夫妻有克，初年奔波，末限大利，女命益夫。\n\n巳時中\n時中無克破，一生積錢財，因公得財物，出外好安排。\n巳時中父母俱全，一生近貴，財祿足用，兄弟有分，子息和順，作朝郎，師術，頭目之分，大事成小，慷慨之命。\n\n巳時末\n要行千里路，心急馬行遲，圍棋如天火，放下不能知。\n巳時末先克父，為人近貴，做事一成一敗，子息難為，六親冷淡，早年災晦，辛苦奔波，末限勝前。",
    "午": "午時初\n午時自有威，出入有人隨，一生常受用，上馬貴人超。\n午時初父母雙全，為人利害近貴，六親和，兄弟有靠，子息三五枝，衣祿無虧，為官作吏之命。\n\n午時中\n生來不自由，衣祿財少求，奔波憂惱至，浪子度春秋。\n午時中先克父，衣祿平平，辛苦奔波，三十歲後漸漸好，女命益夫，男命先難後易，六親少力，一成一敗之命。\n\n午時末\n妻兒父母憂，財帛不能求，前程雖有分，必是苦中求。\n午時末先克母，為人性急，六親無靠，兄弟少力，頭子難招，聰明伶俐，早年晦氣，奔波，末限榮華。",
    "未": "未時初\n出世好良時，威權自有餘，命中身帶貴，必到鳳凰池。\n未時初父母雙全，為人近貴，一生安樂，六親得意，兄弟無虧，男子頭目之命，女人益夫，知輕識重。\n\n未時中\n衣祿自然隨，風光小事為，文章須有貴，眼下要維持。\n未時中先克父，一生性寬近貴，六親少力，兄弟有情，衣祿平平，初年奔波，克首妻，子息難為，末限勝前。\n\n未時末\n財祿隨時求，人情好便休，悲憂連一喜，慷慨汝為頭。\n未時末先克母，為人一生近貴，衣祿平平，一成一敗，初年辛苦，六親少力，兄弟不和，子息俱硬，末限勝前。",
    "申": "申時初\n生來命運高，家中多富豪，早登科甲第，麻衣換錦袍。\n申時初父母雙全，為人聰明近貴，文武皆通，六親有祿，兄弟子息有得力，田產廣置，女命益夫旺子。\n\n申時中\n卻是有名人，親疏弟沒情，自來時運至，依舊敗家聲。\n申時中先克父，六親不和，兄弟少力，一憂一喜，初年勞碌奔波晦氣，早婚刑剋，晚景好，離祖吉。\n\n申時末\n衣祿自然興，機謀件件能，為人多計較，作事有謀成。\n申時末先克母，兄弟六親冷淡，早年辛苦，主招破相，三十歲平平，四十後方好，勝前。",
    "酉": "酉時初\n家舍是光輝，朝中著紫衣，度民連夜喜，文武貴人提。\n酉時初父母雙全，一生利官近貴，文武皆知，六親有靠，兄弟難為，子息可為，頭目官之命。\n\n酉時中\n衣祿不為虧，聲名報曉雞，朝夕慚惶淚，且做別人兒。\n酉時中先克父，為人性寬，兄弟不利，長子難招，早年不遂，末限好，男刑妻，女剋夫，離祖過房。\n\n酉時末\n衣祿好安排，人情事可諧，為人心性好，作事有時來。\n酉時末先克母，衣祿平常，兄弟少力，初年晦氣辛苦，三十七歲發財，夫妻刑剋，男子遲能，女子淫亂，克子。",
    "戌": "戌時初\n慈心行公道，浮財入手來，且有自作力，常得貴人抬。\n戌時初先克母，為人性急心慈，手足不得力，作事有權柄，六親平常，初年奔波辛苦，三十七八歲發財，衣食好。\n\n戌時中\n平等心無漏，生來本有防，膽有天來大，開口作顛狂。\n戌時中先克父，六親兄弟少力，夫妻刑剋，長子難招，早年奔波勞苦，四十二後漸好，衣祿平平，晚景有旺。\n\n戌時末\n衣祿自安然，平生福自寬，凡事如心意，福享泰錦人。\n戌時末父母雙全，為人性急，文武皆通，六親兄弟有靠，只宜手藝，學術精巧，夫妻偕老，離祖則吉。",
    "亥": "亥時初\n命帶自然有，初運未通，一朝時運至，白手整家風。\n亥時初先克母，為人性寬，六親少力，手足情疏，子息二三，一生近貴，衣祿平常，初年欠遂，末限勝前。\n\n亥時中\n有事會謀施，生來福自餘，心好存公道，衣祿更無虧。\n亥時中父母俱全，為人聰明性急，親戚平和，兄弟子息有分，女秉男權，末限勝前，興家之命。\n\n亥時末\n衣祿自難量，男女帶克傷，夫婦無良德，二姓子相當\n亥時末先克父，為人性燥心慈，六親少力，兄弟難為，早年勞苦，男克二妻，女刑三夫，末限好。"
}