#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Author: bazimaster
# CreateDate: 2019-2-21
import datetime
from collections import OrderedDict
from bidict import bidict

Gan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]

Zhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]

datouxiu = ("壬子", "癸丑", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉")

xiaotouxiu = ("壬午", "癸未", "庚子", "辛丑", "戊子", "己丑")

temps = {"甲":3, "乙":1, "丙":6, "丁":4, "戊":5, "己":-4, "庚":-1, "辛":-3, "壬":-5, "癸":-6,"子":-6, "丑":-4, "寅":3, "卯":1, "辰":-4, 
            "巳":5, "午":6, "未":3, "申":-2, "酉":-3,"戌":4, "亥":-5}


zhi_time = {"子":'23-1', "丑":'1-3', "寅":'3-5', "卯":'5-7', "辰":'7-9', 
            "巳":'9-11', "午":'11-13', "未":'13-15', "申":'15-17', "酉":'17-19',
            "戌":'19-21', "亥":'21-23'}

zhengs = "子午卯酉"

wuhangs = {
    '金':"庚辛申酉",
    '木':"甲乙寅卯",    
    '水':"壬癸子亥",
    '火':"丙丁巳午",     
    '土':"戊己丑辰未戌",         
}

ganzhi60 = bidict({
    1:"甲子", 13:"丙子", 25:"戊子", 37:"庚子", 49:"壬子", 2:"乙丑", 14:"丁丑", 26:"己丑", 38:"辛丑", 50:"癸丑", 
    3:"丙寅", 15:"戊寅", 27:"庚寅", 39:"壬寅", 51:"甲寅", 4:"丁卯", 16:"己卯", 28:"辛卯", 40:"癸卯", 52:"乙卯", 
    5:"戊辰", 17:"庚辰", 29:"壬辰", 41:"甲辰", 53:"丙辰", 6:"己巳", 18:"辛巳", 30:"癸巳", 42:"乙巳", 54:"丁巳", 
    7:"庚午", 19:"壬午", 31:"甲午", 43:"丙午", 55:"戊午", 8:"辛未", 20:"癸未", 32:"乙未", 44:"丁未", 56:"己未", 
    9:"壬申", 21:"甲申", 33:"丙申", 45:"戊申", 57:"庚申", 10:"癸酉", 22:"乙酉", 34:"丁酉", 46:"己酉", 58:"辛酉", 
    11:"甲戌", 23:"丙戌", 35:"戊戌", 47:"庚戌", 59:"壬戌", 12:"乙亥", 24:"丁亥", 36:"己亥", 48:"辛亥", 60:"癸亥"})


zhi5 = {
    "子":OrderedDict({"癸":8}), 
    "丑":OrderedDict({"己":5, "癸":2, "辛":1,}), 
    "寅":OrderedDict({"甲":5, "丙":2, "戊":1, }),
    "卯":OrderedDict({"乙":8}),
    "辰":OrderedDict({"戊":5, "乙":2, "癸":1, }),
    "巳":OrderedDict({"丙":5, "戊":2, "庚":1,}),
    "午":OrderedDict({"丁":5, "己":3, }),
    "未":OrderedDict({"己":5, "丁":2, "乙":1,}),
    "申":OrderedDict({"庚":5, "壬":2, "戊":1, }),
    "酉":OrderedDict({"辛":8}),
    "戌":OrderedDict({"戊":5, "辛":2, "丁":1 }),
    "亥":OrderedDict({"壬":5, "甲":3, })}

zhi5_list = {
    "子":["癸"], 
    "丑":["己", "癸", "辛"], 
    "寅":["甲", "丙", "戊"],
    "卯":["乙"],
    "辰":["戊", "乙", "癸"],
    "巳":[ "丙", "戊", "庚"],
    "午":["丁", "己"],
    "未":["己", "丁", "乙"],
    "申":["庚", "壬", "戊"],
    "酉":["辛"],
    "戌":["戊", "辛", "丁" ],
    "亥":["壬", "甲",]}

ShX = ["鼠", "牛", "虎", "兔", "龍", "蛇", "馬", "羊", "猴", "雞", "狗", "豬"]
numCn = ["零", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十"]
Week = ["日", "一", "二", "三", "四", "五", "六"]
jqmc = ["冬至", "小寒", "大寒", "立春", "雨水", "驚蟄", "春分", "清明", "穀雨", "立夏", "小滿", "芒種", "夏至", "小暑", "大暑", "立秋", "處暑","白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪"]
jis = {0:'冬', 1:'春', 2:'夏', 3:'秋', 4:'冬'}
ymc = ["十一", "十二", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十" ]
rmc = ["初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十", "卅一"]


ten_deities = {
    '甲':bidict({'甲':'比', "乙":'劫', "丙":'食', "丁":'傷', "戊":'才',
                  "己":'財', "庚":'殺', "辛":'官', "壬":'梟', "癸":'印', "子":'沐', 
                  "丑":'冠', "寅":'建', "卯":'帝', "辰":'衰', "巳":'病', "午":'死', 
                  "未":'墓', "申":'絕', "酉":'胎', "戌":'養', "亥":'長', '庫':'未_', 
                  '本':'木', '克':'土', '被克':'金', '生我':'水', '生':'火','合':'己','沖':'庚'}),
    '乙':bidict({'甲':'劫', "乙":'比', "丙":'傷', "丁":'食', "戊":'財',
                  "己":'才', "庚":'官', "辛":'殺', "壬":'印',"癸":'梟', "子":'病', 
                  "丑":'衰', "寅":'帝', "卯":'建', "辰":'冠', "巳":'沐', "午":'長',
                  "未":'養', "申":'胎', "酉":'絕', "戌":'墓', "亥":'死', '庫':'未_',
                  '本':'木', '克':'土', '被克':'金', '生我':'水', '生':'火','合':'庚','沖':'辛'}),
    '丙':bidict({'丙':'比', "丁":'劫', "戊":'食', "己":'傷', "庚":'才',
                  "辛":'財', "壬":'殺', "癸":'官', "甲":'梟', "乙":'印',"子":'胎', 
                  "丑":'養', "寅":'長', "卯":'沐', "辰":'冠', "巳":'建', "午":'帝',
                  "未":'衰', "申":'病', "酉":'死', "戌":'墓', "亥":'絕', '庫':'戌_',
                  '本':'火', '克':'金', '被克':'水', '生我':'木', '生':'土','合':'辛','沖':'壬'}),
    '丁':bidict({'丙':'劫', "丁":'比', "戊":'傷', "己":'食', "庚":'財',
                  "辛":'才', "壬":'官', "癸":'殺', "甲":'印',"乙":'梟', "子":'絕', 
                  "丑":'墓', "寅":'死', "卯":'病', "辰":'衰', "巳":'帝', "午":'建',
                  "未":'冠', "申":'沐', "酉":'長', "戌":'養', "亥":'胎', '庫':'戌_',
                  '本':'火', '克':'金', '被克':'水', '生我':'木', '生':'土','合':'壬','沖':'癸'}),
    '戊':bidict({'戊':'比', "己":'劫', "庚":'食', "辛":'傷', "壬":'才',
                  "癸":'財', "甲":'殺', "乙":'官', "丙":'梟', "丁":'印',"子":'胎', 
                  "丑":'養', "寅":'長', "卯":'沐', "辰":'冠', "巳":'建', "午":'帝',
                  "未":'衰', "申":'病', "酉":'死', "戌":'墓', "亥":'絕', '庫':'辰_',
                  '本':'土', '克':'水', '被克':'木', '生我':'火', '生':'金','合':'癸','沖':''}),
    '己':bidict({'戊':'劫', "己":'比', "庚":'傷', "辛":'食', "壬":'財',
                  "癸":'才', "甲":'官', "乙":'殺', "丙":'印',"丁":'梟',"子":'絕', 
                  "丑":'墓', "寅":'死', "卯":'病', "辰":'衰', "巳":'帝', "午":'建',
                  "未":'冠', "申":'沐', "酉":'長', "戌":'養', "亥":'胎', '庫':'辰_',
                  '本':'土', '克':'水', '被克':'木', '生我':'火', '生':'金','合':'甲','沖':''}),
    '庚':bidict({'庚':'比', "辛":'劫', "壬":'食', "癸":'傷', "甲":'才',
                  "乙":'財', "丙":'殺', "丁":'官', "戊":'梟', "己":'印',"子":'死', 
                  "丑":'墓', "寅":'絕', "卯":'胎', "辰":'養', "巳":'長', "午":'沐',
                  "未":'冠', "申":'建', "酉":'帝', "戌":'衰', "亥":'病', '庫':'丑_',
                  '本':'金', '克':'木', '被克':'火', '生我':'土', '生':'水','合':'乙','沖':'甲'}), 
    '辛':bidict({'庚':'劫', "辛":'比', "壬":'傷', "癸":'食', "甲":'財',
                  "乙":'才', "丙":'官', "丁":'殺', "戊":'印', "己":'梟', "子":'長', 
                  "丑":'養', "寅":'胎', "卯":'絕', "辰":'墓', "巳":'死', "午":'病',
                  "未":'衰', "申":'帝', "酉":'建', "戌":'冠', "亥":'沐', '庫':'丑_',
                  '本':'金', '克':'木', '被克':'火', '生我':'土', '生':'水','合':'丙','沖':'乙'}),
    '壬':bidict({'壬':'比', "癸":'劫', "甲":'食', "乙":'傷', "丙":'才',
                  "丁":'財', "戊":'殺', "己":'官', "庚":'梟', "辛":'印',"子":'帝', 
                  "丑":'衰', "寅":'病', "卯":'死', "辰":'墓', "巳":'絕', "午":'胎',
                  "未":'養', "申":'長', "酉":'沐', "戌":'冠', "亥":'建', '庫':'辰_',
                  '本':'水', '克':'火', '被克':'土', '生我':'金', '生':'木','合':'丁','沖':'丙'}),
    '癸':bidict({'壬':'劫', "癸":'比', "甲":'傷', "乙":'食', "丙":'財',
                  "丁":'才', "戊":'官', "己":'殺', "庚":'印',"辛":'梟', "子":'建', 
                  "丑":'冠', "寅":'沐', "卯":'長', "辰":'養', "巳":'胎', "午":'絕',
                  "未":'墓', "申":'死', "酉":'病', "戌":'衰', "亥":'帝', '庫':'辰_',
                  '本':'水', '克':'火', '被克':'土', '生我':'金', '生':'木','合':'戊','沖':'丁'}), 

}

ju = {
    '本':'刃', '被克':'殺',  '克':'才', '生':'傷', '生我':'梟',
}

shengxiaos = bidict({
    "子":"鼠", "丑":"牛", "寅":"虎", "卯":"兔", "辰":"龍", "巳":"蛇", 
    "午":"馬", "未":"羊", "申":"猴", "酉":"雞", "戌":"狗", "亥":"豬"})


zhi_atts = {
    "子":{"沖":"午", "刑":"卯", "被刑":"卯", "合":("申","辰"), "會":("亥","丑"), '害':'未', '破':'酉', "六":"丑","暗":"",},
    "丑":{"沖":"未", "刑":"戌", "被刑":"未", "合":("巳","酉"), "會":("子","亥"), '害':'午', '破':'辰', "六":"子","暗":"寅",},
    "寅":{"沖":"申", "刑":"巳", "被刑":"申", "合":("午","戌"), "會":("卯","辰"), '害':'巳', '破':'亥', "六":"亥","暗":"丑",},
    "卯":{"沖":"酉", "刑":"子", "被刑":"子", "合":("未","亥"), "會":("寅","辰"), '害':'辰', '破':'午', "六":"戌","暗":"申",},
    "辰":{"沖":"戌", "刑":"辰", "被刑":"辰", "合":("子","申"), "會":("寅","卯"), '害':'卯', '破':'丑', "六":"酉","暗":"",},
    "巳":{"沖":"亥", "刑":"申", "被刑":"寅", "合":("酉","丑"), "會":("午","未"), '害':'寅', '破':'申', "六":"申","暗":"",},
    "午":{"沖":"子", "刑":"午", "被刑":"午", "合":("寅","戌"), "會":("巳","未"), '害':'丑', '破':'卯', "六":"未","暗":"亥",},
    "未":{"沖":"丑", "刑":"丑", "被刑":"戌", "合":("卯","亥"), "會":("巳","午"), '害':'子', '破':'戌', "六":"午","暗":"",},
    "申":{"沖":"寅", "刑":"寅", "被刑":"巳", "合":("子","辰"), "會":("酉","戌"), '害':'亥', '破':'巳', "六":"巳","暗":"卯",},
    "酉":{"沖":"卯", "刑":"酉", "被刑":"酉", "合":("巳","丑"), "會":("申","戌"), '害':'戌', '破':'子', "六":"辰","暗":"",},
    "戌":{"沖":"辰", "刑":"未", "被刑":"丑", "合":("午","寅"), "會":("申","酉"), '害':'酉', '破':'未', "六":"卯","暗":"",},
    "亥":{"沖":"巳", "刑":"亥", "被刑":"亥", "合":("卯","未"), "會":("子","丑"), '害':'申', '破':'寅', "六":"寅","暗":"午",},
}




kus = {'辰':"水土", '戌':'火土', '丑':'金', '未':'木',}

gan_hes = {
    ("甲", "己"): "中正之合 化土 尊崇重大,寬厚平直。如帶煞而五行無氣則多嗔好怒,性梗不可屈",
    ("乙", "庚"): '''仁義之合　化金 果敢有守, 不惑柔佞,周旋唯仁,進退唯義。''',
    ("丙", "辛"): '''威制之合　化水 ''',
    ("丁", "壬"): '''淫慝之合　化木 ''',    
    ("戊", "癸"): '''無情之合　化火''',    
}

gan_chongs = {("甲", "庚"): "相沖",   ("乙", "辛"): "相沖",
              ("丙", "壬"): "相沖", ("丁", "癸"): "相沖",}    

chongs = { 
    "甲":"庚", "庚":"甲","乙":"辛", "辛":"乙","丙":"壬", "壬":"丙", "丁":"癸",
    "癸":"丁", "子":"午", "午":"子", "丑":"未", "未":"丑", "寅":"申",  "申":"寅", 
    "卯":"酉",  "酉":"卯", "辰":"戌", "戌":"辰", "巳":"亥", "亥":"巳"
}


zhi_6hes = {
    "子丑": "土",
    "寅亥": "木",
    "卯戌": "火",
    "酉辰": "金",    
    "申巳": "水",    
    "未午": "土",        
}

zhi_3hes = {"申子辰": "水 寅","巳酉丑": "金 亥",  "寅午戌": "火 申", "亥卯未": "木 巳"}
gong_he = {"申辰": '子', "巳丑": '酉', "寅戌": '午', "亥未": '卯',
           "辰申": '子', "丑巳": '酉', "戌寅": '午', "未亥": '卯',}

zhi_half_3hes = {
    ("申", "子"): "化水  馬在寅",
    ("子", "辰"): "化水  馬在寅",
    ("申", "辰"): "化水  馬在寅",    
    ("巳", "酉"): "化金 馬在亥",  
    ("酉", "丑"): "化金 馬在亥",  
    ("巳", "丑"): "化金 馬在亥",      
    ("寅", "午"): "化火 馬在申",    
    ("午", "戌"): "化火 馬在申",   
    ("寅", "戌"): "化火 馬在申",   
    ("亥", "卯"): "化木 馬在巳",
    ("亥","未"): "化木 馬在巳",
    ( "卯", "未"): "化木 馬在巳",
}

zhi_hes = {
    "申子辰": "水",
    "巳酉丑": "金",  
    "寅午戌": "火", 
    "亥卯未": "木"
}

zhi_huis = {
    "亥子丑": "水",
    "寅卯辰": "木",  
    "巳午未": "火",       
    "申酉戌": "金",
}
gong_hui = {"亥丑": '子', "寅辰": '卯', "巳未": '午', "申戌": '酉',
           "丑亥": '子', "辰寅": '卯', "未巳": '午', "戌申": '酉',}

zhi_chongs = {
    ("子", "午"): "相沖",
    ("丑", "未"): "相沖",
    ("寅", "申"): "相沖",
    ("卯", "酉"): "相沖",
    ("辰", "戌"): "相沖",   
    ("巳", "亥"): "相沖",       
}

zhi_poes = {
    ("子", "酉"): "相破",
    ("午", "卯"): "相破",
    #("巳", "申"): "相破", 
    #("寅", "亥"): "相破",
    ("辰", "丑"): "相破",   
    ("戌", "未"): "相破",       
}

zhi_haies = {
    ("子", "未"): '''
    未害子 謂未旺土，亥子旺水，名勢家相害。故子見未則為害。
    不利六親骨肉。入貴格多妻妾之累,入賤格孤獨無倚。''',
    ("丑", "午"): '''
    午害丑 謂午以旺火凌丑死金，名官鬼相害。故丑見午，而午更帶丑干之真鬼則為害尤甚。 
    生旺,主好勝多怒,嚴毅不忍;死絕主毒害、傷慘、傾覆之事。入貴格 則主大權,司刑典獄;
    入賤格則謀生於不義之地。''',
    ("寅", "巳"): '''
    互相相害 生旺則主神潔貌俊,好爭奪,喜激作;值死絕則多謀少成,強學人做事,兀兀趨進不厭。
    入貴格則有操守, 善機權;入賤格則多詐、愛貧、鄙吝。''',
    ("卯", "辰"): '''
    卯害辰 謂卯以旺木凌辰死土，此以少凌長相害。故辰見卯，而卯更帶辰干真鬼則其害尤甚。 
    生旺,主好勝多怒,嚴毅不忍;死絕主毒害、傷慘、傾覆之事。入貴格 則主大權,司刑典獄;
    入賤格則謀生於不義之地。''',
    ("申", "亥"): '''
    互相相害 謂名恃臨官，競嫉才能，爭進相害。故申見亥，亥見申均為害，更納音相剋者重。 
    生旺則主神潔貌俊,好爭奪,喜激作;值死絕則多謀少成,強學人做事,兀兀趨進不厭。
    入貴格則有操守, 善機權;入賤格則多詐、愛貧、鄙吝。''',   
    ("酉", "戌"): '''
    戌害酉 戌以死火害酉旺金，此嫉妒相害，故酉人見戌則兇，戌人見酉無災；
    若乙酉人得戊戌，乙為真金，戊為真火，為害尤甚。 生旺,不容物,多剛戾;死絕酷狠,憎善妒能。
    入貴格 羅怯無辜,結構入訟,頗多奸佞,入賤格殘害、陰狡、性佞、 不良。''',       
}

zhi_xings = {
    ("寅", "巳"): "寅刑巳 無恩之刑 ",
    ("巳", "申"): "巳刑申 無恩之刑",
    ("申", "寅"): "申刑寅 無恩之刑",
    ("未", "丑"): "未刑丑 持勢之刑",
    ("丑", "戌"): "丑刑戌 持勢之刑",   
    ("戌", "未"): "戌刑未 持勢之刑",  
    ("子", "卯"): "子刑卯　卯刑子 無禮之刑 女命見之，尤為不良 生旺主人威肅，面無和氣，氣強性暴，太察不容；死絕則侮慢忽略，狹劣刻剝，少孝悌，害妻子，吳越六親。入貴格則多掌兵權，不利近侍；位居不久；入賤格則悖兇暴，多招刑禍。",       
}

xings = {"巳":"寅", "申":"巳",  "寅":"申", "丑":"未", "戌":"丑", "未":"戌",
         "子":"卯", "卯":"子", '辰':'辰', '午':'午','酉':'酉', '亥':'亥'}

zhi_zixings = ['辰', '午', '酉', '亥']



gan5 = {"甲":"木", "乙":"木", "丙":"火", "丁":"火", "戊":"土", "己":"土", 
        "庚":"金", "辛":"金", "壬":"水", "癸":"水"}

zhi_wuhangs = {"子":"水", "丑":"土", "寅":"木", "卯":"木", "辰":"土", "巳":"火", 
        "午":"火", "未":"土", "申":"金", "酉":"金", "戌":"土", "亥":"水"}

relations = {
    ("金", "金"): '=', ("金", "木"): '→', ("金", "水"): '↓', ("金", "火"): '←', ("金", "土"): '↑',
    ("木", "木"): '=', ("木", "土"): '→', ("木", "火"): '↓', ("木", "金"): '←', ("木", "水"): '↑',
    ("水", "水"): '=', ("水", "火"): '→', ("水", "木"): '↓', ("水", "土"): '←', ("水", "金"): '↑',    
    ("火", "火"): '=', ("火", "金"): '→', ("火", "土"): '↓', ("火", "水"): '←', ("火", "木"): '↑',
    ("土", "土"): '=', ("土", "水"): '→', ("土", "金"): '↓', ("土", "木"): '←', ("土", "火"): '↑',

}

guans = {
    "甲":('辛',"酉","戌","丑"), "乙":('庚',"申",'巳'), "丙":("癸",'丑','辰'), 
    "丁":('壬',"亥", '申'),"戊":('乙',"卯","戌","未"), "己":('甲',"寅", "亥"), 
    "庚":('丁',"午", "戌","未"), "辛":('丙',"寅",'巳'),
    "壬":('己',"午",'未','丑'), "癸":('戊',"寅","辰",'巳','申','戌'),}


gan_desc = {
    "甲":'''雷龍 樑棟 祿寅;斧斤斫削成其器。木不南奔;喜春運不喜西方,春生,處世安然,必壽。''', 
    "乙":'''風 樹 祿卯 水泛木浮  秋令大吉''', 
    "丙":"電 冶 祿巳 火無西向", 
    "丁":"星 燈 祿午 火明則滅 喜遇秋. 丁巳日,多克父兄妻子,財忌比劫,兄屈弟下,巳有戊土,傷",
    "戊":"霧霞 山 祿巳 土虛則崩 四柱帶水則為上格,霞水相輝而成文彩也;年月干見癸雨後霞現", 
    "己":"元氣雲 真土 祿午 火燥土裂  天降時雨,山川出雲 貴坐酉,貴春生,貴見印,坐亥者不可見乙木,雲昇天,遇風則狼籍", 
    "庚":"月 鐵 祿申 畏癸水 巳成鐘鼎 水土沉埋則無聲 金實無聲 金沉水底 四柱有乙巳,月白風清, 秋上,冬次,春夏無取。",
    "辛":"霜 金 祿酉 土重金埋 辛人坐卯,未透乙, 大富,坐亥透丙則貴。愛冬生。", 
    "壬":"秋露雲 澤 祿亥 死水橫流", 
    "癸":"雨 泉脈 春霖 祿子 水不西流 癸卯日透己, 有雲行雨有經濟才也。春夏吉,秋冬不吉"}

zhi_desc = {
    "子":"墨池 正北 時喜見癸亥，謂之水歸大海，又謂之雙魚遊墨，必為文章士矣。",
    "丑":"柳岸 丑人時見己未，乃月照柳梢，極為上格",
    "寅":"廣谷 寅生人而時戊辰者，謂之虎嘯而谷風生 威震萬里",
    "卯":"瓊林 乙木 正東 仲春 卯年遇巳未時者，是為兔入月宮之象，主大貴。",
    "辰":"草澤 東方之次 辰逢壬戍、癸亥即龍歸大海格",
    "巳":"大驛 巳生喜得辰時，蛇化輕龍，于格為千里龍駒",
    "午": "烽堠 南 屬火、土，其色赤黃 時利見辰，真龍出則凡馬空矣，謂之馬化龍駒。",
    "未": "花園 卯乃木旺,自 成林麓;未乃木庫,如人築牆垣以護百花也,以百花言未中有 雜氣耳;未年人雙飛格,最妙,如辛未見戊戍,兩干不雜是也。 ",
    "申":"名都 帝王所居；申宮壬水生 亥時，乃地天交泰",
    "酉":"寺鐘 正西 見寅吉，謂之鐘鳴谷應。",
    "戌": "燒原 戌與辰地皆貴人所不臨也 戌生逢卯 春入燒痕",
    "亥":"懸河 即天門 日時見寅、辰二字，是乃水拱雷門",    
}

gan3 = {
    "甲":'天上貴，孤獨守空房', 
    "乙":'多陰私，又要敗祖業', 
    "丙":'人孤老，產中亡', 
    "丁":"多惡疾，手足也自傷",
    "戊":"子隨出，離祖別家鄉", 
    "己":"別父母，兄弟各一方", 
    "庚":"財郎，萬里置田莊",
    "辛":"壽數長，財滯多災郎", 
    "壬":"家業盛，有富不久長", 
    "癸":"一亥全，烈火燒屋房"}

gan4 = {
    "甲":'少夫妻', 
    "乙":'命早亡', 
    "丙":'子息空', 
    "丁":"壽不長",
    "戊":"人孤刑", 
    "己":"人忠良", 
    "庚":"他鄉走",
    "辛":"壽限長", 
    "壬":"定富足", 
    "癸":"人夭亡"}


zhi3 = {
    "子":"婚事重",
    "丑":"四夫妻",
    "寅":"守孤寡",
    "卯":"兇惡多",
    "辰":"好鬥傷",
    "巳":"遭刑害",
    "午": "剋夫妻",
    "未": "守空房 ",
    "申":"人不足",
    "酉":"獨居房",
    "戌": "訟事多",
    "亥":"孤苦憐", }


def getGZ(gzStr):
    import sxtwl
    tg = -1
    dz = -1
    for i, v in enumerate(Gan):
        if gzStr[0]  == v:
            tg = i
            break

    for i, v in enumerate(Zhi):
        if  gzStr[1] == v:
            dz = i
            break   
    return sxtwl.GZ(tg, dz)

def get_jizhu(gan, zhi):
    
    gan_index = Gan.index(gan)
    zhi_index = Zhi.index(zhi) 
    result = {}
    alls = []
    for i in range(6):
        ganzhi = "{}{}".format(Gan[(gan_index-6-i*9 )%10], Zhi[(zhi_index-6-i*9)%12])
        result[ganzhi] = get_year_of_ganzhi(ganzhi)
        alls += result[ganzhi]
    alls.sort()
    result['all'] = alls
    return result

def get_year_of_ganzhi(ganzhi):
    
    seq = ganzhi60.inverse[ganzhi]
    year = 1983 + seq
    current_year = get_current_year()
    result = [year - 60]
    if year <=  current_year:
        result.append(year)
    return result  

def get_current_year():
    
    current_date = datetime.date.today()
    return current_date.year

gan_health = {
    "金":'''
    秋天較走運
    申月、酉月、猴年和雞年運氣較好
    下午三點至下午七點是吉時
    
    西方是吉方
    住朝西的房子較吉利
    睡房在房子的西方較好
    睡房的西方有窗字較順利
    金屬床有利健康
    辦公桌朝西有助工作效率
    吉祥顏色是白色
    室內裝璜用白色係統
    穿衣用白色系列
    開白色車子較平安易發財
    勿傷心，注意呼吸係統、肺、腸, 筋
    武術、擊搏、兵器運動、健身房運動也很好
    和金有關的工作較容易''',
                                     
    "木":'''
    春天或清風徐來的天氣較走運
    卯月、寅月、兔年和虎年運氣較好
    上午三點至上午七點是吉時
    東方是吉方
    住朝東的房子較吉利
    睡房在房子的東方較好
    睡房的東方有窗字較順利
    木床有利健康
    辦公桌朝東有助工作效率
    吉祥顏色是綠色
    室內裝璜用綠色係統
    穿衣用綠色系列
    開綠色車子較平安易發財
    多喝點酸性飲料，忌生氣，注意神精係統、肝、膽、頭肩、肝膽
    多打高爾夫球、公園散步、徒步樹林等戶外運動
    和木有關的工作較容易。''',
                                        
    "水":'''
    身體需要注意: 脛足、膀胱腎(比如結石) 多喝水
    冬天或冷天氣較走運
    亥月、子月、豬年和鼠年運氣較好
    晚上九點至上午一點是吉時
    北方較冷是吉方
    住朝北的房子較吉利
    睡房在房子的北方較好
    睡房的北方有窗字較順利
    金屬床或水床有利健康
    辦公桌朝北有助工作效率
    吉祥顏色是黑色
    室內裝璜用黑色係統
    穿衣用黑色系列，帶珠寶也不錯
    開黑色車子較平安易發財
    多喝水，注意腎臟係統
    多做游泳、潛水、滑雪、釣魚、溜冰等戶外運動
    和水有關的工作較容易。''',    
                                        
    "火":'''
    夏天或熱天氣較走運
    午月、巳月、馬年和蛇年運氣較好
    上午九點至下午一點是吉時
    南方較熱是吉方
    住朝南的房子較吉利
    睡房在房子的南方較好
    睡房的南方有窗字較順利
    木床有利健康
    辦公桌朝南有助工作效率
    吉祥顏色是紅色
    室內裝璜用紅色係統
    穿衣用紅色系列
    開紅色車子較平安易發財
    要常笑，注意心臟係統、血液循環、眼睛、額齒
    多做打籃球、網球、排球、騎單車等戶外運動
    和火有關的工作較容易''',
    
    "土":'''
    春、夏、秋、冬四季交接之時段較走運
    丑、辰、未、戌月和牛、龍、羊、狗年運氣較好
    上午二點、八點左右和下午二點、八點左右都是吉時
    起居環境和氣候不要太乾或太溼
    睡房在房子的中間較好
    辦公桌靠房子的中間，有助工作效率
    吉祥顏色是棕黃色
    室內裝璜用棕黃色係統
    穿衣用棕黃色系列，帶古玉很不錯
    開棕黃色車子較平安易發財
    勿常擔心事情，太多慮 
    少吃些甜點，注意消化係統、脾、肌肉
    多做園藝、露營、走路等戶外運動。下棋、宗教場所都好
    和土有關的工作較容易''',      
}

# 歲煞為三合對沖方的三會中的庫，劫煞為三合對沖方的三會中的生
mu_years = { '災煞': '酉', '坐煞': '庚辛','向煞': '甲乙','歲煞': '戌', '劫煞': '申',
    
}