#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Author: bazimaster
# CreateDate: 2023-10-28

jia_1 = '''
    春月之木，漸有生長之象。初春猶有餘寒，當以火溫暖，則有舒暢之美，水多變克，有損精神。重見生旺，必用庚金斲鑿，可成楝梁。
    春末陽壯水渴，藉水資扶，則花繁葉茂。初春無火，增之以水，則陰濃氣弱，根損枝枯，不能華秀
    。春末失水，增之以火，則陽氣太盛，燥渴相加，枝枯葉乾，亦不華秀。是以水火二物，要得時相濟為美。
'''

jia_3 = '''
    三秋甲木，木性枯槁，金土乘旺，先丁後庚，丁庚兩全，將甲造為畫戟，七月甲堪為戟，非丁火不能造庚，非庚不能造甲，丁庚兩透，科甲定然。庚祿居申，殺印相生，運行金水，身伴明君。或庚透無丁，一富而已，主為人操心太重，不能坐享。或丁透庚藏，亦主青衿小富。或庚多無丁，殘疾之人若為僧道，災厄可免。

    或四柱庚旺，支內水多，不作棄命從殺。見土多可作從才而看。

    庚多無癸，而壬水多，戊己亦多，此則專用一點丁火，方可制金以養群土，此命大富。丁藏富小，不顯。丁露定作富豪。得二丁，不坐死絕，必然富貴雙全，即風水不及，亦可富中取貴，納粟奏名。

    或癸疊疊制伏丁火，雖滿腹文章，終難顯達。得運行火土，破癸，略可假就功名，歲運皆背，刀筆之徒。

    支成水局，戊己透干，制去癸水，存其丁火又可雲科甲，但此等命，主為人心奸巧詐，好訟爭非，因貪致禍。奸險之徒，決非安份之人也。
'''


jia12 = '''
    正二月：
    一派庚辛，主一生勞苦，克子刑妻，再支會金局，非貧即夭。如無丙丁，一派壬癸，又無戊己制之，名水泛木浮，死無棺槨。
    如一派戊己，支會金局，為財多身弱，富屋貧人，終生勞苦，妻晚子遲。
    或無庚金，有丁透，亦屬文星，為木火通明之象，又名傷官生財格，主聰明雅秀。
    一見癸水傷丁，但作厚道迂儒。或柱中多癸，滋助木神，傷滅丁火，其人奸雄梟險，言清行濁，笑裡藏刀。
    或一庚一戊出干，號曰財煞相生，運行金水，可許科甲，雖無陰驚風水，亦不失儒林藝士。
    或支成金局，多透庚辛，此又不吉，號曰木被金傷，若無丙丁破金，必主殘疾。
    或支成火局，洩露太過，常有啾唧災病纏身，終有暗疾。 -- 無水必主疾病，支有癸水，也為美。
    支成木局，得庚為貴，無庚必兇，若非僧道，男主鰥孤，女主寡獨。二庚透干，大富大貴。
    支成水局，戊透為貴，如無戊制，不但貧賤，且死無棺木。
'''

jia56 = '''
    五六月甲木，木性虛焦。五月先癸後丁庚金次之。六月三伏生寒，丁火退氣。先丁後庚，無癸亦可。或五月乏癸，用丁亦可，要運行北地為佳。
    六月甲木，木盛先丁。五月癸庚兩透為上格，六月丁庚兩透亦為上格。用神既透，木火通明，自然富貴。或丁多庚少，又是平人;或一庚一丁，定許成名
    總之五六月用丁火，雖運行北地，不致於死。卻不利運行火地，號曰木化成灰必死。行西程又不吉，號曰傷官遇殺，不測災來，
    惟東方則吉，北方次之。此五六月用丁之說也。
    或滿柱丙火，又加丁火，不見官殺，謂之傷官傷盡最為奇，反成清貴，定主才學過人，科甲有望，但歲運不宜見水。若柱中有壬水，運又逢水，必貧夭死。
    凡用神太多，不宜克制，須洩之為妙。
    用神多者，非二三用神之謂，用神重見，即謂之多，如滿柱丙火，又加丁火是也。如原命水木有根，不能變為炎上，則宜用土以洩火之氣，為釜底抽薪之法，不宜以水克制，歲運亦然。
    所謂旺火得土，乃熄其焰，固不僅木火傷官為然也。從兒格最宜財運，名兒又生兒，即是此意。
    若柱中多金，名曰殺重身輕，先富後貧，運不相扶，非貧即夭。或庚多，有一二丙丁制伏，又有壬癸透干，洩金之氣，此又為先貧後富。
    或四柱多土，干上有乙木，切勿作棄命從才。
    時月兩透己土，名二土爭合，男主風流，女主淫賤。見二甲則不爭矣，亦屬平庸之輩。

    五六月甲木，木盛先庚，庚盛先丁。五月癸庚兩透，為上上之格。六月庚丁兩透，亦為上上之格。
    用神既透，木火通明，自然大富大貴。或丁火太多，癸水亦多，反作平人。或四柱有辰，干見二己二甲，此人名利雙全，大富大貴。
    若在六月，見辰支，名為逢時化合格。以癸水為妻，丁火為子。若二己一甲爭合。取支中比劫為用。以甲為用者，壬癸為妻，甲乙為子。
    其餘用庚者，土妻金子。用丁者，木妻火子。女命以妻作夫，用作子。十干皆同。
    或是己土，不見戊土，乃為假從，其人一生縮首，反畏妻子。若無印綬，一生貧苦。六月尤可，五月決不可。
    
    但凡木火傷官者，聰明智巧，卻是人同心異，多見多疑，雖不生事害人，每抱忌妒之想，女命一理同推。
'''

yi56 = '''
    凡五六月乙木，氣退枯焦，用癸水切忌戊己雜亂，則為下格。或甲木高透，制伏土神名為去濁留清，可許俊秀。土多乏甲秀氣脫空，庸人而已。

    或丙癸兩透，加以甲透制戊，選拔定然。若不見丙癸，只有丁火，亦屬常人，有壬、可充衣食。

    或柱中無水，又無比劫出干，乃為棄命從才，富大貴小，能招賢德之妻。從才格以火為妻，土為子。

    或一派戊土出干，不見比肩，名為才多身弱，終為富屋貧人。

    或丙辛化水，嫖賭破家，終非承受之兒。

    或一派乙木，不見丙癸，名為亂臣無主勞碌奔波，又加支多辛金，僧道之輩。

    或一派甲木，無癸無丙，又無庚金，此人一生虛浮，總不誠實。有庚制甲，乃有謀之人，但嗜酒貪花，多欲敗德，不修品行，男女一理。

    總之夏月之乙木，端用癸水，丙火酌用，庚辛次之。
'''

ding10_12 = '''
    三冬丁火微寒，專用庚甲，甲乃庚之良友，凡用甲木，庚不可少，無庚無甲，何能引丁，難雲木火通明，冬丁有甲，不怕水多金多，可稱上格，庚透，科甲分明，既非科甲也儒雅風流，見己則否，己多合甲，則為常人。
    或一丙奪丁，必賴支內水救，若有支金發水之源，官拜烏臺有準，金無癸水制丙，無用之徒，或有金無水，貧寒之士，有壬無金，又主清貴。

    或時月二壬爭合，取戊破之，有戊稍有富貴，無戊常人，設戊藏得所，不失衣衿。

    或二丙奪丁，得年干有癸，支帶合，金水得所，亦必顯達，納粟奏名，必驗。    
    或仲冬水多癸旺，金無比印，此作棄命從殺，亦有異途功名，見丁比出干，難合格局，常人，且主骨肉浮雲，六親流水，戊出破癸，頗有兄弟妻兒，此格用戊，火妻土子，用甲，水妻木子。

    或四柱多丙丁，又用癸制火，用癸者金妻水子。

    三冬丁火，甲木為尊，庚金佐之，戊癸權宜酌用可也。
'''

ji4_6 = '''

    三夏己土，雜氣才官，禾稼在田，最喜甘沛，取癸為要，次用丙火，夏無太陽，禾稼不長，故無癸曰旱田，無丙曰孤陰。

    或丙癸兩透，又加辛金生癸，此富貴之格，名水火既濟，鼎甲之人，郤忌戊癸化合。

    或有丙無癸，有壬亦可，但不大發。

    或一丙火烈土，加以丁火制辛，癸水無根，如七八月之間旱，則苗槁矣，此命孤苦零丁，或有甲木，又見丙火重重，無濟水解炎，亦孤貧到老。

    如有壬水，又見庚辛，此又不作孤看，但恐目疾，心腎肝臟之災，若壬水有根，辛金得地，又非此而論，或壬癸並出，破火潤土，此人聰穎特達，富中取貴，又轉禍為福也。

    用癸者，金妻，水子，用丙者，木妻，火子。
'''

ji7_9 = '''
	三秋己土，萬物收藏之際，外虛內實，寒氣漸升，須丙火溫之，癸水潤之，不特此也，且癸能洩金，丙能制金，補土精神，則秋生之物咸茂矣，癸先丙後。
	丙癸兩透，雁塔題名，或無癸，有兩丙透者，異途顯達，或武職權高，或有丙火，不見壬癸，為假道斯文，終無誠實，或有壬癸無丙者，衣食充足，才能而已。

	或支成金局，癸透有根，此人家畜萬緡，富中取貴。

	或支四庫，甲透者富，乏甲者孤貧，或甲出無癸乏金，積德可全科甲，或會火局，無水救，乃大奸大惡之徒。

	或丙透癸藏，遇金頗有選援，加一壬輔，富貴慷慨，有賢聲，見戊透者，主遭兇厄且貧。

	八月支成金局，無丙丁出救，此人零丁孤苦，如得丙透丁藏，生己元神，此人名魁天下，五福完人。

	總之三秋己土，先癸後丙，取辛輔癸，九月土盛，宜甲木疏之，餘皆酌用。
    ''',   
	

ji10_12 = '''
    三冬己土，溼泥寒凍，非丙暖不生，取丙為尊，甲木參酌，戊土癸水不用，惟初冬壬旺，取戊制之，餘皆用丙丁，但丁不能解凍除寒，不能大濟。
    
    或干透一丙，支藏一丙，如以甲透，科甲有準，即藏丙無制，亦主衣衿。
    
    或多壬水，得戊透制之，此命安然富中取貴，不見戊土，富屋貧人，凡三冬己土，見壬水出干，為水浸湖田，此人孤苦，若見火不孤，見土不貧。
    
    或一派癸，不見比劫，此為從才，反主富貴，雖不科甲，恩誥有之，若見比爭，平常人物，妻子主事，從才者，木妻，火子。
    
    或一派戊己，取甲制之，甲透者富貴。
    
    或一片辛庚，須用丙火，還須丁火為助，丙藏，富貴奇特之命。''',   

months = {

    '甲寅': f'''
    正月甲木，初春尚有餘寒，得丙癸逢，富貴雙全。癸藏丙透，名寒木向陽，主大富貴。倘風水不及，亦不失儒林俊秀。如無丙癸，平常人也。
    -- 丙為重，癸有丑水都可。不能從；
    {jia12}
    {jia_1}
    ''',

    '甲卯': f'''
    二月甲木，庚金得所，名陽刃駕殺，可雲小貴，異途顯達，或主武職，但要財資之。柱中逢才，英雄獨壓萬人。
    若見癸水，困了才殺，主為光棍，重刃必定遭兇。性情兇暴。
    {jia12}
    {jia_1}
    ''',

    '甲辰': f'''
    三月甲木，木氣相竭。先取庚金，次用壬水。庚壬兩透，一榜堪圖。但要運用相生，風水陰德，方許富貴。
    或見一二庚金，獨取壬水。壬透清秀之人，才學必富。
    或天干透出二丙，庚藏支下，此鈍斧無鋼，富貴難求。若有壬癸破火，堪作秀才。
    或柱中全無一水，戊己透干，支成土局，又作棄命從才，因人而致富貴，妻子有能。
    或見戊己，及比劫多者，名為雜氣奪才，此人勞碌到老，無馭內之權。女命合此，女掌男權，賢能內助，若比劫重見，淫惡不堪。
    或支成金局，方可用丁，不然，三月無用丁之法。惟有先庚後壬取用。
    書曰：甲乙生寅卯，庚辛干上逢，離南推富貴，坎地卻為兇。
    {jia_1}
    ''',
    
    '甲巳': '''
    四月甲木退氣，丙火司權，先癸後丁, 又須有庚透。庚金太多，甲反受病。若得壬水，方配得中和，此人性好清高，假裝富貴。
    即廕襲顯達，終日好作禍亂，善辨巧談，喜作詩文。此理最驗。如一庚二丙，稍有富貴。金多火多，又為下格。
    或癸丁與庚齊透天干，此命可言科甲，即風水淺薄，亦有選拔之才。癸水不出，雖有庚金丁火，不過富中取貴異途官職而已。
    壬透可雲一富，若全無點水，又無庚金丁火，一派丙戊，此無用之人也。
    ''',

    '甲午':jia56,
    '甲未':jia56,    
    '甲申':f'''
    三月甲木，木氣相竭。先取庚金，次用壬水。庚壬兩透，一榜堪圖。但要運用相生，風水陰德，方許富貴。
    或見一二庚金，獨取壬水。壬透清秀之人，才學必富。
    或天干透出二丙，庚藏支下，此鈍斧無鋼，富貴難求。若有壬癸破火，堪作秀才。
    或柱中全無一水，戊己透干，支成土局，又作棄命從才，因人而致富貴，妻子有能。
    或見戊己，及比劫多者，名為雜氣奪才，此人勞碌到老，無馭內之權。女命合此，女掌男權，賢能內助，若比劫重見，淫惡不堪。
    或支成金局，方可用丁，不然，三月無用丁之法。惟有先庚後壬取用。
    書曰：甲乙生寅卯，庚辛干上逢，離南推富貴，坎地卻為兇。
    {jia_3}    
    ''',
    '甲酉':f'''
    八月甲木，木囚金旺。丁火為先，次用丙火，庚金再次。一丁一庚，科甲定顯。癸水一透，科甲不全。
    丙庚兩透，富大貴小。丙丁全無，僧道之命。丙透無癸，富貴雙全。有癸制丙，尋常之人。
    支成火局，可許假貴，戊己一透，可作富翁。
    或支成金局，干露庚金，為木被金傷，必主殘疾，得丙丁破金，亦主老來暗疾。
    或支成木局，干透比劫，反取庚金為先，次用丁火。
    {jia_3}    
    ''',   

    '甲申':f'''
    九月甲木，木星凋零，獨愛丁火，壬癸滋扶，丁壬癸透，戊己亦透，此命配得中和，可許一榜。庚金得所，科甲定然。

    或見一二比肩，無庚金制之，平常人也。倘運不得用，貧無立錐。一命，甲辰、甲戌、甲辰、甲戌、身伴明君，富貴壽考，此為天元一氣，又名一才一用。遇比用才，專取季土。或見庚丙，可許入泮，白手成家。用火者，木妻火子，子肖妻賢。

    或四柱木多，用丙用丁，皆不足異，端用庚金為妙。凡四季甲木，總不外乎庚金。譬如木為犁，能疏季土，非庚金為犁嘴，安能疏土雖用丙丁，癸庚決不可少也。九月卻不取土妻庚子，當取水妻木子。

    凡甲木，多見戊己，定作棄命從才而看。從才格，取火妻土子。

    或見一派丙丁傷金，不過假道斯文，有壬癸破了丙丁，技藝之流。無壬癸破火，支又成火局，乃為枯朽之木，有庚亦何能為力，定作孤貧下賤之輩，男女一理。

    或有假傷官，得地逢生，此正合甲乙秋生貴元武之說，用水制傷官者，以金為妻，水為子。

    或丁戊俱多，總不見水，又為傷官生財格，亦可雲富貴，此格取火為妻，土為子。

    凡甲多庚透，大貴。庚藏，小貴。若柱中多庚，則又以丁為奇，富貴人也。如庚申年、丙戌月、甲申日、壬申時，此主功名顯達，有文學。若無庚丙年月，又無火星出干，雖曰好學，終困名場。

    九月甲木，端用丁癸，見戊透必貴。如戊戌、壬戌、甲子、甲申，支成水局，干有壬水，正合貴元武之說。配得中和，一榜之命，家計豐足。但庚丁未透出干，不能館選。

    甲乙比肩，又逢比劫運，主兄弟劫財爭訟，刑妻損子。甲乙生正二月，無制無洩，主長發師姑。
    {jia_3}    
    ''',
    
    '甲亥':f'''
    十月甲木，庚丁為要，丙火次之。忌壬水泛身，須戊土制之。

    若庚丁兩透，又加戊出干，名曰去濁留清，富貴之極，即乏丁火，亦稍有富貴。或甲多制戊，庚金無根，平常人也。庚戊若透，雖出比劫，必定富而壽。

    或多比劫，只一庚出干，坐祿逢生乃為舍丁從庚，略富貴。或支見申亥，戊己得所，以救庚丁，可許科甲。若單己透，其力弱小，不過貢監而已。

    用庚，土妻金子。用丁，木妻火子。
    ''',          
    
    '甲子':f'''
    十一月甲木，木性生寒，丁先庚後，丙火佐之。癸水司權，為火金之病。庚丁兩透，支見巳寅，科甲有準，風水不及，選拔有之。若癸透傷丁。無戊己輔救，殘疾之人。或壬水重出，丁火全無者，庸人也，得丙方妙。

    或支成水局，加以壬透，名為水泛木浮，死無棺木。

    總之十一月甲木，為寒枝，不比春木清茂，端取庚丁。透壬無丙，不過刀筆異途，武職有驗。

    用庚，土妻金子。用火，木妻火子。 
    ''',      
    
    '甲丑':f'''
    十二月甲木，天寒氣凍，木性極寒，無生發之象，先用庚劈甲，方引丁火始得木火有通明之象，故丁次之。
    庚丁兩透，科甲恩封。庚透丁藏，小貴。丁透庚藏，小富貴。無庚者，貧賤。無丁者，寒儒。或有丁透重重，亦是富貴中人，但須比肩，能發丁之焰，自有德業才能。如無比肩，尋常之士，稍有衣食而已。或支多見水，即有比肩，亦屬平常。
    總之臘月甲木，雖有庚金，丁不可少。乏庚略可，乏丁無用。經雲：甲木無根，男女夭壽  
    ''',  
    
    '乙寅':'''	正月乙木，必須用丙，因天氣尤有餘寒，非丙不暖，雖有癸水，恐凝寒氣，故以丙火為先，癸水次之。
	丙癸兩透，科甲定然，或有丙無癸門戶闡揚。或丙多乏癸，名曰春旱。獨陽不長，濁富之人。或丙少癸多，又為困丙，終為寒士。或癸己多見，為溼土之木皆下格。

	用丙者，木妻火子。用癸水見火多者，金妻水子。
    ''',   
	
    '乙卯':'''
	二月乙木，陽氣漸升，木不寒矣，以丙為君，癸為臣，丙癸兩透，不透庚金，大富大貴。

	或天干透庚，支下無辰，不能化金，得癸透養木亦為貴，若見水庫，則為假化，平常人也。

	二月乙木，端用丙癸，或支成木局，有癸透乃作貴命，更得丙洩木氣，上上之命，但須透癸。或水多困丙，多戊化癸，皆下格。

	用丙者，木妻、火子。用癸者，金妻、水子。

	亥卯未逢於甲乙，富貴無疑。木全寅卯辰方，功名有準。活木忌埋根之鐵，支下有庚辛，戕賊其根，木則朽矣。
    ''',   
    
    '乙辰':'''
	三月乙木，陽氣愈熾，先癸後丙。
	癸丙兩透，不見己庚，玉堂之客。見己庚者，平常之人。或一乙逢庚，不見己者，亦主小富貴，但不顯達。或多水見己，只恐高才不第。見戊堪發異途。或庚己混雜，丙癸全，則為下格。

	或見水局，丙戊高透，亦主科甲。或柱中全無丙戊，支合水局，此離鄉之命。

	或見一派癸水，又有辛金，則作旺看。得一戊己制癸，亦可雲小富貴。若一派壬水，不特貧賤，而且夭折。有一戊己，方雲有壽，但終為技術之人。

	又或庚辰時月，名二庚爭合，乃貧賤之輩。如年干見丁破庚，可雲從化，亦不失武職之權。

	用癸者，金妻水子。癸多用丙者，木妻火子。

    ''',    
    
    '乙巳':f'''    
	四月乙木，自有丙火，端取癸水為尊。四月乙木專用癸水，丙火酌用，雖以庚辛佐癸，須辛透為清。癸透、庚辛又透，科甲定然，獨一點癸水、無金，是水無根，雖出天干，不過秀才小富，須要大運相扶。或土多困癸，貧賤之人。丙戊太多，支成火局，瞽目之流。

	用癸者，金妻水子。

	乙逢雙女木傷殘，若見辛金壽必難，不得丙丁來制伏，豈知安樂不久長。
    ''',   
    
    '乙午':f'''    
	五月乙木，丁火司權，禾稼俱旱。上半月屬陽，仍用癸水。下半月屬陰，三伏生寒，丙癸齊用。柱多金水，丙火為先，餘皆用癸水為先。
	乙木重逢火位，名為氣散之文，支成火局，洩乙精神，須用癸滋。癸透有根，富貴雙全。或庚辛年上，癸透時干，定許科甲，無癸者常人。

	若見丙透，支成火局，陽焦木性，此人殘疾，無癸必夭，見壬可解。或火土太多，其人愚賤，或為僧道門下閒人。
	
	{yi56}''',    
    
    '乙未':f'''  
    六月乙木，木性且寒，柱多金水，丙火為尊。支成水局，乙得無傷。癸水透干，大富大貴。無癸定作常人，運不行北，困苦一生。
	{yi56}''',    
    
    '乙申':'''    七月乙木，庚金乘令，庚雖輸情於乙妹，怎奈干乙難合支金。柱見庚多，乙難受載。或丙透干，又加巳出埋金，此格可雲科甲。有己透、加丙，亦是上命。七月喜己土為用，或不見丙癸。己土必不可少，此則以火為妻，土為子。
	或癸透、丙藏、庚少，此不用己，可許貢拔。無丙、有癸透者，不失刀筆門戶。有支下庚多，癸又藏者，無丙己二神，平常人物。

	或生辰時，此為從化，反主富貴。凡化合格皆以所生之神為用。化金者，戊為用神，特忌丙丁煆煉破格。從化者以火為妻，土為子。其餘以金為妻。妻必賢美。以水為子，子必克肖，但忌刑沖。凡命皆然，不特此也。

	秋乙逢金，非貧即夭。秋生乙木忌根枯，根既枯槁，貧苦到老。
    ''',    
    
    '乙酉':'''    八月乙木，芝蘭禾稼均退。以丹桂為乙木。在白露之後，桂蕊未開，端用癸水以滋桂萼。若秋分後，桂花已開，卻喜向陽，又宜用丙，癸水次之，丙癸兩透，科甲名臣。
	或支成金局，宜暗藏丁，無丁制金，恐木被金傷。若無水火，此人勞碌。或得癸水，為子得母，其人一生豐盈。或丙癸兩透，戊土雜出，亦主異路功名。

	生秋分後，有丙無癸，亦略富貴。若有癸無丙，名利虛花。若四柱不見丙癸，下格。

	或癸在年（月）干，丙透時干，名為木火文星，定主上達。生於秋分後方佳。或生上半月無癸，姑用壬水，不然，枯木無用，必作貧人。又四柱多見戊己，下格。

	用癸者，金妻、水子。用丙者，木妻、火子。用壬者，金妻水子。

	甲乙遇強金，魂歸西土，青龍逢兌旺，且貧且賤。

	乙木生居酉，莫逢巳酉丑，富貴坎離宮，貧窮申酉守。木逢金旺巳傷，再遇金鄉，豈不損壽。
    ''',     

    '乙戌':'''	
	九月乙木，根枯葉落，必賴癸水滋養。如見甲申時，名為藤蘿系甲，可秋可冬。若見癸水，又遇辛金發水之源，定主科甲。或有癸無辛，常人。有辛無癸，貧賤。或四柱壬多，水難生乙，亦是尋常之輩。

	或支多戊土，又逢天干，作從才看，無比劫方妙，一逢比劫，富屋貧人。

	用癸者，金妻、水子。但子女艱難，季土克制故也。
    ''',         

    '乙亥':'''	
	十月乙木，木不受氣，而壬水司令，取丙為用，戊土次之。丙戊兩透，科甲定然。有丙無戊，雖不科甲，亦入儒林。支多丙火，運入火鄉，亦主顯達。

	或水多無戊，乙性漂浮，流蕩之徒。若不見丙巳，妻子難全，或一點壬水，即多見戊土，亦為不妙，得甲制戊，可許能干，但為人好生禍亂，構訟生非，男女一理。支成木局，時值小陽，此又如春木同旺，若有癸出，須取戊為尊，加以丙透，科甲之人。若無丙戊二字，自成自敗，終非承受之輩。
    ''',     

    '乙子':'''
	十一月乙木，花木寒凍，一陽來複，喜用丙火解凍，則花木有向陽之意，不宜用癸以凍花木，故端用丙火。

	有一二點丙火出干，無癸制者，可許科甲。即丙藏支內，亦有選拔恩封，得此不貴，必因風水薄。或壬癸出干，有戊制，可作能人，即丙在支內，亦是俊秀。若壬透無戊，貧賤之人。

	支成水局，干透壬癸，丙丁全無，雖有戊制，貧乏到老，運至南方，稍有衣食。丁火有亦如無，丁乃燈燭之火，豈能解嚴寒之凍。設無丙丁，戊土多見，金水奔流，下賤。或有戊己無火，亦屬常人，但不至下賤。或一派丁火，大奸大詐之徒。如無甲引丁，孤鰥到老。丁火見甲，必主麟趾振振，芝蘭繞膝。

	或成水局，壬癸兩透，則木浮矣，不特貧賤，而且夭折，得一戊救方可。

	冬月之木，雖取戊制水，不可作用，端取丙火則可。用火者，木妻、火子。用土者，火妻、土子。

	乙木生於冬至之後，坐下木局，得丙透干者，富貴之造。即丁出干，亦有衣祿，須忌癸制丁。乙木生於冬月，己土透干，又有丙透，大富貴之造。
    ''',      

    '乙丑':'''	
	十二月乙木，木寒宜丙，有寒谷回春之象，得一丙透，無癸出破格，不特科甲，定主名臣顯宦。丙火藏支，食餼而已。干支無丙，一介寒儒。

	或四柱多己，不逢比劫，乃為從才，富比王侯，若見比劫，貧無立錐。雖或一派戊己，見甲頗有衣祿。端以丙火為用，方妙。
    ''',   

    '丙寅':'''	正月丙火，三陽開泰，火氣漸炎，取壬為尊，庚金佐之，壬庚兩透，科甲定然，即壬透庚藏，亦有異途顯達。

	若一庚高透，支藏一二丙火，納粟奏名，主為人慷慨英雄，有才邁眾。

	或一派庚辛混雜，常人，得時月兩透庚金、無辛者，定主清貴，或辛年辛時，名為貪合，酒也之徒，女命一理。

	或丙少壬多，而無戊制，名殺重身輕，斯人篌裡藏刀，尋非痞棍，或見一戊制壬，反成富貴，宜見一二比肩方妙。

	或一片戊土，甲不出干，終非大器，且恐孤貧，正月之丙，忌戊晦光，或支成火局，端取壬水為貴，無壬、癸亦姑用，若壬癸俱無，取戊以洩火氣，但屬平人。

	或支成火局，吊作炎上而推，但不逢時耳，若不見東南歲運，反致孤貧。

	或四柱有甲木，得康金暗制，可作秀才。

	無壬用癸者，略富貴，且官殺亦要旺有限，丙火無壬，多主貧賊，屢徵屢驗。或火多無水，一至水必死。不然，定有災咎，惟五月丙火，合炎上格，則不喜水破格、用癸無根，定主日疾。

	用壬者，金妻水子。用庚者，土妻金子。
    ''',   
	
    '丙卯':'''
	二月丙火，陽氣舒升，端用壬水，壬透天干，不見丁化，加以庚辛已亦透，壬水有根，定主科甲。

	或無壬水，己土姑用，主有才學，雖不能成名，必衣食充足。

	或一派壬水，見一戊制，雖不科甲，亦有恩庇。或無戊透，則有辰戌丑未之戊，但辰宮癸水，貪合成火，不能制壬，此平常衣祿。若支下全無一戊，此係奔流之人，加以金多生水，下賤之命。

	或一派戊土，亦用壬水，運喜行木，見土不祥，行火亦不利。

	或丙子日辛卯時，乃從化格，但不逢時貪才壞印，難招祖業。若得一二重丁火破辛，壬水得位，亦主富貴，雖不科甲，亦有異途，名傳郡邑。合此格，主妻妾多子。或月時見二辛卯，日乃丙子，名為爭合，年不透丁制辛，此人昏酒色，年透丁火，反吉。或支成木局，反因奸得才，因酒得名。

	凡用壬者，金妻水子。
    ''',   
    
    '丙辰':'''
	三月丙火，氣漸炎升，用壬水，或成土局，取甲木為輔，壬不可離，壬申兩透，科甲定宜，惟忌庚出制甲，則秀才而已。

	無甲用庚，助壬水洩土氣。

	壬透甲藏，富大貴小，有甲無壬，勞碌濁富，壬藏無甲，一介寒儒。壬甲兩無，愚賤之輩，乙丁雜亂，定必屬凡夫。

	用壬者，金妻水子，用甲者，水妻木子。

	三夏丙火：

	三夏丙火，陽威性烈，專用壬水。若亥宮壬水無力，回克洩氣故也，仍用申宮長生之水，方雲富貴。

	四月端用壬水，金為佐，五月亦端用壬。四五月壬透者富貴。丁多、兼看癸水，六月用壬，但借庚金為佐。

	陽刃合殺，威權萬里，丁火羊刃太旺，正謂羊刃倒戈，無頭之鬼，丙火用壬，生旺坐實方好，忌壬水太多，名殺重身輕。

    ''',    
    
    '丙巳':f'''    
	四月丙火，建祿於巳，火勢炎炎，宜專用壬水，解炎威之力，成既濟之功。如無壬水，孤陽失輔，難透清光，得庚發水源，方為有根之水。壬庚兩透，不見戊土，號曰湖水汪洋，廣映太陽，光輝顯著，文明之象，人合此格，不但科甲崢嶸，必有恩諡封榮。若不驗，必暗損陰德。

	或無壬水，癸亦姑用，見庚透癸，不富必貴。但心性乖僻，巧謀善辯。

	或壬癸俱無，愚頑之輩，火炎無制，僧道之流。

	或一派庚金，不見比劫，有富無貴。

	或丙什日干，四柱多壬，不見戊制，名曰陰刑殺重，光棍之流。或支成水局，加之重重壬透，一無制伏，盜賊之命，如見己土，下賤鄙夫。

	用壬者金妻水子。
    ''',   
    
    '丙午':'''    
	五月丙火愈炎，得壬庚高透，方為上命。或一壬無庚，亦主頁監，猶防戊己出干，丁壬化合，則為平人，即不透庚壬。或有申宮長生之水，濟之坐祿之金，至妙，必入詞林，又怕戊己雜亂，則為異路。

	或成火局，不見滴水者，乃僧道鰥獨之命，即有一二癸水，多遇火土，用之無力，瞽目之人，得戊己透火氣，亦主刑剋孤寡，行北運多兇，何也，所謂燥烈水激反兇。

	或成炎上格，柱運不見庚辛，多見甲乙者，反主大富貴，然亦不可見水運。

	或有庚癸透者，衣祿充足，支火輕，無目疾，支見水者，異途。或成土局，又為洩太過，得壬滋甲出干，土被制而火得生扶，此必富貴壽考之格也。
	''',    
    
    '丙未':'''    
	六月丙火退氣，三代生寒，壬水為用，取庚輔佐。
	庚壬兩透，貼身相生，可雲科甲名宦，若無庚有壬，不見戊出，小富小貴，見戊制壬則為賢而已。或己土出干混雜，此必庸夫俗子。或壬水淺，己土出干，其人貧困，無壬下格，賤而且頑，男女一理。

	或天干一派丙火，陽極生陰，干支兩見庚壬。

	總之六月丙火用壬，不同餘月用壬、喜運行西北，六月用壬，喜運行西南。
	''',    
    
    '丙申':'''    七月丙火，太陽轉西，陽氣衰矣，日近西山，見土皆晦，惟日照湖海，暮夜光天，故仍用壬水輔映光輝。

	如壬多，取戊制方妙，有壬透干，又見戊土出干，可雲科甲，如戊藏支內，不過生員，多壬無戊，平常人也。或戊多壬少，亦屬常人，或多壬，一戊出制，所謂眾殺猖狂，一仁可化，必主顥達，有權職。

	一派辛金，又為棄命從才，奇特之造，亦得恩榮，但多依親戚而為進身之階，從才者以水妻木子。
    ''',    
    
    '丙酉':'''
	八月丙火，日近黃昏，丙之餘光，存於湖海，仍用壬水輔映。
	四柱多丙，一壬高透為奇，定主登科及第，富貴雙全，一壬藏支，亦主秀才。或戊多困水，則假作斯文，若無壬水，癸亦可用，但功名不久。

	或見辛透，不能從化，貧苦到老，或見一丁制辛，為人奸詐，不識高低，女命合此，長舌氵㸒賤。

	或成金局，無辛出干，此非從才，乃朱門餓莩，如辛出干，不見比劫，此從才格，反主富貴，親戚提拔，妻賢內助，用水者，金妻水子，從才者，水妻木子。
    ''',     

    '丙戌':'''	
	九月丙火，火氣愈退，所忌土晦光，必須先用甲木，次取壬水。
	甲壬兩透，富貴非凡，苦無壬水，得癸透干，亦可，雖不科甲，異路功名，壬癸藏支，頁監而已，甲藏壬透，無庚破甲，可許秀才。或庚戊困了水木，定是庸才，無甲壬癸者，下格。

	或一派火土，雖不太旺，亦自燥矣，如不離過繼，亦主奔流，加以無庚辛壬癸出干，必為夭命。

	或支成火局，炎上失時，若運入南方，一貧徹骨。

	用甲者，水妻木子，用壬者，金妻水子。
    ''',         

    '丙亥':'''	
	十月丙火，太陽失令，得見甲戊庚出干，可雲科甲，主為人性好清高，斯文領袖。

	如辛透見辰，名化合逢時，主大貴。

	或壬多無甲，乃作棄命從殺，即不科甲，亦是宦僚。

	或壬多有甲無戊，郤非從殺，宜用己土混壬。

	總之十月丙火，木旺宜庚，水旺宜戊，火旺用壬，隨宜酌用可也。
    ''',     

    '丙子':'''
	十一月丙火，冬至一陽生，弱中復強，壬水為最，戊土佐之。

	壬戊兩透，科甲可許，無戊見己，異路功名。

	或無壬水，有癸出干，得金滋無傷，又有丙透以解凍，可許衣衿。

	或一派壬，則端用戊土，此人雖不成名，文章邁眾，但名利虛浮，何也，因戊晦光，又須甲木為藥也，或無壬水，癸亦可用，但不甚顯。

	或四柱多壬無甲，乃作棄命從殺，亦有雲路。

	或水多、有甲、無戊，郤非從殺，宜用己土濁壬，十一月丙火，與十月頗同。
    ''',      

    '丙丑':'''	
	十二月丙火，氣進二陽，每雪欺霜，喜壬為用，己土司令，土多又不可少甲，壬甲兩透，科甲堪宜，甲藏則秀才而已，或無甲得一壬透，富中取貴。

	如見一派己土，不見甲乙，名假傷官，聰明性傲，名利虛浮。

	或一派癸水，得己出干，必主自創基業，若制伏太過，又取辛金作用，得見癸透，此人即不成名，必清雅文墨之士。
    ''',         
        
    '丁寅':'''
	
	正月丁火，甲木當權，乃為母旺，非庚不能劈甲，何以引丁，姑用庚金。
	或一派甲木，無庚制之，非貧即夭。或只一甲木、多見乙木者，必離之客，焉問妻兒。或見甲乙，生庚子時，又主妻甲子早，宜可採芹。

	得壬化木，弱極復生，合此必主大貴，但此化合，反以不見庚破格為妙。

	或有庚金壬癸，得己出干制之，此命不由科甲，亦有異途。

	或一派壬癸，不得寅時，又無庚金，必主窮困。

	或丁年、壬月、丁日、壬時，男主大貴，女則不宜，此格以土為妻、金為子，但子女艱難，女命合此，氵㸒賤，刑夫克子。

	或支火局，無滴水解炎，僧道之命，見甲出略可，總不可無水，水多亦不宜。
    ''',   
	
    '丁卯':'''
	二月丁火，溼乙傷丁，先庚後甲，非不能去乙，非甲不能引丁。庚甲兩透，科甲定然，庚透甲藏，亦有生貢，甲透庚藏，異路功名。

	或庚乙俱透，庚必輸情於乙，未免貪合，運行金水，一貧徹骨。或庚透乙藏，則不能貪合，乙反引丁，即用乙亦無害．運入木火之鄉，自然富貴，用乙者水妻木子。

	若盡是乙木，不見一甲，此人富貴不久，因貪致禍，弄巧反拙，且不能承先人之業。

	或支成木局，有庚透、主清貴，不見庚者、常人，二月乙木司權，必須有庚，有乙無庚，主貧苦無依，用庚者、土妻金子。

	得印旺殺高，大富大貴。或一派水，無一戊制，主貧苦無依。或乙少癸多，有戊去制，反吉。用土者、火妻土子。
    ''',   
    
    '丁辰':'''
	三月丁火，戊土司令，洩弱丁氣，先用甲木引丁制土，次看庚金，庚甲兩透，定主科甲，或一藏一透，終非白丁。

	或支成木局，取庚為先，得庚透，丁癸不透，亦有異路功名。

	或支成水局，加以壬透，名殺重身輕，必夭折天年。或遭凶死，或戊己兩透，廊廟之客，若一甲破土，定是常人。

	用甲者、水妻木子，用金者、土妻金子。

    ''',    
    
    '丁巳':f'''    
	四月丁火乘旺，雖取甲引丁，必用庚劈甲，伐甲、方雲木火通明，甲多、又取庚為先。

	但四柱忌見癸水，癸水一見，洩庚、溼甲、傷丁，故以癸為病。

	或癸水藏支，壬水出干制丙，不奪丁光，自是鴈塔題名，玉堂清貴。

	或有庚無甲，戊透天干，此為傷官生才，又取戊為用，必主富貴，戊土出干，不見甲乙，又不見水，是傷官傷盡，八字清高，但不大貴，亦不大富，見水多木多，定是常人。

	或四柱多丙，不見壬癸，奪了丁光，此人貧苦，或丁年、巳月、丁巳日、丙午時，一丙不奪二丁，即不顥達，亦名播四鄰。故書曰，丁火陰柔一燭燈，太陽相見奪光明，柱中若見甲木透，定許身安福自臨。
    ''',   
    
    '丁午':'''    
	五月丁火，時歸建祿，不宜亂用甲木。

	遇年透隔位之壬，不貪丁合者，忠而且厚，或支成火局，干見火出，得庚壬兩透者，科甲定然，土透制壬，常人。即壬藏支中，亦非白丁，但要運行西北，方可發達，得一癸透，名獨殺當權，出人頭地。

	若見寅辰亥卯字，化木生火，平常人物，豐衣足食，中年富，但刑剋子息，勞而無功，或丙午月、丁未日、辛亥時，亥中有壬制丙，不致貧苦，若丙午時，則滴水難救炎火，必主僧道，若年支見子，雖不科甲，亦有衣衿。

	若干支無火局，有水透干，須用甲木，又要庚劈甲方明，木火通明，主大富貴，或木少火多，焚其木性，不能光透九霄，榮華不久。

	或生月是祿，支皆生旺合局，右以火出，無滴水解炎，乃身旺無依，孤貧之格，女必為尼，即運北地，反主兇危。

	用壬者、金妻水子，用甲者、水妻木子。
	''',    
    
    '丁未':'''    
	六月丁火，陰柔退氣，但值三伏生寒，丁弱極矣，專取甲木，壬水次之。

	若得甲出天干，支成木局，見亥中之壬，為木神有根，接引丁火，必然科甲，即不見木局，支見壬水，雖不大貴，亦有凌雲之氣，無庚不妙。

	或支成水局，見水透干，則溼木性，不能引丁，必為平常人，有甲透、有才干。有庚透，無刑傷，若無甲木，假名假利。

	或年月日時，皆一派丁未之類，此為純陰，終無大用。

	用甲者、水妻木子。
	''',    
    
    '丁申':'''
    七月丁火，退氣柔弱，端用甲木，金雖乘旺司權，無傷丁之理，仍取庚劈甲，為引火之物，或借丙暖金曬甲，不慮丙奪丁光，凡兩丙夾丁者，夏月忌之，餘月不忌，但此格少年困苦刑剋中年富貴，必要地支見水制丙，方妙。

    三秋甲庚丙並用，仍分優劣，何也，七月甲丙，申中有庚，八月甲丙庚皆用，七八月或無甲木，乙亦可用，為枯草引燈，郤不離丙曬也，九月端用甲庚，大抵甲一庚，乙不離丙，其理極明，或見甲庚丙皆透，必主科甲，無甲用乙者，富貴皆小，且富而不貴者多。

    或一重壬水，又多見癸水，必以戊土為制，自然富貴光輝。

    或一派庚金，名才多身弱，主富屋貧人，妻多主事，或壬多洩庚，丁壬化殺，反成富貴，若庚多無壬，奔流下賤。
    ''',    
    
    '丁酉':'''
	或八月一派辛金，不見庚金，又無比劫，比棄命從才，富而且貴，雖不科甲，亦有異途，從才者水為妻，不克，有正偏，木為子，不刑。
    ''',     

    '丁戌':'''	
	或九月一派戊土，洩丁火之氣，不見甲木，為傷官傷盡，非尋常可比，或甲木透出，為文書清貴，秋闈可奪，用甲者，庚不可少，水妻木子。
    ''',         

    '丁亥':f'''	
	{ding10_12}
    ''',     

    '丁子':f'''	
	{ding10_12}
    ''',      

    '丁丑':f'''	
	十二月丙火，氣進二陽，每雪欺霜，喜壬為用，己土司令，土多又不可少甲，壬甲兩透，科甲堪宜，甲藏則秀才而已，或無甲得一壬透，富中取貴。

	如見一派己土，不見甲乙，名假傷官，聰明性傲，名利虛浮。
	或一派癸水，得己出干，必主自創基業，若制伏太過，又取辛金作用，得見癸透，此人即不成名，必清雅文墨之士。
	{ding10_12}
    ''',         
    
    '戊寅':'''	
	正二月即有甲癸，若無丙除寒，如萬物生而不長，故無丙者，富貴艱辛，或有丙無甲癸者，名日春旱，如萬物生而厄，無甲癸者，一生勤苦，勞而無功，或一丙火，有甲久癸，先泰後否，或支成火局，不見壬癸，僧道孤貧，癸透者貴，壬透者富。

	用水者要審水之多少，或一派，甲木無丙常人，得一庚透方妙，或支成水局，甲又出干，又有庚透，富貴雙全。

	或無庚金，又無比印，難作從殺，定主遭兇，不然，必為盜賊，若日下坐午，不得善終。

	或一派乙木，為官殺會黨，即有庚從，郤難制乙，此人內奸外直，口是心非，加一甲在內，無庚，必懶惰自甘，好食無厭，或丙多甲多，宜以癸庚參用。
    ''',   
	
    '戊卯':'''
	正二月即有甲癸，若無丙除寒，如萬物生而不長，故無丙者，富貴艱辛，或有丙無甲癸者，名日春旱，如萬物生而厄，無甲癸者，一生勤苦，勞而無功，或一丙火，有甲久癸，先泰後否，或支成火局，不見壬癸，僧道孤貧，癸透者貴，壬透者富。

	用水者要審水之多少，或一派，甲木無丙常人，得一庚透方妙，或支成水局，甲又出干，又有庚透，富貴雙全。

	或無庚金，又無比印，難作從殺，定主遭兇，不然，必為盜賊，若日下坐午，不得善終。

	或一派乙木，為官殺會黨，即有庚從，郤難制乙，此人內奸外直，口是心非，加一甲在內，無庚，必懶惰自甘，好食無厭，或丙多甲多，宜以癸庚參用。
    ''',   
    
    '戊辰':'''
	三月戊土司令，不見丙甲癸者，愚而且賤，毋癸透者、科甲，兩癸透者、生員，甲癸俱藏者，只可雲富，有癸異途。

	若丙多無癸，旱田無水，不能種苗，舊穀已沒，新穀未登，此先富後貴之造，或火多有壬透者，先貧後富，癸透先賤後榮，壬藏不過食足，癸藏不過名傳，即此亦須運美，或支成火局，得癸透者，富貴天然，壬透富貴辛苦，何也，癸乃天上甘霖，壬乃江河波浪，所以有勞逸之殊。

	支成木局，又甲乙出干，此名官殺會黨，官殺無去留之義，得一庚透，掃除官殺，亦主富貴，無庚乃淺薄之人，宜用火洩木氣，有一命、丁未、癸卯、戊寅、乙卯、癸丁透干，加以戊癸化火，將甲木暗，反得武科探花。

	或木多無比印透，作從殺而論，亦富貴。

	或有比印，端看癸透，取癸而成貴格，無癸、無火、無金，名為土木自戰，主腹主疾病，憂愁艱苦。

	用甲者，水妻、木子，用丙者，木妻、火子。

	丙寅，庚寅，戊辰，庚申，丙癸．

    ''',    
    
    '戊巳':f'''    
	四月戊土，陽氣發升，寒氣內藏，外實內虛，不畏火炎，無陽氣相催，萬物不長，故先用甲疏劈，次取丙癸為佐。

	丙透甲出，廊廟之材，丙癸俱透，科甲之士，即透一位，支藏得所，終非白丁。

	若一派丙火，為火炎土燥，僧道之流，得一癸透壬藏，功名有準，或支藏癸，衣食充足，但骨肉多刑。

	化合成局無破，富貴非輕。

	或支成金局，干出癸水，此為奇格，正是土潤金生，即不為桃浪之客，定有異路恩榮。

	此用癸水，金妻水子。
    ''',   
    
    '戊午':'''    
	五月戊土，仲夏火炎，先看壬水，次取甲木，丙火酌用，用癸力微。

	壬甲兩透，名君臣慶會，自然桃浪先聲，權高位顯，又得辛透年干，官居一品，一命、辛未、甲午、戊寅、壬子，壬甲兩透，印旺殺高，出將入相，名播四夷。

	若支成火局，即透癸水，不能大濟，是一杯水濟車薪火也，人命合此，即好學不倦，亦能成名，且主目疾，若得壬水出干，則此非比。

	又或土木重重，全無滴水，僧道孤貧之輩。

	用壬者，金妻水子。
	''',    
    
    '戊未':'''    
	六月戊土，遇夏乾枯，先看癸水，次用丙火甲木。

	癸丙兩透，科甲中人，或有癸無丙，見甲可許秀才，無甲略富，或有丙無癸，假道斯文，衣食頗足，或癸透辛出，以刀筆之才，可謀異路，無癸丙者，常人，若又無甲，下賤之輩。

	或土多得一甲出，不見庚辛，為人作事軒昂，性情謹慎，即不顯揚，亦文章驚世。

	用癸者，金妻，水子，用丙者，木妻，火子，用甲者，水妻，木子。
	''',    
    
    '戊申':'''
    七月戊土，陽氣漸入，寒氣漸出，先丙後癸，甲木次之。

    丙癸甲透者，富貴極品，癸藏丙透，可期一榜，丙藏癸透，終成選拔，癸水會局藏辰，亦不失富貴，無丙得癸甲透，此人清雅，家富千金，無癸甲者，常人，有丙火，妻腎子肖，若丙甲癸三者俱無，下流之命。

    或支成水局，休作棄命從才，宜取甲洩之，甲透者，稍有富貴，用神妻子同前。
    ''',    
    
    '戊酉':'''
    八月戊土，金洩身寒，賴丙照暖，喜水滋潤，先丙後癸，不必木疏。
    丙癸兩透，科甲中人，丙透癸藏，可許入泮，癸透丙藏，納資得官，若丙藏又無癸，即多不透，此皆常人，癸丙全無，奔流之客。
    
    或四柱皆辛，無丙丁，此名傷官格為人清秀，即不能拾芥，亦可武庠，一見癸水，富而且貴。

    或支成水局，壬癸出干，此名才多身弱，愚懦無能，若天干有比劫分散才神，頗言衣食。

    用神妻子同前，秋土生金極弱，須丙火丁火出干方妙。
    ''',     

    '戊戌':'''	
	九月戊土當權，不可專用丙，先看甲木，次取癸水，郤忌化合，見金先用癸水，後取丙火，配合支干，方成有生之土，定發雲程。

	或無丙有癸，不見甲透者，衣衿小富，無癸丙，有甲者，衣食而已，若癸甲全無，雖有丙火，亦屬平常，或為僧道。

	或支成水局，壬癸透干，用戊止流，有比透反主富。

	支成火局，名土燥，不發。

	得金水兩透，此人清高，略可富貴，無水，一生困苦，妻子仝前。
    ''',         

    '戊亥':'''	
	十月戊土，時值小陽，陽氣略出，先用甲木，次取丙火，非甲，土不靈，非丙，土不暖，安能發生萬物，甲丙兩出，富貴中人。

	或甲得長生，遇支藏得地之水，一丙高透，亦主身貴揚名，支見庚金，入泮而已。

	若不見庚金，甲木藏支，丙火高透，科甲有之，若有庚，丁出制，必異路功名，或為典吏。

	即庚丁不透，甲丙藏支，亦云富貴。

	壬透得戊救丙，主富中取貴，丙甲俱無，必為僧道。
    ''',     

    '戊子':'''
	十一二月嚴寒冰凍，丙火為尊，甲木為佐，丙甲兩透，桃浪之人，丙出甲藏，采芹食　，丙藏甲出，佐雜前程，有丙無甲者，豪富，有甲無丙者，清貧，丙甲全無，下流之造。

	或一派丙火，加以丙透，運值火土，弱中復強，又一壬透干，主清高榮祿，乏壬，僧道孤寒。

	或一派水土寒滯，不見一丙，得一癸透月時，亦不失儒雅風流。

	或一派壬水，不見比劫，可作從才而論，即有比劫，得甲出干，又主富貴，若寒土無丙，雖有甲木，亦是內虛外實之人。

	或二癸透月時，名為爭合，終屬勞碌之人，得一己出干制癸，反為忠義之士，合己從人而論。

	年月透辛金者，又屬土金傷官，異路功名可許，以金為妻，水為子。
    ''',      

    '戊丑':'''	
	十一二月嚴寒冰凍，丙火為尊，甲木為佐，丙甲兩透，桃浪之人，丙出甲藏，采芹食　，丙藏甲出，佐雜前程，有丙無甲者，豪富，有甲無丙者，清貧，丙甲全無，下流之造。

	或一派丙火，加以丙透，運值火土，弱中復強，又一壬透干，主清高榮祿，乏壬，僧道孤寒。

	或一派水土寒滯，不見一丙，得一癸透月時，亦不失儒雅風流。

	或一派壬水，不見比劫，可作從才而論，即有比劫，得甲出干，又主富貴，若寒土無丙，雖有甲木，亦是內虛外實之人。

	或二癸透月時，名為爭合，終屬勞碌之人，得一己出干制癸，反為忠義之士，合己從人而論。

	年月透辛金者，又屬土金傷官，異路功名可許，以金為妻，水為子。
    ''',         
        
    
    '己寅':'''	正月己土，田園猶凍，蓋因臘氣未除，餘寒未退，故丙為尊，得丙照暖，萬物自生，忌見壬水，反為己病，何也，壬乃江湖之水，湖水一發，則田園洗盪，變為沙土，而根苗盡沒矣，須戊作堤，以保園圃，壬多要見戊制，有戊出干者，定主玉堂金馬，若乏制戊，必屬平常。

	或一派甲木，有庚出干，加以癸丙齊透，配得中和，亦名利雙全。

	即丙生寅月，庚透天干，亦有俊秀。

	若甲多無庚，殘疾廢人，宜用丁洩。

	或一派火，即不見水無礙，何也，正月己土溼，必丙燥暖，反主厚祿，加一癸透，科甲自然，戊透，反作常人。

	或一派戊土，有甲出制，又主榮顯，如見乙出，雖多不能疏土，且乙多者奸詐小人。

	用丙者，木妻，火子。
    ''',   
	
    '己卯':'''	 二月己土，陽氣漸升，雖禾稼未成，萬物出土，田園未展，先取甲木疏之，忌合，次取癸水潤之，甲癸出干，定主科甲，加以一丙出透，勢壓百僚，一見壬水，微末官職。

	或見庚制甲，壬水出干，比劫重重，此必俗子，丙透猶有小富，丙藏衣祿無虧。
	或支成木局，庚透富貴，若柱多乙木，乙又屈庚，庚必輸情於乙，不能掃邪於正，此必狡詐之徒，運入東南，恐有不測，當用丁洩之，有丁者，小人而已，不致無良。

	無比印，從殺者貴。

	若柱中無甲丙癸者，皆下格，妻子用神仝前。
    ''',   
    
    '己辰':'''    	三月己土，正栽培禾稼之時，先丙後癸，土暖而潤，隨用甲疏，三者俱透天干，必官居黃閣，或三者透一，科甲定然，但要得地，郤以庚金為病。
	或有丙甲無癸，亦可致富，但不貴顯，或有癸而無甲丙，亦有衣衿，或有丙癸無甲，亦系才人，丙癸全無，流俗之輩。

	或一片乙木，無金制伏，貧而且夭也，妻子仝前。
    ''',    
    
    '己巳':ji4_6,   
    
    '己午':ji4_6,    
    
    '己未':ji4_6,   
    
    '己申':ji7_9,    
    
    '己酉':ji7_9,     

    '己戌':ji7_9,         

    '己亥':ji10_12,     

    '己子':ji10_12,      

    '己丑':ji10_12,         
    
    '庚寅':'''	正月庚金，木旺之際，有土皆死，不能生金，且金之寒氣未除，先用丙暖庚性，又慮土厚埋金，須甲疏洩，丙甲兩透，科甲顯榮，二者透一，亦有生監，丙藏甲透，異路功名。

	或柱中土多，甲透者貴，甲藏者富，庚出則否。

	或丁火出干，加以戊己而無水者，又主富貴，何也，寅中甲木，引丁有根，無水為病，名官星有氣，才旺生扶，故以富貴推之，如火多則用土，用土者火妻土子。

	或支成炎局，壬透，有根者，大富貴，無根者，小富貴，乏水者，殘疾之人。

	或木被金傷，無丙丁出制，支無丁火，此係平人，或丙遭癸困，無戊制者亦然。

	總之正月庚金，丙甲為上，丁火次之，春金多火，不夭則貧，陽金最喜火煉，煆煉太過，反主奔流。
    ''',   
	
    '庚卯':'''	 二月庚金，柱中自然有乙，當令之乙，見庚必留情於乙，此金有暗強之勢，如秋金一理，故二月庚金，專用丁火，借甲引丁，借庚劈甲，無丁用丙者，富貴多出於勉強。
	或丁在干，甲透引丁，支下再見一庚制甲，配得中和，必然大貴，如不見庚合者，雖丁甲兩透，亦屬平人，春丁不旺不衰，故用甲為佐丁之物，甲若無庚劈，則不能引丁，乙木雖多，又忌溼乙傷丁，難為丁母，故有丁甲無庚者，常人，有丁庚，甲不出干者，常人，或丁透無庚甲者，可許貢監，無丁有丙者，異路功名。

	或一片甲乙，忌庚出幫破才，乃從才格，反主富貴，若見一比，又主孤貧。

	從才者，火妻土子，用丁者，取甲為妻，若有庚制，難許同偕。

	死金嫌蓋頂之泥，重見戊己，如人壓伏之象，須甲透為妙。
    ''',   
    
    '庚辰':'''    	三月庚金，戊土司令，無生金之理，有埋金之憂，故先甲後丁，不用庚劈甲，三月之庚，土旺金頑，頑金宜丁，旺土須甲，乏甲不能立業，乏丁焉能成名，二者少一，富貴不真，庚金無火，非夭則貧，身弱才多，富貴不久。
	得丁甲丙透，不見比肩，科甲之命，但要好運相催，甲透丁藏，采芹拾芥，甲藏丁透，異路功名，丁甲俱藏，不受庚制，富中取富，刀筆起家，有甲無丁，平常之輩，有丁無甲，迂儒腐儒，丁甲兩無，下賤之流。

	或一甲，無丁，有丙，由行伍而得官職，須不見壬，癸，為妙。

	或支成土局，無木，貧賤僧道，見乙，奸詐小人。

	或支成火局，癸水透，富貴，有丙丁出干，見壬制之，方吉，無制，殘疾之人。

	用甲者，水妻木子，用丁者，木妻火子。
    ''',    
    
    '庚巳':'''    
	四月庚金，長生於巳，巳內有戊，丙不熔金，故不畏火炎，丙亦可作用，但先壬水，方得中和，故曰群金生夏，喜用勾陳，次取戊土，丙火佐之，三者皆全，登科及第，即透一二，亦非白丁。
	或一派丙火，名曰假殺為權，須不見壬制者，此人假作清，高並無仁義，刑妻克子，有壬制者，又主榮華，壬藏支者，有富貴之名，而無其實。

	或支成金局，變弱為強，用丙無力，用丁方妙，故丁透者吉，無丁，無用之人，或丁出三四，煆制太過，其人奔波。

	四月庚金，須用壬丙戊，但非拘執先後，宜分病用藥，妻子仝前。

	偷戟成功，入火鄉而反害，金逢火已損，再見火必傷，庚辛火旺怕南方，逢辰巳之鄉，又為榮斷。
    ''',   
    
    '庚午':'''    
	五月庚金，丁火旺烈，庚金敗地，專用壬水，癸又次之。
	壬透癸藏，支見庚辛，必然科甲，切忌戊己透干制水，則否，戊藏支內，不失儒林，或壬在支，有金生助，又得金神出干，明經之貴，或癸出帶辛，異路之榮。

	或支成炎局，乏水者，奔波之客，有壬癸制者，捐納之人，又見戊己透者則否，無壬癸制火者，又宜戊己出干補金洩火，庶不夭折孤貧。

	總之仲夏無水，非上格，或一派木火，無傷，印，比劫，又作從殺而論。
    ''',    
    
    '庚未':'''    
	六月庚金，三伏生寒，頑鈍極矣，先用丁火，次取甲木。
	丁甲兩透名顯身榮，忌癸傷丁，有甲無丁，庸俗，有丁無甲，生員，丁甲全無，下賤之人，木雖有，丁不透，支又見水，執鞭之士，丁火無傷，貿易之流。

	支會土局，甲先丁後，甲透者，文章顯達，丁透者，刀筆揚名。

	或柱多金，有二丁出制，異路功名。
    ''',   
    
    '庚申':'''    七月庚金，剛銳極矣，專用丁火煆煉，次取木引丁，故曰，秋金銳銳最為奇，壬癸相逢總不宜，如逢木火來成局，試看福壽與天齊，如得丁甲兩透，定步青雲，若有丁無甲為俊秀，有甲無丁是平人，丁甲兩無無用物，只堪門下作閒人。
	或支成水局，乏丁用丙，柱中即有丙火，不見甲木者，必主愚懦，何也，當時金水兩旺，金生水以制火，何能發達，或見甲出引丁，可雲生監，甲弱者，衣食充盈。

	或支成土局，先甲後丁。

	支成火局，富貴中人，金剛木明，行商坐賈之人，金備申酉戌之地，富貴疑，金神入火鄉，逢羊刃富貴榮華。
    ''',    
    
    '庚酉':'''    八月辛金，當權得令，旺之極矣，專用壬水淘洗，故云金見水以流通，如見戊己，則生扶太過，故以土為病，見甲八月庚金，剛銳支退，用丁甲，丙不可少，若丁甲透，又見一丙，功名顯赫，且見羊刃無刑沖，丙殺藏支，名為羊刃架殺，主出將入相，直介忠臣。

	或丙火重重，一丁高透，亦主科甲，丙出丁藏，異路之仕。

	或甲藏支，火透而水不透者，亦主清高，衣衿可望。

	或丁藏支內，重見丙火者，此名假殺重重，雖羊刃帖身，郤難從殺也。

	即一丙透，秀而不富，或支見重重甲乙，無用人也，總之旺金木衰，非火莫制，不見丙丁，藝術之輩。
    ''',     

    '庚戌':'''	
	九月庚金，戊土司令，最怕土厚埋金，宜先用甲疏，後用壬洗，則金自出矣，忌見己土濁壬。
	壬甲兩透，科甲相宜，或甲透壬藏，鄉魁可望，甲藏壬透，廩貢堪謀，有甲無壬，猶有學問，有壬無甲，莫問衣衿，壬甲兩無，則為下格。

	或支成水局，丙透救之，此人才高邁眾，名重鄉閭，不見癸水，一榜可許。

	或四柱戊多金旺，全無甲壬者，即有衣祿，亦不能久，或庚戊多無壬甲者，愚頑之輩。
    ''',         

    '庚亥':'''	
	十月庚金，水冷性寒，非丁莫造，非丙不暖。

	丁甲兩透，支無水局，一榜有之，支藏丙火，桃浪之仙，支見亥子，得己出制，亦有功名。

	若見丙透無丁者，無顯達，丁藏甲透，武職之人，以上不合者，庸俗。

	如金水混雜，全無丙丁者，鄙夫，支成金局，無火者，僧道之命也，書曰，水冷金寒愛丙丁。
    ''',     

    '庚子':'''
	十一月庚金，天氣嚴寒，仍取丁甲，次取丙火照暖，或丁甲兩透，丙在支中，必主科甲，即無丙火，亦有衣衿，有丁無甲，亦可富中取貴，有甲無丁，只作常人，或丙透丁藏，異途名望，丁藏有甲，武學可許。

	或重重丙火，可許一富，但不清高，丙戊生寅，或丙底坐寅，有一二者，富真貴假，若見癸透，一介寒儒。

	或支成水局，不見丙丁者，此乃傷官格，為人清雅，衣祿常盈，但子息艱難耳。
	或丙丁太多，名官煞混雜最無良，又怕身輕有損傷，如遇東南二運地，焉能捱得過時光，過於清冷，似有淒涼，柱中一派金水，不入火土之鄉，主一生孤貧浪蕩，難望有成也。
    ''',      

    '庚丑':'''	
	十二月庚金，寒氣太重，且多溼泥，愈寒愈凍，先取丙火解凍，次取丁火鍊金，甲亦不可少。
	丙丁甲透者，即不科甲，亦有恩榮，有丙無丁甲者，富中取貴，有丁甲無丙者，特達才人，有丙丁無甲者，白手成家，刀筆亨通，乏金更美，或支成金局無水，僧道之流。
    ''',         
    
    '辛寅':'''	正月辛金，陽氣舒而寒未除，不知正月建寅，中有長生之丙，解去寒氣，忌甲木司權，辛金失令，取己土為身之本，欲得辛金發現，全賴壬水之功，己壬兩透，支見庚制甲，科甲定然，或己土透干，支中有甲，異路恩榮，或己土不全，號曰君臣失勢，富貴難全，或有丙火出干，亦主武學，或見壬，無己庚者，貧賤之徒。

	或支成火局，即壬水出干，不克己土，亦尋常之人，或庚壬兩透，破局制火，必為顯達之人。

	或支成水局，不見丙火，名為金弱沉寒，平常之士，書曰金水性寒寒到底，淒涼難免少年憂，得丙透照暖，反主富貴。

	故正月辛金，先己後壬，己為君，庚為佐，如用丙火須參看，用己，火妻土子，用壬，金妻水子。

	辛金珠玉，最怕紅爐，辛逢卯日，子時，名曰朝陽。
    ''',   
	
    '辛卯':'''	 二月辛金，陽和之際，壬水為尊，見戊己為病，得甲制伏，則辛金不致埋沒，壬水不致混濁，合此者必身入玉堂，故二月庚金，有壬甲透者貴顯，不則，鄉紳，或壬坐亥支，不見土出，可能入芥，家亦小康，得申中之壬者，異途名望，無壬者常人，其生克之理，與正月辛金皆同。

	或壬戊透，甲不出干，此為病不遇藥，平常之人，得乙破戊，頗有衣衿，但假名假利，刻薄乖張。

	或一派壬水汪洋，名金水淘洗太過，不得中和，略有衣食，全無作為，如壬水重重，得戊反吉。

	或支成木局，洩盡壬水，有庚富貴，無庚平人。

	或支成火局，名官印相爭，金水兩傷，下流之格，得二壬出制，富貴反奇。

	辛金生於春季，一派壬水，而無丙水，即能顯達，家無宿舂，得壬丙齊透，方許大富大貴。
    ''',   
    
    '辛辰':'''    	三月辛金，戊土司令，辛承正氣，母旺子相，先壬後甲，壬甲兩透，富貴必然，壬透甲藏，廩貢不失，甲透壬藏，富貴可雲，壬甲皆無，平常之格。

	所忌者丙貪合也，如月時皆丙，名為爭合，主慷慨風流，交四海，若癸出干制丙，可許采芹，或支坐亥子之鄉，支又見申，即非玉堂，亦必高增祿位，若戊出干制水，不見甲乙，清閒之人。

	又或支見四庫，名土厚埋金，不見甲制，愚頑之輩。

	或四柱火多，無水制伏，名火土雜亂，主作緇衣，見癸可解。

	或比劫重重，壬癸淺弱，主夭，有甲出干，則貴，然無庚制方妙。
    ''',    
    
    '辛巳':'''    
	四月辛金，時道首夏，忌丙火之燥烈，喜壬水之洗淘，支成金局，水透出干，有木制戊，名一清澈底，科甲功名，癸透壬藏，富真貴假，若壬癸皆藏，戊己亦藏，略富，若壬癸俱無，反見火出，必主鰥獨。

	或支成火局，有制者吉，無制者兇，凡火旺無水，取土洩之。

	若壬水藏亥，戊不出干，亦主上達，有戊常人，有一甲透，衣祿可求，若有甲無壬癸者，富貴虛浮，所謂羊質虎皮是也。

	壬，癸，甲，三者全無，又不合格，斯為下品。
    ''',   
    
    '辛午':'''    五月辛金，丁火司權，辛金失令，陰柔之極，不宜煆煉，須己壬兼用，何也，己為泥沙，壬為湖海，己無壬不溼，辛無己不生，故壬己並用，無壬，癸亦可用，但癸力小，或支成火局，即重見癸出，亦不濟，得壬透破火方可，必主生員，若無壬，癸見戊，雖有午宮己土，燥泥成灰，金必煆熔，反遭埋沒，必為僧道，有一二重比肩，不致孤獨。

	五月辛金，壬，癸，己，三者皆用。

	或壬己兩透，支見癸水，不沖，定主顯達，即己藏支，亦有廩貢，或無壬有己，須得異途，或癸出有庚，必主衣錦，叨受恩榮，若水土多者，見甲方妙。

	庚辛生於夏月，要壬癸得地，若木多火多，不見金水，逢金水運必敗。
    ''',    
    
    '辛未':'''    六月辛金，己土當權，輔助太多，恐掩金光，先用壬水，取庚佐之，壬庚兩透，科甲功名，即不出干，藏支得所，亦有榮華，但忌戊出，得甲制之，方吉，甲須隔位，恐貪己合，反掩金光，又寒壬水之流，下賤之格，又忌庚出制甲，或只有未中一己，見子壬水，又為溼泥，不可見甲，甲出，反作平人，總以一壬一己，見庚無甲，方妙，與五月用己壬同。

	或丁乙出干，又有庚壬者，顯貴，無壬者，否，或支成木局，得壬透，又有庚金發水之源，可雲富貴。
    ''',   
    
    '辛申':'''    七月辛金，值庚司令，不旺自旺，且壬水居申，四柱不見戊土，胎元戊藏申內，為壬岸，人命得此，為官清正，但不富耳。

	或有土無甲，為有病無藥，常人，有甲者，衣衿可望。

	或四柱金多，宜水洩之，若一金水，得一戊土，反為辛用，又宜甲制，自然富貴。

	或干支水多，重見戊土，逢生得位，福壽之造。

	七月辛金，壬不在多，故書曰，水淺金多，號曰體全之象，壬水為尊，甲戊酌用可也，癸水不可為用。
    ''',    
    
    '辛酉':'''    八月辛金，當權得令，旺之極矣，專用壬水淘洗，故云金見水以流通，如見戊己，則生扶太過，故以土為病，見甲制土，方妙，無戊，不宜用甲。

	或四柱一點壬水，甲多洩水，此為用神無力，奸詐之徒，得庚制者，反主仁義，或三點辛金，一重壬水，多見甲木，有庚透者，主大富貴，不見丁為美，若見一丁，此人風雅清高，衣食饒裕而已。

	或一二比肩，壬甲皆一，無庚出干，亦有恩榮。

	若二三比肩，一點壬水，戊土多見，此為土厚埋金，此人愚懦，見一甲出，必為創立之人。

	或一派辛金，一位壬水，無庚雜亂，又主富中取貴。

	或一派壬水洩金，無戊出制，為沙水同流，主奔波貧苦，若得支見一戊止流，其人頗有才略，藝術過人。

	或支成金局，干見比肩，無壬淘洗，此宜用丁，無丁必主兇頑無賴，若得一壬高透，以洩群金，又名一清到底，定有治國之材。

	或支成金局，戊己透干，壬透無火，名白虎格，運行西北，富貴大顯，子息艱難，或透丙火，雖有壬出，亦屬平庸。

	或一二辛金，一派己土，定為僧道，或干透己土，支見庚甲，一生安閒。

	或一派乙木，不見庚壬，為才多身弱，一見庚制，富貴可期。

	金生秋月土重，貧無寸鐵，六辛日透戊子時，運喜西方，陰若朝陽，切忌丙丁離位，庚辛局全巳酉丑，位重權高。
    ''',     

    '辛戌':'''	九月辛金，成土司令，母旺子相，須甲疏土，壬洩旺金，先壬後甲，壬甲兩透，桃洞之仙，或壬透甲藏，又見者，平人，甲透，壬藏，戊在支內，異途之仕。

	或辛日甲月，壬水在支，有庚自能去濁留清，秋聞一榜，若戊戌月，即有甲在支亦否。

	總之土太多，甲不出干，莫問功名，一壬出，洗土助甲，雖不發達，富而可求。

	或土多無壬甲，時月多透丙辛者，略貴，加以辰字在支，則榮顯莫及。

	或木多土厚，無水者常人，或干上重見癸水，雖無淘洗之功，頗有清金之用，此命主富，辛苦。

	或己透無壬有癸，亦能滋生金力，衣衿之貴，但恐己多，不免濁富。

	九月辛金，火土為病，水木為藥。
    ''',         

    '辛亥':'''	十月辛金，時值小陽，陽漸升，寒氣將降，先用壬水，次取丙火，壬丙兩透，金榜題名，何也，蓋辛金有壬水丙火，名金白水清，又在亥月故發。

	丙透壬藏，采芹之造，丙藏壬透，富有千金，壬丙在支，聰明之士。

	戊壬存柱，積蓄之人，或壬多無戊，名辛水汪洋，反成貧賤，戊多壬少，又主成名。

	或甲多戊少，因藝術而蓄金。

	若己多有戊，壬水被困，金被埋，不過誠實之人，或壬癸多無戊丙者，勞碌辛苦，十月辛金，先壬後丙，餘皆參用。
    ''',     

    '辛子':'''
	十一月辛金，癸水司令，為寒冬雨露，切忌癸出凍金，而困丙火，壬丙兩透，不見戊癸，衣錦腰金，即壬藏丙透，一榜堪圖。
	或壬多有戊，丙甲出干者，青雲之客，若壬多無戊丙者，洩金太過，定主寒儒，或壬多，甲乙重重，無丙火者，貧寒。

	或支成水局，癸水出干，有二戊制者，富貴恩榮，無戊者常人。

	或支見亥子丑，干出比劫，無丙，名潤下格，富貴雙全，運喜西北，若無庚辛，又出甲乙，無戊丙者，必主僧道。

	或支成木局，有丁出干，又見戊者，功名特達，冬月辛金，須丙溫暖，方妙。
    ''',      

    '辛丑':'''	十二月辛金，寒凍之極，先丙後壬，炳不能解凍，無壬不能洗淘，丙壬兩透，金馬玉堂之客，壬丙俱藏，遊庠食　之人，有丙無壬，富真貴假，有壬乏丙，賤而且貧，或丙多，無壬，有癸，市中貿易之流。

	或水多，有戊己出干，又有丙丁，必主衣食充盈，一生安樂，十二月辛金，丙先壬後，戊己次之。
    ''',     
    
    '壬寅':'''
    正月壬水，汪洋之象，淵淵不息，既失其令，亦無氾濫之虞，蓋水性秉弱故也。
    先用庚金發水之源，次取丙火以除寒氣，又次取戊土以止其流，不致汪洋無度。
    得庚丙戊三者齊透天干，鳳池桃浪之客。或庚成透，丙生在寅，亦主富貴恩榮。即一庚透無破，貢監衣矜不少。
    凡壬日無比肩羊刃，不必用成，專以庚金為尊，丙火為佐或見比劫庚辛，是弱極復生之象，當以成土為制。
    戊透科甲，戊藏秀才，異途更顯，且事理通達，但無祖業，俱屬自創。此格須兩透方合。
    或戊多有透有藏，得一甲出干，名一將當關，群邪自伏，光輝難掩，權位非輕。
    或支成火局，水火既濟。但兩不逢時，名利皆虛，好談無心輕諾寡信。
    用庚者，土妻金子。用丙者，木妻火子，妻賢子肖。用戊者，火妻土子，妻賢子肖，百事百成。
    python bazi.py -g 1962 2 23 3  魁罡格 大富
    python bazi.py -g 1962 3 5 3 御史
    python bazi.py -g 1922 2 13 17 常人
    python bazi.py -g 1898 2 8 17 張孝若 制住戊己官煞 專取時支西金正印為用 享上萌之福 已運乙亥年被刺遇害 寅午戌年見已為亡神 亥為劫最忌合 已西寅亥皆合 歲運復沖 不得令終命也。
    python bazi.py -g 1906 2 7 3 溥儀 不能從財 類印綬而不成印 煎熬太過 倚托別房父母之力 入贅過房命也。支成火局 水火失時 名利皆虛。
    ''',   
	
    '壬卯':'''
    二月寒氣悉除 清流湛深 不可用火 專取戊土為堤岸 辛發其源。
    戊辛兩透 科甲有準。或成土出干 辛藏於酉 恩封可期 不止貢監衣矜。或戊辛兩藏 無甲丁透干 定主秀才。
    或無戊辛有庚 富貴庚透大富 庚藏小富
    或支成木局 庚金透干 科甲名顯 庚藏異途
    或者支有木生火，木盛火炎，當取比肩幫身，一滴可潤萬里，富貴無疑。或一派木多，唯獨日干一壬，又無庚金，壬水洩弱，雖儒士亦傍人度日。無火用壬，衣祿常人。
    或比肩重重，又須戊土，書曰:土止流水福壽全。若戊不見，名水泛木浮，一生辛苦，再行水運，為水身亡。
    或甲乙重重無比肩者，此依人度日，全無作為，若見庚辛，飢寒可免。
    總之水盛不可無戊，木盛不可無庚，火盛不可無壬，與其需要以定取用。甲乙重無比肩，當是無庚辛之誤。若見庚辛，當是若見比肩之誤。

    python bazi.py -g 1858 3 20 0 康有為 水旺透庚 水木傷官佩印 兩子沖午 子卯相刑 卯午又破 沖激動盪 出於天性 戊土止水 福壽兩全 水木清華 科甲之貴 未運戊成年 釀維新政變 酉運戊午年 又釀復辟之禍 壬運丁卯年卒 壽七十
    python bazi.py -g 1962 3 5 3 御史
    python bazi.py -g 1922 2 13 17 常人
    python bazi.py -g 1898 2 8 17 張孝若 制住戊己官煞 專取時支西金正印為用 享上萌之福 已運乙亥年被刺遇害 寅午戌年見已為亡神 亥為劫最忌合 已西寅亥皆合 歲運復沖 不得令終命也。
    python bazi.py -g 1906 2 7 3 溥儀 不能從財 類印綬而不成印 煎熬太過 倚托別房父母之力 入贅過房命也。支成火局 水火失時 名利皆虛。
    ''',   
    
    '壬辰':'''    
	三月壬水，戊土司權，死有推山塞海之患，先用甲疏季土，次取庚金。
	甲庚俱透，科甲定然，甲透庚藏，修齊品格，甲藏有根，可雲俊秀，有癸滋甲，必主干城，獨甲藏支，必富，獨庚在柱，常人，無甲，剛暴之徒，乏庚，愚頑之輩。

	或時干透丁者，此為化合，助火而不助水，見丁未一理。

	或支成四庫，乏甲者，名殺重身輕，終身有損。

	凡水旺多見庚金者，乃無用之人，須丙制之方妙。
    ''',    
    
    '壬巳':'''    
	四月壬水，丙火司權，水弱極矣，專取壬水比肩為助，次取辛金發源，且暗合丙火，庚金為佐。

	壬辛兩透，金榜有名，或癸辛兩出，加以甲透，亦主異路之榮，無甲者，富貴門下之客。

	如無壬，木少火多者，又作棄命從才格，因妻致富，癸透者殘疾。

	或四柱多金得地，則弱極復強，須用巳中戊土，亦主名利雙全，或異途之貴，若見一甲藏寅，與己相刑，主有暗疾，名利皆虛，不能創立。

	或多甲乙，有庚出干者，貴，無庚者否。

	或支成水局，大貴。
    ''',   
    
    '壬午':'''    五月壬水，丁旺壬弱，取癸為用，取庚為佐，無庚不能發水，無癸不能傷丁，五月壬水，辛癸亦可參用，其理與四月皆同。

	庚癸兩透，科甲必然，庚壬兩透，官居極品，有庚無壬癸者，常人。

	或支成火局，全無金水，名才多身弱，富屋貧人，若又甲乙多者，僧道之命。
    ''',    
    
    '壬未':'''    六月壬水，己土當權，丁火退氣，先用辛金癸水，次用甲木劈土，六月壬水，先辛後甲，次取癸水。
	辛甲兩透，富貴清高，甲藏辛透，貢監生員，辛藏甲透，異途武職，甲壬兩透，無傷，有治國之貴，即甲藏壬出無破，是拾芥之才，或支多土火，又只清貧。

	或一派己土，此假從殺格，為人奸詐，且主孤貧，得甲乙出制可救，凡土居生旺之地，須用木制方妙。

	或支成木局，洩水太過，當用金水為貴，以金為妻，水為子。
    ''',   
    
    '壬申':'''    七月壬水，庚金司令，壬得申之長生，源流自遠，轉弱為強，專用戊土，次取丁火佐戊制庚，但用辰戌之戊，不用申中受病之戊，戊丁俱透，科甲生員，戊透天干，丁藏午戌，恩封可待，特忌戊癸化合，即支見寅戌，年出丁火，可許衣衿，或丁戊兩藏，富中取貴。

	或四柱多壬戊又透干，名假殺化權，閬苑之仙，支中見甲，亦不忌也，但太多者，常人，有庚居申，頗有衣祿。
	或戊多而透，得一甲制，略貴，無甲常人，或一派甲木，又見火多，無庚出者，別祖離鄉，隨緣度日，蓋申中之庚，不能救也。

	七月壬水，栽用戊土，丁火為佐。
    ''',    
    
    '壬酉':'''    八月壬水，辛金司權，正金白水清，忌戊土為病，專用甲木，甲木一透制戊，壬水澈底澄清，名高翰苑，若甲出時干，功名顯達，設見庚破，又屬常人，即甲藏支，無庚，秀才可許。

	或天干有壬，支見申亥，此非用甲，戊土作用，亥雖有甲，又有申中之金制甲，秀才一定，且富足多才。

	或無戊，多金水者，主人清才濁，困苦寒儒。

	無甲用金，發水之源，名獨水三犯庚辛，號曰體全之象。

	八月壬水，栽用甲木，庚金次之，用甲者，水妻木子。
    ''',     

    '壬戌':'''
    九月壬水進氣，其性將厚，若一派壬水，見一甲，制戌中之戊，戊又出干，斯用丙火，此格清貴極矣，正合一將當關，群邪自伏，或不見丙戊，亦不為妙。
    或一派戊土，無一己庚雜亂，得一甲透時干，玉堂清貴，即甲透月上，亦主科甲，若支藏己土，一榜可圖，或庚乏丁，貧賤之人。

    或丁透見甲，略貴。或水多乏丙者，又用戊土，常人。

    九月壬水，栽用甲木，次用丙火，用土者，火妻土子。
    ''',         

    '壬亥':'''	十月壬水司權，至旺之極，取戊為用，若生辰日干，又見辰時，必須戊透，又須庚制甲，不傷戊土，戊庚兩全，定主登科及第，，位顯權高，或甲出制戊，不見庚救者，斷之困窮，戊藏無制，可許生員，或戊庚兩透無甲者，亦主榮顯。

	或支木局，有甲乙出干，得庚透者，富貴，無庚者，平常。

	或支成水局，不見戊己，名潤下格，運行西北，大富貴，行東南者，必危。

	或丙戊兩透，行火土運，名利雙全，或有丙無戊，可雲衣祿，有戊無丙，難許推盈，十月壬水，專用戊丙，次取庚金。
    ''',     

    '壬子':'''
	十一月壬水，陽刃幫身，較前更旺，先取戊土，次用丙火，丙戊兩透，富貴榮華，有戊無丙，略可言富，有丙無戊，好謀無成。

	或支成水局，丙不出干，即有戊土，亦系庸人，或丙透得所，即戊藏支，亦可顯達，須運得用方妙。

	或支成火局，一富而已。

	或比見月時，年見丁火，平常之輩，支成四庫，富貴中人，或丁出時干，名為爭合，主名利難成。

	或壬子日，丁未時，雖不能科甲，亦有恩榮，何也，蓋用子中癸水為宮，號曰用神得地，亦主榮華。

	十一月壬水，丙戊並用。
    ''',      

    '壬丑':'''	十二月壬水，旺極復衰，何也，上半月癸辛主事，故旺，專用丙火，下半月己土主事，故衰，亦用丙火，甲木佐之。

	有丙解凍，名利雙全，丙透甲出，科甲之貴，然四柱無壬，方妙，無丙，單寒之士。

	或四柱多壬，戊透制之，衣衿可望。

	或丁出時干，化合成木，月干又見丁火，無癸破格，亦主富貴。

	或支成金局，不見丙丁，名金寒水冷，一世孤貧，見火略可，即丙透遇辛，亦不為妙，見丁頗吉。

	臘月壬水，先取丙火，丁甲為佐，故水冷金寒愛丙丁，用火者，木妻火子。

	水旺居垣須有智，水土混雜必愚頑，壬癸路經南域，主健，富貴堪圖，又云，惟有水木傷官格，才官相見始為歡
    ''',     
    
    '癸寅':'''    正月癸水，值三陽之後，雨露之精，其性至柔，先用辛金，生癸水之源，次用丙火照暖，名陰陽和合，萬物發生，辛丙兩透，金榜有名。
    或支成火局，辛金受傷，有壬出救者，富貴，無壬者，貧窮，或丙出天干，辛在酉丑，亦有衣衿，若辛丙皆無，貧寒下格，或辛透丙藏，恩榮之造，丙辛在柱，以富得官。

    或戊透月上，坐辰時，不見比劫，丙丁出干，此為化合，定主腰金，見刑沖，則否。

    或支成水局，宜有丙透，無壬者，衣祿不少，若見丙火重重，又作貴推。

    正月癸水，辛金為主，庚金次之，丙亦可少，若無庚辛，雖有丙火，無用之人，或火多土多，殘疾不免。

    用辛者，土妻金子。
    ''',    
    
    '癸卯':'''    二月葵水，不剛不柔，乙木司令，洩弱元神，專用庚金為用，辛金次之，庚辛俱透，無丁出干者，貴由科甲，無庚辛者常人。
    或庚透辛藏，榮封有準，庚藏辛透，亦有衣衿，庚辛兩藏，富中取貴，或刀筆揚名，或庚辛重見，有己丁出干者亦貴。

    或支成木局，月時又見木者，為洩水太過，定主貧困多災，即運入西方，亦屬無用。
    ''',   
    
    '癸辰':'''    三月癸水，要分清明穀雨，清明後，火氣未熾，專用丙火，為陰陽合諧，穀雨後，雖用丙火，尚宜辛甲佐之，如辛卯，壬辰，癸未，丙辰，生上半月，用丙火，顯達，生下半月，必無傷辛金癸水，方妙，然丙亦不可少，用丙，木妻水子。

    三月癸水，從化者多，得化者榮祿，不化者平常。

    或支成水局，又見己土，無木，乃假殺格，有甲出者，常人。

    或支坐四庫，又得甲透，可謂顯達名揚，無甲者僧道孤苦。

    或支成木局，無金，名傷官生才格，主聰明博學，衣祿充饒。

    三月癸水，辛甲皆酌用，下半月，土妻金子。
    ''',    
    
    '癸巳':'''    四月癸水，喜辛金為用，無辛用庚，若辛高透，不見丁火，加以壬透，主科名榮貴，聲播四夷，若有丁破格，貧無立錐，有壬可免，辛藏無丁，貢監衣衿。
    或一派火土乏辛，即有巳庚，亦不能生水，又無比肩羊刃，必至熬乾癸水，損日無疑，艾壬兩透，洩制火土，名劫印化晉，極貴之造，有丁見干者，則否，如有庚無壬，亦無丁破金者，堪入儒林，有庚無辛者，異路功名，總之四月癸水，專用辛金方妙。
    ''',   
    
    '癸午':'''    五月癸水，至弱無根，必須庚辛為生身之本，但丁火司權，金難敵火，安能滋養癸水，宜見比劫，方得辛金之用，五月癸水，庚辛壬參酌並用可也。
    如庚辛透干，又見壬癸者，定主鍾鼎名家，或有金透，支見申子辰者，亦主金榜掛名，或無水出干，支只一水，雖有庚辛，一富之造，故曰，水源會，富重貴輕，又曰，金水會夏天，富貴永無邊，運行火土地，快樂似神仙。

    或支成炎局，無壬出干，定主僧道，或二壬一庚同透，衣錦腰金。

    或一派己土，無甲出制，此作從殺而論，又主大貴，凡從殺者，切不可破格方吉。
    ''',    
    
    '癸未':'''    六月癸水，有上下月之分，下半月庚辛有氣，上半月庚辛休囚，凡六癸日，多不驗者，何也，俗士不知此理，因未中有乙巳同宮，破而不破，故癸水不能從殺，所以專用庚辛，如上半月金神衰弱，火氣炎烈，宜比劫助身，可雲富貴，與五月一理，下半月庚辛有氣，即無比劫亦可，又忌丁透，即丁在支亦不吉，其生克制化，與五月略同。
    ''',   
    
    '癸申':'''    七月癸水，正母旺子相之時，癸雖死申，殊不知申中有庚生之，名死處逢生，弱中復強，即運行西北，亦不死也，但庚司令，剛銳極矣，必取丁火為用，或丁透有甲，名有焰之火，必主科甲，或丁透無甲，又無壬癸，即有一二庚金，亦有生監，有二丁更妙，或金多乏丁制者，貧困之人。
    或一丁坐午，名獨才格，主金玉滿堂，富中取貴，若在未戌，則是常人，或柱見二戌二未，又得丙丁藏支，干見甲出，無水，亦作富貴而推。
    ''',    
    
    '癸酉':'''    八月癸水，辛金虛靈，非頑金可比，正金白水清，故取辛金為用，丙火佐之，名水暖金溫，如丙與辛隔位同透，主科甲功名，或丙透辛藏，一榜之士，或土多克水，生意中心，八月癸水，丙辛怕用。
    ''',     

    '癸戌':'''
    九月癸水，失令無根，戊土司權，克制太過，專用辛金發水之源，要比肩滋甲制戊方妙。
    或辛甲兩透，支見子癸，定主平步青雲，或癸甲兩透，富貴成名，或有甲辛無癸者，亦有恩封，或有甲癸無辛者，富大貴小，有甲無癸辛者，常人，三者俱無，貧賤之格。

    或有甲見壬者，頗許衣衿。

    九月癸水，辛甲並用。
    ''',         

    '癸亥':'''
    十月癸水，旺中有弱，何也，因亥搖木，洩散元神，宜用庚辛為妙，得庚辛兩透，不見丁傷者，功名有準。

    或支成木局，有丁出干，為木旺火相，制住庚辛不生水，必主清寒，或成木局，干見丙丁，異路之榮。

    或一派壬水，不見戊制，名冬水汪洋，奔波到老，若得戊透，清貴堪誇。

    或一派庚辛，得丁出制，主名利雙全，若不見丁，又主貧薄。

    或四柱火多，名才多身弱，富屋貧人。
    ''',     

    '癸子':'''
    十一月癸水，值冰凍之時，金水無交歡之象，專用丙火解凍，庶不致成冰，又要辛金滋扶，無丙有辛，不妙，凡冬季癸水，有丙透解凍，則金溫水暖，兩兩相生，要不見壬透，自然登科及第，紫誥金章。

    或一派壬水，無丙出干，寒困之士，一派癸水，孤賤之流，或支成水局，得丙火重出干者，又主蟒袍玉帶之榮。

    或支成金局，丙火無蹤者，芒鞋革履之流。

    如辛年，丙月，癸日，有火者，主恩榮寵錫，繞膝芝蘭，無火者，損資得貴，位重當朝。

    或一派戊己，名殺重身輕，非貧即夭。

    用火者，木妻火子，用辛者，土妻金子。
    ''',      

    '癸丑':'''
    十二月癸水，寒極成冰，萬物不能舒泰，宜丙火解凍，或丙透年時，加以壬透，支中多戊，名水輔陽光，主顯達名臣，無戊者，異途之職，若有丙無壬，黌門之客，有壬無丙，戊又出干者，皂隸之流。

    或支見子丑，比肩出干，即有丙透，不能解凍，此屬平常，或無癸水，有辛與合，亦不為美，有丁出，頗吉。

    或一片癸己會黨，年透丁火，名雪後燈光，夜生者貴，日生者否，若無丁火，又主孤貧。

    或支成水局，無丙者，四海為家，一生勞苦。

    或支成火局，有庚辛透者，衣食充足，無金出，孤苦零丁。

    或支成金局，丙透得地，名金溫水暖，彼此相生，定許光大門閭，聲馳翰苑，乏丙者，即文章駭世，總為孫山。

    或支成木局，洩水太過，主殘病呻吟，得金出干輔救，技藝之流。

    凡冬月用丙，須丙火得地方妙，不然，即重重丙火出干，安能輕許富貴哉。
    ''',     
}


